{
  "verses": [
    {
      "verseNumber": 1,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 2,
      "verseString": "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
      "verseStringB": "Praise be to Allah, Lord of the Worlds."
    },
    {
      "verseNumber": 3,
      "verseString": "الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "The Compassionate, the Merciful."
    },
    {
      "verseNumber": 4,
      "verseString": "مَالِكِ يَوْمِ الدِّينِ",
      "verseStringB": "Master of the Day of Judgment."
    },
    {
      "verseNumber": 5,
      "verseString": "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ",
      "verseStringB": "You alone we worship; and upon You, we call for help."
    },
    {
      "verseNumber": 6,
      "verseString": "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ",
      "verseStringB": "Guide us along the straight path."
    },
    {
      "verseNumber": 7,
      "verseString": "صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ",
      "verseStringB": "The path of those You have blessed, not of those with anger on them, nor of the misguided."
    }
  ],
  "nameEnglish": "The Opening",
  "nameTrans": "al-Fatihah",
  "nameArabic": "الفاتحة",
  "chapterNumber": 1,
  "nVerses": 7,
  "footnotes": [
    {
      "note": "a. I retain the ordinary translation of the particle bå, but I must warn the reader that the sense of this particle is not the same in Arabic as the sense of the word in in the equivalent phrase in the name of God. In, in the latter case, signifies on account of, whereas the bå in Arabic signifies by, or through, or, to be more exact, with the assistance of. The phrase is in fact equivalent to: I seek the assistance of Allåh, the Beneficent, the Merciful (AH). Hence it is that a Muslim is required to begin every important affair with Bismillåh.\n\n b. Allåh, according to the most correct of the opinions respecting it, is a proper name applied to the Being Who exists necessarily by Himself, comprising all the attributes of perfection (T-LL), the al being inseparable from it, not derived (Msb-LL). Al-ilåh is a different word, and Allåh is not a contraction of al-ilåh. The word Allåh is not applied to any being except the only true God, and comprises all the excellent names, and the Arabs never gave the name Allåh to any of their numerous idols. Hence, as being the proper name of the Divine Being and not having any equivalent in any other language, I have adopted the original word in this translation.\n\n c. Ra√mån and Ra√ßm are both derived from ra√mat, signifying tenderness requiring the exercise of beneficence (R), and thus comprising the ideas of love and mercy. AlRa√mån and al-Ra√ßm are both active participle nouns of different measures denoting intensiveness of significance, the former being of the measure of fa‘lån and indicating the greatest preponderance of the quality of mercy, and the latter being of the measure of fa‘ßl and being expressive of a constant repetition and manifestation of the attribute (AH). The Prophet is reported to have said: “Al-Ra√mån is the Beneficent God Whose love and mercy are manifested in the creation of this world, and al-Ra√ßm is the Merciful God Whose love and mercy are manifested in the state that comes after” (AH), i.e. in the consequences of the deeds of men. Thus the former is expressive of the utmost degree of love and generosity, the latter of unbounded and constant favour and mercy. Lexicologists agree in holding that the former includes both the believer and the unbeliever for its objects, while the latter relates specially to the believer (LL). Hence I render al-Ra√mån as meaning the Beneficent, because the idea of doing good is predominant in it, though I must admit that the English language lacks an equivalent of al-Ra√mån. "
    }
  ]
}