{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "الْحَمْدُ لِلَّهِ فَاطِرِ السَّمَاوَاتِ وَالْأَرْضِ جَاعِلِ الْمَلَائِكَةِ رُسُلًا أُولِي أَجْنِحَةٍ مَثْنَىٰ وَثُلَاثَ وَرُبَاعَ ۚ يَزِيدُ فِي الْخَلْقِ مَا يَشَاءُ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "Praise be to Allāh, the OrigInᵃ tor of the heavens and the earth, the Maker of the angels, messengers flying on wings, two, and three, and four.ᵃ He increases in creation what He pleases.ᵇ Surely Allāh is Possessor of power over all things."
    },
    {
      "verseNumber": 2,
      "verseString": "مَا يَفْتَحِ اللَّهُ لِلنَّاسِ مِنْ رَحْمَةٍ فَلَا مُمْسِكَ لَهَا ۖ وَمَا يُمْسِكْ فَلَا مُرْسِلَ لَهُ مِنْ بَعْدِهِ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "Whatever Allāh grants to men of (His) mercy, there is none to withhold it, and what He withholds, none can grant thereafter. And He is the Mighty, the Wise."
    },
    {
      "verseNumber": 3,
      "verseString": "يَا أَيُّهَا النَّاسُ اذْكُرُوا نِعْمَتَ اللَّهِ عَلَيْكُمْ ۚ هَلْ مِنْ خَالِقٍ غَيْرُ اللَّهِ يَرْزُقُكُمْ مِنَ السَّمَاءِ وَالْأَرْضِ ۚ لَا إِلَٰهَ إِلَّا هُوَ ۖ فَأَنَّىٰ تُؤْفَكُونَ",
      "verseStringB": "O men, call to mind the favour of Allāh to you. Is there any Creator besides Allāh who provides for you from the heaven and the earth? There is no God but He. How are you then turned away?"
    },
    {
      "verseNumber": 4,
      "verseString": "وَإِنْ يُكَذِّبُوكَ فَقَدْ كُذِّبَتْ رُسُلٌ مِنْ قَبْلِكَ ۚ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ",
      "verseStringB": "And if they reject thee — truly messengers before thee were rejected. And to Allāh are all affairs returned."
    },
    {
      "verseNumber": 5,
      "verseString": "يَا أَيُّهَا النَّاسُ إِنَّ وَعْدَ اللَّهِ حَقٌّ ۖ فَلَا تَغُرَّنَّكُمُ الْحَيَاةُ الدُّنْيَا ۖ وَلَا يَغُرَّنَّكُمْ بِاللَّهِ الْغَرُورُ",
      "verseStringB": "O men, surely the promise of Allāh is true, so let not the life of this world deceive you. And let not the archdeceiver deceive you about Allāh."
    },
    {
      "verseNumber": 6,
      "verseString": "إِنَّ الشَّيْطَانَ لَكُمْ عَدُوٌّ فَاتَّخِذُوهُ عَدُوًّا ۚ إِنَّمَا يَدْعُو حِزْبَهُ لِيَكُونُوا مِنْ أَصْحَابِ السَّعِيرِ",
      "verseStringB": "Surely the devil is your enemy, so take him for an enemy. He only invites his party to be companions of the burning Fire."
    },
    {
      "verseNumber": 7,
      "verseString": "الَّذِينَ كَفَرُوا لَهُمْ عَذَابٌ شَدِيدٌ ۖ وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ مَغْفِرَةٌ وَأَجْرٌ كَبِيرٌ",
      "verseStringB": "Those who disbelieve, for them is a severe chastisement. And those who believe and do good, for them is forgiveness and a great reward. "
    },
    {
      "verseNumber": 8,
      "verseString": "أَفَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَنًا ۖ فَإِنَّ اللَّهَ يُضِلُّ مَنْ يَشَاءُ وَيَهْدِي مَنْ يَشَاءُ ۖ فَلَا تَذْهَبْ نَفْسُكَ عَلَيْهِمْ حَسَرَاتٍ ۚ إِنَّ اللَّهَ عَلِيمٌ بِمَا يَصْنَعُونَ",
      "verseStringB": "Is he whose evil deed is made fairseeming to him so that he considers it good? — Now surely Allāh leaves in error whom He pleases and guides aright whom He pleases, so let not thy soul waste in grief for them. Surely Allāh is Knower of what they do."
    },
    {
      "verseNumber": 9,
      "verseString": "وَاللَّهُ الَّذِي أَرْسَلَ الرِّيَاحَ فَتُثِيرُ سَحَابًا فَسُقْنَاهُ إِلَىٰ بَلَدٍ مَيِّتٍ فَأَحْيَيْنَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا ۚ كَذَٰلِكَ النُّشُورُ",
      "verseStringB": "And Allāh is He Who sends the winds, so they raise a cloud, then We drive it on to a dead land, and therewith give life to the earth after its death. Even so is the quickening.ᵃ"
    },
    {
      "verseNumber": 10,
      "verseString": "مَنْ كَانَ يُرِيدُ الْعِزَّةَ فَلِلَّهِ الْعِزَّةُ جَمِيعًا ۚ إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَالْعَمَلُ الصَّالِحُ يَرْفَعُهُ ۚ وَالَّذِينَ يَمْكُرُونَ السَّيِّئَاتِ لَهُمْ عَذَابٌ شَدِيدٌ ۖ وَمَكْرُ أُولَٰئِكَ هُوَ يَبُورُ",
      "verseStringB": "Whoever desires might, then to Allāh belongs the might wholly. To Him do ascend the goodly words, and the goodly deed — He exalts it. And those who plan evil — for them is a severe chastisement. And their plan will perish.ᵃ"
    },
    {
      "verseNumber": 11,
      "verseString": "وَاللَّهُ خَلَقَكُمْ مِنْ تُرَابٍ ثُمَّ مِنْ نُطْفَةٍ ثُمَّ جَعَلَكُمْ أَزْوَاجًا ۚ وَمَا تَحْمِلُ مِنْ أُنْثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِ ۚ وَمَا يُعَمَّرُ مِنْ مُعَمَّرٍ وَلَا يُنْقَصُ مِنْ عُمُرِهِ إِلَّا فِي كِتَابٍ ۚ إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ",
      "verseStringB": "And Allāh created you from dust, then from the life-germ, then He made you pairs. And no female bears, nor brings forth, except with His knowledge. And no one living long is granted a long life, nor is aught diminished of one’s life, but it is all in a book. Surely this is easy to Allāh.ᵃ"
    },
    {
      "verseNumber": 12,
      "verseString": "وَمَا يَسْتَوِي الْبَحْرَانِ هَٰذَا عَذْبٌ فُرَاتٌ سَائِغٌ شَرَابُهُ وَهَٰذَا مِلْحٌ أُجَاجٌ ۖ وَمِنْ كُلٍّ تَأْكُلُونَ لَحْمًا طَرِيًّا وَتَسْتَخْرِجُونَ حِلْيَةً تَلْبَسُونَهَا ۖ وَتَرَى الْفُلْكَ فِيهِ مَوَاخِرَ لِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ",
      "verseStringB": "And the two seas are not alike: the one sweet, very sweet, pleasant to drink; and the other salt, bitter. Yet from both you eat fresh flesh and bring forth ornaments which you wear. And thou seest the ships cleave through it, that you may seek of His bounty and that you may give thanks."
    },
    {
      "verseNumber": 13,
      "verseString": "يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ كُلٌّ يَجْرِي لِأَجَلٍ مُسَمًّى ۚ ذَٰلِكُمُ اللَّهُ رَبُّكُمْ لَهُ الْمُلْكُ ۚ وَالَّذِينَ تَدْعُونَ مِنْ دُونِهِ مَا يَمْلِكُونَ مِنْ قِطْمِيرٍ",
      "verseStringB": "He causes the night to enter in upon the day, and causes the day to enter in upon the night, and He has made subservient the sun and the moon, each one moves to an appointed time. This is Allāh, your Lord; His is the kingdom. And those whom you call upon besides Him own not a straw.ᵃ"
    },
    {
      "verseNumber": 14,
      "verseString": "إِنْ تَدْعُوهُمْ لَا يَسْمَعُوا دُعَاءَكُمْ وَلَوْ سَمِعُوا مَا اسْتَجَابُوا لَكُمْ ۖ وَيَوْمَ الْقِيَامَةِ يَكْفُرُونَ بِشِرْكِكُمْ ۚ وَلَا يُنَبِّئُكَ مِثْلُ خَبِيرٍ",
      "verseStringB": "If you call on them, they hear not your call; and if they heard, they could not answer you. And on the day of Resurrection they will deny your associating them (with Allāh). And none can inform thee like the All-Aware One."
    },
    {
      "verseNumber": 15,
      "verseString": "يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ ۖ وَاللَّهُ هُوَ الْغَنِيُّ الْحَمِيدُ",
      "verseStringB": "O men, it is you that have need of Allāh, and Allāh is the Self- Sufficient, the Praised One."
    },
    {
      "verseNumber": 16,
      "verseString": "إِنْ يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ",
      "verseStringB": "If He please, He will remove you and bring a new creation."
    },
    {
      "verseNumber": 17,
      "verseString": "وَمَا ذَٰلِكَ عَلَى اللَّهِ بِعَزِيزٍ",
      "verseStringB": "And this is not hard to Allāh."
    },
    {
      "verseNumber": 18,
      "verseString": "وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۚ وَإِنْ تَدْعُ مُثْقَلَةٌ إِلَىٰ حِمْلِهَا لَا يُحْمَلْ مِنْهُ شَيْءٌ وَلَوْ كَانَ ذَا قُرْبَىٰ ۗ إِنَّمَا تُنْذِرُ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ وَأَقَامُوا الصَّلَاةَ ۚ وَمَنْ تَزَكَّىٰ فَإِنَّمَا يَتَزَكَّىٰ لِنَفْسِهِ ۚ وَإِلَى اللَّهِ الْمَصِيرُ",
      "verseStringB": "And no burdened soul can bear another’s burden. And if one weighed down by a burden calls another to carry his load, naught of it will be carried, even though he be near of kin. Thou warnest only those who fear their Lord in secret and keep up prayer. And whoever purifies himself, purifies himself only for his own good. And to Allāh is the eventual coming."
    },
    {
      "verseNumber": 19,
      "verseString": "وَمَا يَسْتَوِي الْأَعْمَىٰ وَالْبَصِيرُ",
      "verseStringB": "And the blind and the seeing are not alike,"
    },
    {
      "verseNumber": 20,
      "verseString": "وَلَا الظُّلُمَاتُ وَلَا النُّورُ",
      "verseStringB": "Nor the darkness and the light,"
    },
    {
      "verseNumber": 21,
      "verseString": "وَلَا الظِّلُّ وَلَا الْحَرُورُ",
      "verseStringB": "Nor are shade and torrid heat."
    },
    {
      "verseNumber": 22,
      "verseString": "وَمَا يَسْتَوِي الْأَحْيَاءُ وَلَا الْأَمْوَاتُ ۚ إِنَّ اللَّهَ يُسْمِعُ مَنْ يَشَاءُ ۖ وَمَا أَنْتَ بِمُسْمِعٍ مَنْ فِي الْقُبُورِ",
      "verseStringB": "Neither are the living and the dead alike. Surely Allāh makes whom He pleases hear, and thou canst not make those hear who are in the graves.ᵃ"
    },
    {
      "verseNumber": 23,
      "verseString": "إِنْ أَنْتَ إِلَّا نَذِيرٌ",
      "verseStringB": "Thou art naught but a warner."
    },
    {
      "verseNumber": 24,
      "verseString": "إِنَّا أَرْسَلْنَاكَ بِالْحَقِّ بَشِيرًا وَنَذِيرًا ۚ وَإِنْ مِنْ أُمَّةٍ إِلَّا خَلَا فِيهَا نَذِيرٌ",
      "verseStringB": "Surely We have sent thee with the Truth as a bearer of good news and a warner. And there is not a people but a warner has gone among them.ᵃ"
    },
    {
      "verseNumber": 25,
      "verseString": "وَإِنْ يُكَذِّبُوكَ فَقَدْ كَذَّبَ الَّذِينَ مِنْ قَبْلِهِمْ جَاءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ وَبِالزُّبُرِ وَبِالْكِتَابِ الْمُنِيرِ",
      "verseStringB": "And if they reject thee, those before them also rejected — their messengers came to them with clear arguments, and with scriptures, and with the illumInᵃ ting Book.ᵃ"
    },
    {
      "verseNumber": 26,
      "verseString": "ثُمَّ أَخَذْتُ الَّذِينَ كَفَرُوا ۖ فَكَيْفَ كَانَ نَكِيرِ",
      "verseStringB": "Then I seized those who dis - believed, so how (terrible) was My disapproval!"
    },
    {
      "verseNumber": 27,
      "verseString": "أَلَمْ تَرَ أَنَّ اللَّهَ أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجْنَا بِهِ ثَمَرَاتٍ مُخْتَلِفًا أَلْوَانُهَا ۚ وَمِنَ الْجِبَالِ جُدَدٌ بِيضٌ وَحُمْرٌ مُخْتَلِفٌ أَلْوَانُهَا وَغَرَابِيبُ سُودٌ",
      "verseStringB": "Seest thou not that Allāh sends down water from the clouds, then We bring forth therewith fruits of various hues? And in the mountains are streaks, white and red, of various hues and (others) intensely black."
    },
    {
      "verseNumber": 28,
      "verseString": "وَمِنَ النَّاسِ وَالدَّوَابِّ وَالْأَنْعَامِ مُخْتَلِفٌ أَلْوَانُهُ كَذَٰلِكَ ۗ إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ ۗ إِنَّ اللَّهَ عَزِيزٌ غَفُورٌ",
      "verseStringB": "And of men and beasts and cattle there are various colours likewise. Those of His servants only who are possessed of knowledge fear Allāh. Surely Allāh is Mighty, Forgiving."
    },
    {
      "verseNumber": 29,
      "verseString": "إِنَّ الَّذِينَ يَتْلُونَ كِتَابَ اللَّهِ وَأَقَامُوا الصَّلَاةَ وَأَنْفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً يَرْجُونَ تِجَارَةً لَنْ تَبُورَ",
      "verseStringB": "Surely those who recite the Book of Allāh and keep up prayer and spend out of what We have given them, secretly and openly, hope for a gain which perishes nota —"
    },
    {
      "verseNumber": 30,
      "verseString": "لِيُوَفِّيَهُمْ أُجُورَهُمْ وَيَزِيدَهُمْ مِنْ فَضْلِهِ ۚ إِنَّهُ غَفُورٌ شَكُورٌ",
      "verseStringB": "That He may pay them back fully their rewards and give them more out of His grace. Surely He is Forgiving, Multiplier of reward."
    },
    {
      "verseNumber": 31,
      "verseString": "وَالَّذِي أَوْحَيْنَا إِلَيْكَ مِنَ الْكِتَابِ هُوَ الْحَقُّ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ ۗ إِنَّ اللَّهَ بِعِبَادِهِ لَخَبِيرٌ بَصِيرٌ",
      "verseStringB": "And that which We have revealed to thee of the Book, that is the truth, verifying that which is before it.ᵃ Surely Allāh is Aware, Seer of His servants."
    },
    {
      "verseNumber": 32,
      "verseString": "ثُمَّ أَوْرَثْنَا الْكِتَابَ الَّذِينَ اصْطَفَيْنَا مِنْ عِبَادِنَا ۖ فَمِنْهُمْ ظَالِمٌ لِنَفْسِهِ وَمِنْهُمْ مُقْتَصِدٌ وَمِنْهُمْ سَابِقٌ بِالْخَيْرَاتِ بِإِذْنِ اللَّهِ ۚ ذَٰلِكَ هُوَ الْفَضْلُ الْكَبِيرُ",
      "verseStringB": "Then We have given the Book as inheritance to those whom We have chosen from among Our servants: so of them is he who wrongs himself, and of them is he who takes a middle course, and of them is he who is fore most in deeds of goodness by Allāh’s permission.ᵃ That is the great grace,"
    },
    {
      "verseNumber": 33,
      "verseString": "جَنَّاتُ عَدْنٍ يَدْخُلُونَهَا يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِنْ ذَهَبٍ وَلُؤْلُؤًا ۖ وَلِبَاسُهُمْ فِيهَا حَرِيرٌ",
      "verseStringB": " Gardens of perpetuity, which they enter — they are made to wear therein bracelets of gold and pearls, and their dress therein is silk.ᵃ"
    },
    {
      "verseNumber": 34,
      "verseString": "وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي أَذْهَبَ عَنَّا الْحَزَنَ ۖ إِنَّ رَبَّنَا لَغَفُورٌ شَكُورٌ",
      "verseStringB": "And they say: Praise be to Allāh, Who has removed grief from us! Surely our Lord is Forgiving, Multiplier of reward,ᵃ"
    },
    {
      "verseNumber": 35,
      "verseString": "الَّذِي أَحَلَّنَا دَارَ الْمُقَامَةِ مِنْ فَضْلِهِ لَا يَمَسُّنَا فِيهَا نَصَبٌ وَلَا يَمَسُّنَا فِيهَا لُغُوبٌ",
      "verseStringB": "Who out of His grace has made us alight in a house abiding forever; therein toil touches us not nor does fatigue afflict us therein.ᵃ"
    },
    {
      "verseNumber": 36,
      "verseString": "وَالَّذِينَ كَفَرُوا لَهُمْ نَارُ جَهَنَّمَ لَا يُقْضَىٰ عَلَيْهِمْ فَيَمُوتُوا وَلَا يُخَفَّفُ عَنْهُمْ مِنْ عَذَابِهَا ۚ كَذَٰلِكَ نَجْزِي كُلَّ كَفُورٍ",
      "verseStringB": "And those who disbelieve, for them is Fire of hell; it is not finished with them so that they should die, nor is chastisement thereof lightened to them. Thus We deal retribution on every ungrateful one."
    },
    {
      "verseNumber": 37,
      "verseString": "وَهُمْ يَصْطَرِخُونَ فِيهَا رَبَّنَا أَخْرِجْنَا نَعْمَلْ صَالِحًا غَيْرَ الَّذِي كُنَّا نَعْمَلُ ۚ أَوَلَمْ نُعَمِّرْكُمْ مَا يَتَذَكَّرُ فِيهِ مَنْ تَذَكَّرَ وَجَاءَكُمُ النَّذِيرُ ۖ فَذُوقُوا فَمَا لِلظَّالِمِينَ مِنْ نَصِيرٍ",
      "verseStringB": "And therein they cry for succour: Our Lord, take us out! we will do good deeds other than those which we used to do! Did We not give you a life long enough, for him to be mindful who would mind? And there came to you the warner. So taste; because for the iniquitous there is no helper."
    },
    {
      "verseNumber": 38,
      "verseString": "إِنَّ اللَّهَ عَالِمُ غَيْبِ السَّمَاوَاتِ وَالْأَرْضِ ۚ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ",
      "verseStringB": "Surely Allāh is the Knower of the unseen in the heavens and the earth. Surely He is Knower of what is in the hearts."
    },
    {
      "verseNumber": 39,
      "verseString": "هُوَ الَّذِي جَعَلَكُمْ خَلَائِفَ فِي الْأَرْضِ ۚ فَمَنْ كَفَرَ فَعَلَيْهِ كُفْرُهُ ۖ وَلَا يَزِيدُ الْكَافِرِينَ كُفْرُهُمْ عِنْدَ رَبِّهِمْ إِلَّا مَقْتًا ۖ وَلَا يَزِيدُ الْكَافِرِينَ كُفْرُهُمْ إِلَّا خَسَارًا",
      "verseStringB": "He it is Who made you successors in the earth. So whoever disbelieves, his disbelief is against himself. And their disbelief increases the disbelievers with their Lord in naught but hatred; and their disbelief increases the disbelievers in naught but loss."
    },
    {
      "verseNumber": 40,
      "verseString": "قُلْ أَرَأَيْتُمْ شُرَكَاءَكُمُ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ أَرُونِي مَاذَا خَلَقُوا مِنَ الْأَرْضِ أَمْ لَهُمْ شِرْكٌ فِي السَّمَاوَاتِ أَمْ آتَيْنَاهُمْ كِتَابًا فَهُمْ عَلَىٰ بَيِّنَتٍ مِنْهُ ۚ بَلْ إِنْ يَعِدُ الظَّالِمُونَ بَعْضُهُمْ بَعْضًا إِلَّا غُرُورًا",
      "verseStringB": "Say: Have you seen your associates which you call upon besides Allāh? Show me what they have created of the earth! Or have they any share in the heavens? Or, have We given them a Book so that they follow a clear argument thereof? Nay, the wrongdoers hold out promises one to another only to deceive."
    },
    {
      "verseNumber": 41,
      "verseString": "إِنَّ اللَّهَ يُمْسِكُ السَّمَاوَاتِ وَالْأَرْضَ أَنْ تَزُولَا ۚ وَلَئِنْ زَالَتَا إِنْ أَمْسَكَهُمَا مِنْ أَحَدٍ مِنْ بَعْدِهِ ۚ إِنَّهُ كَانَ حَلِيمًا غَفُورًا",
      "verseStringB": "Surely Allāh upholds the heavens and the earth lest they come to naught. And if they come to naught, none can uphold them after Him. Surely He is ever Forbearing, Forgiving."
    },
    {
      "verseNumber": 42,
      "verseString": "وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ لَئِنْ جَاءَهُمْ نَذِيرٌ لَيَكُونُنَّ أَهْدَىٰ مِنْ إِحْدَى الْأُمَمِ ۖ فَلَمَّا جَاءَهُمْ نَذِيرٌ مَا زَادَهُمْ إِلَّا نُفُورًا",
      "verseStringB": "And they swore by Allāh, their strongest oaths, that, if a warner came to them, they would be better guided than any of the nations. But when a warner came to them, it increased them in naught but aversion,ᵃ"
    },
    {
      "verseNumber": 43,
      "verseString": "اسْتِكْبَارًا فِي الْأَرْضِ وَمَكْرَ السَّيِّئِ ۚ وَلَا يَحِيقُ الْمَكْرُ السَّيِّئُ إِلَّا بِأَهْلِهِ ۚ فَهَلْ يَنْظُرُونَ إِلَّا سُنَّتَ الْأَوَّلِينَ ۚ فَلَنْ تَجِدَ لِسُنَّتِ اللَّهِ تَبْدِيلًا ۖ وَلَنْ تَجِدَ لِسُنَّتِ اللَّهِ تَحْوِيلًا",
      "verseStringB": "Behaving proudly in the land and planning evil. And the evil plan besets none save the authors of it. So they wait for naught but the way of the ancients. But thou wilt find no alteration in the course of Allāh; and thou wilt find no change in the course of Allāh."
    },
    {
      "verseNumber": 44,
      "verseString": "أَوَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِنْ قَبْلِهِمْ وَكَانُوا أَشَدَّ مِنْهُمْ قُوَّةً ۚ وَمَا كَانَ اللَّهُ لِيُعْجِزَهُ مِنْ شَيْءٍ فِي السَّمَاوَاتِ وَلَا فِي الْأَرْضِ ۚ إِنَّهُ كَانَ عَلِيمًا قَدِيرًا",
      "verseStringB": "Have they not travelled in the land and seen what was the end of those before them — and they were stronger than those in power? And Allāh is not such that anything in the heavens or the earth can escape Him. Surely He is ever Knowing, Powerful."
    },
    {
      "verseNumber": 45,
      "verseString": "وَلَوْ يُؤَاخِذُ اللَّهُ النَّاسَ بِمَا كَسَبُوا مَا تَرَكَ عَلَىٰ ظَهْرِهَا مِنْ دَابَّةٍ وَلَٰكِنْ يُؤَخِّرُهُمْ إِلَىٰ أَجَلٍ مُسَمًّى ۖ فَإِذَا جَاءَ أَجَلُهُمْ فَإِنَّ اللَّهَ كَانَ بِعِبَادِهِ بَصِيرًا",
      "verseStringB": "And were Allāh to punish men for what they earn, He would not leave on the back of it any creature,ᵃ but He respites them till an appointed term; so when their doom comes, then surely Allāh is ever Seer of His servants. "
    }
  ],
  "nameEnglish": "Originator",
  "nameTrans": "Fatir",
  "nameArabic": "فاطر",
  "chapterNumber": 35,
  "nVerses": 45,
  "footnotes": [
    {
      "note": " 1a. God is here mentioned by his name FåΔir, from faΔara, which means he clove or split, also he originated or brought a thing into existence newly or for the first time, it not having existed before (LL). There may be reference to the creation of primeval matter in the original significance of cleaving or splitting. Derived from the same root is fiΔrah, which means nature or constitution or natural or original quality in which all men are said to have been made — the nature made by Allåh in which He has created men (30:30) — and which has therefore been translated as the faculty of knowing God with which He has created mankind (LL). So there may be reference to this fiΔrah in the use of the word FåΔir, the fiΔrah or nature of man having a close relation with the FåΔir or the Maker of that fiΔrah. \n\n The representation of angels as possessing wings is met with in sacred history, but the janå√ or wing of an angel by no means indicates the fore-limbs of a bird, which fit it for flight. It is a symbol of power enabling these immaterial beings to execute their functions, and in Arabic, the word janå√ stands for power, as you say huwa maq©∂© al-janå√ (lit., he has the wing clipped), meaning he is one who lacks strength or power or ability, or he is impotent (T, LL). Angels are here spoken of as having two, three or four wings. Is there a reference here to the rak‘ahs of prayer which are two, three or four in number? The morning prayer consists of two rak‘ahs, the maghrib of three and the two afternoon prayers, and the ‘Ishå’ of four rak‘ahs. In prayer man holds communion with God and is raised to spiritual eminence; he, as it were, flies to God, is on his wings, and the angels are the agents which make him fly to God, their wings thus standing for the rak‘ahs of prayer.\n\n 1b. The increase in creation may refer in a general sense to the new creation which is going on momentarily in this universe, or there may be a reference here to the increase in the number of the elect which was to be brought about through the Prophet. Or still again, the meaning may be that the power of angels is not limited to two, three or four wings, for there are angels of mighty power like Gabriel, who is spoken of as having six hundred wings. \n\n 9a. The quickening here is clearly the quickening to spiritual life. \n\n 10a. The ultimate triumph of truth and the destruction of falsehood could not be expressed in clearer words. Good words ascend to God, i.e., prosper and bear fruit, and good deeds are exalted, while the evil plans to destroy Truth perish. \n\n 11a. There is a hint that the seed of truth is sown and generates in a similar manner. \n\n 13a. The Arabic word qiΔmßr stands for the white point in the back of a date-stone. \n\n 22a. Note how spiritual truths are conveyed in words relating to physical life. Those in the graves are the very men who were actively engaged in opposition to the Prophet. The seeing are those who have their eyes opened spiritually, the light is the spiritual light, the living are those alive in spirit, and so on. \n\n 24a. This broad doctrine that a prophet was raised among every nation is taught repeatedly in the Qur’ån, and, curiously enough, it is met with in the earlier revelation at Makkah as well as the later revelation at Madßnah. This great truth, which had remained hidden for thousands of years from the wisest men of the world, had shone upon the mind of an unlearned Arabian, who did not even know what nations then existed and what scriptures they possessed. This broad doctrine alone could form the basis of the universality of a Divine message to the whole of mankind. Only he who had the breadth of mind to recognize truth in all could unite all men. \n\n 25a. See 3:184a.  \n\n 29a. Tijårah literally signifies a buying and selling for gain, hence I render the word here as meaning gain. \n\n 31a. Note that as the Holy Qur’ån recognizes that prophets were raised in every nation, so it claims that previous revelation contains prophecies which have been fulfilled in the advent of the Holy Prophet. This is an early Makkan revelation. \n\n 32a. After speaking of the revelation of the Qur’ån to the Prophet, we are told that the Holy Book was now being given as an inheritance to a chosen people, i.e., the Muslim community, who are chosen to carry this great message to the whole world. But the chosen people are not all alike. Among the elect are some people who wrong themselves — they do not fulfil Divine commandments. There are others among them who follow a middle course; they are not wrongdoers but they are not very active in the doing of good. There are others still, who are foremost in the doing of good, who are elsewhere called muqarrab∂n (56:11), those who have attained to nearness to God. It is thus made clear that when a community is spoken of as being a chosen community, all members of it are not alike. It is chosen because of those who are foremost in the doing of good, whose example the others should try to follow. \n\n 33a. The promise refers to this life as well as to the next. See 22:23a, where it is shown that the Caliph ‘Umar made Suråqah wear Kisrå’s bracelets of gold. \n\n 34a. Here is drawn a true picture of paradise: Who has removed grief from us. This shows that freedom from grief and anxiety is the real bliss of paradise. The repeated promise to the righteous, that they shall have no fear nor shall they grieve, expresses the same truth, and shows that paradise begins in this life. \n\n 35a. Note this further description of a spiritual paradise: where toil and fatigue no more afflict a man. It is all peace and satisfaction and the highest bliss of Arabia. The Arabs, therefore, said that, if a prophet came to them as prophets came to other people, they would follow him, and set an example of goodness. \n\n 45a. Similar words occur in 16:61: “And if Allåh were to destroy men for their iniquity, He would not leave therein a single creature”. Evidently by dåbbah or creature here are meant people bent low on earth, people ignorant of the higher or spiritual values of life, or the iniquitous; see 27:82a and 34:14a. \n\n"
    }
  ]
}