{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "وَالْعَادِيَاتِ ضَبْحًا",
      "verseStringB": "By those running and uttering cries!"
    },
    {
      "verseNumber": 2,
      "verseString": "فَالْمُورِيَاتِ قَدْحًا",
      "verseStringB": "And those producing fire, striking!"
    },
    {
      "verseNumber": 3,
      "verseString": "فَالْمُغِيرَاتِ صُبْحًا",
      "verseStringB": "And those suddenly attacking at morn!"
    },
    {
      "verseNumber": 4,
      "verseString": "فَأَثَرْنَ بِهِ نَقْعًا",
      "verseStringB": "Then thereby they raise dust,"
    },
    {
      "verseNumber": 5,
      "verseString": "فَوَسَطْنَ بِهِ جَمْعًا",
      "verseStringB": "Then penetrate thereby gatherings —"
    },
    {
      "verseNumber": 6,
      "verseString": "إِنَّ الْإِنْسَانَ لِرَبِّهِ لَكَنُودٌ",
      "verseStringB": "Surely man is ungrateful to his Lord.ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "وَإِنَّهُ عَلَىٰ ذَٰلِكَ لَشَهِيدٌ",
      "verseStringB": "And surely he is a witness of that."
    },
    {
      "verseNumber": 8,
      "verseString": "وَإِنَّهُ لِحُبِّ الْخَيْرِ لَشَدِيدٌ",
      "verseStringB": "And truly on account of the love of wealth he is niggardly."
    },
    {
      "verseNumber": 9,
      "verseString": "أَفَلَا يَعْلَمُ إِذَا بُعْثِرَ مَا فِي الْقُبُورِ",
      "verseStringB": "Knows he not when that which is in the graves is raised,"
    },
    {
      "verseNumber": 10,
      "verseString": "وَحُصِّلَ مَا فِي الصُّدُورِ",
      "verseStringB": "And that which is in the breasts is made manifest?"
    },
    {
      "verseNumber": 11,
      "verseString": "إِنَّ رَبَّهُمْ بِهِمْ يَوْمَئِذٍ لَخَبِيرٌ",
      "verseStringB": "Surely their Lord this day is Aware of them.ᵃ"
    }
  ],
  "nameEnglish": "The Racers",
  "nameTrans": "al-'Adiyat",
  "nameArabic": "الـعاديات",
  "chapterNumber": 100,
  "nVerses": 11,
  "footnotes": [
    { 
	  "note": "6a. ‘Ādiyāt (from ‘adw, to run) are those running, as also assaulters, and ḍabḥ is the uttering of sound in running fast (R). Mūriyāt (from warā, it produced fire) are those that produce fire, and qadḥ carries a number of significations, among these being making a crack or a hole or corrosion or an act of striking fire (LL). Mughīrāt is from ag̲h̲āra meaning he hastened or ran fast or vehemently or made a sudden attack (LL).There is much difference of opinion as to what is meant by these words. According to I‘Ab, these words describe the condition of the camels running on the occasion of the pilgrimage, but the majority of the commentators interpret these as meaning horses, the reference being to the part they play in war (RM). In this case it would be a prophetical description of the wars through which the opponents, who wanted to destroy Truth by the sword, were ultimately to be brought low. The words are so wide that they may also apply to modern means of warfare. If the strength of an attack on the enemy depended on the swiftness with which the attack was made, and therefore, in days gone by, on the striking force of its horse, the words describe even more fittingly the air attacks of our own days. They, too, make a sound and throw out fire causing holes and fissures and splitting the earth. They, too, attack in the early hours of the morning, raise dust from demolished buildings and penetrate into the thickest parts of the towns. Others understand that these are groups of spiritual wayfarers, who run fast in the way of God. Man’s ungratefulness to his Lord and his excessive love of wealth is the real theme in all cases. He sees only the material side of life and does not pay heed to its spiritual values. The balance of life is thus upset. Disasters come and he is violently shaken so that his eyes may be opened to the real values of life.\n\n11a. A day will come, we are told, when those in the graves — the dead — will be raised to life and what is hidden in the breasts — the deeds which man did, hiding them from the eyes of others — will be made manifest. God is Aware even now, but as in nature, the consequences are made manifest in due time. They may not be as clear here as they will be at the Resurrection, when the sight will be sharpened (50:22), but sometimes they are made manifest here, too."	
	} 
  ]
}
