{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "Inᵃ the name of Allāh,ᵇ the Beneficent, the Merciful.ᶜ"
    },
    {
      "verseNumber": 1,
      "verseString": "الْقَارِعَةُ",
      "verseStringB": "The calamity!"
    },
    {
      "verseNumber": 2,
      "verseString": "مَا الْقَارِعَةُ",
      "verseStringB": "What is the calamity?"
    },
    {
      "verseNumber": 3,
      "verseString": "وَمَا أَدْرَاكَ مَا الْقَارِعَةُ",
      "verseStringB": "And what will make thee know how terrible is the calamity?ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "يَوْمَ يَكُونُ النَّاسُ كَالْفَرَاشِ الْمَبْثُوثِ",
      "verseStringB": "The day wherein men will be as scattered moths,"
    },
    {
      "verseNumber": 5,
      "verseString": "وَتَكُونُ الْجِبَالُ كَالْعِهْنِ الْمَنْفُوشِ",
      "verseStringB": "And the mountains will be as carded wool.ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "فَأَمَّا مَنْ ثَقُلَتْ مَوَازِينُهُ",
      "verseStringB": "Then as for him whose measure (of good deeds) is heavy,"
    },
    {
      "verseNumber": 7,
      "verseString": "فَهُوَ فِي عِيشَةٍ رَاضِيَةٍ",
      "verseStringB": "He will live a pleasant life."
    },
    {
      "verseNumber": 8,
      "verseString": "وَأَمَّا مَنْ خَفَّتْ مَوَازِينُهُ",
      "verseStringB": "And as for him whose measure (of good deeds) is light,"
    },
    {
      "verseNumber": 9,
      "verseString": "فَأُمُّهُ هَاوِيَةٌ",
      "verseStringB": "The abyss is a mother to him.ᵃ"
    },
    {
      "verseNumber": 10,
      "verseString": "وَمَا أَدْرَاكَ مَا هِيَهْ",
      "verseStringB": "And what will make thee know what that is?"
    },
    {
      "verseNumber": 11,
      "verseString": "نَارٌ حَامِيَةٌ",
      "verseStringB": "A burning Fire."
    }
  ],
  "nameEnglish": "The Shocker",
  "nameTrans": "al-Qari'ah",
  "nameArabic": "الـقارعـة",
  "chapterNumber": 101,
  "nVerses": 11,
   "footnotes": [
    { 
	  "note": "3a. Al-Qåri‘ah (from qar‘, meaning striking with severity) signifies a very greatcalamity, and the word occurs without the definite article al in 13:31, where it is said:“And as for those who disbelieve, disaster (qåri‘ah) will not cease to afflict them ... untilthe promise of Allåh come to pass”. This use of the word qåri‘ah shows that the wordsignifies one of those great calamities which befell the Quraish from time to time, and alis added to indicate that it is the promised calamity. In 69:4, al-qåri‘ah signifies thegreat calamity which destroys a nation, i.e., their doom. Al-qåri‘ah is also a name of theday of Resurrection or of the great Calamity which will destroy this earth, after whichcomes the Resurrection.\n\n5a. This description may also apply to the doom of the opponents of Truth; see 13:31a.\n\n9a. Håwiyah (from hawå, he made it to fall down) signifies a deep place of which thebottom cannot be reached or abyss (LL). The word umm means primarily a mother, andin all secondary significances some idea of the primary significance is retained. Thusamong its various secondary significances are source, origin, foundation, support, efficient cause of subsistence, anything to which other things are collected together, the mainpart of a thing, a man who has charge of the food and service of a people (LL). A placeof habitation or abode is also called umm (LL), because it grants protection to a man, asdoes the mother to a babe. The abyss, or hell, is here called a mother to indicate thatman’s connection with hell is similar to that of a baby with its mother, viz., that his abodethere fits him for progress in the spiritual world — he being brought up, as it were, in thebosom of hell, as a child is brought up in the bosom of its mother, and that his stay in hellis only for a time, as the child draws nourishment from his mother only for a time."
	} 
  ]
}