{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "الْقَارِعَةُ",
      "verseStringB": "The calamity!"
    },
    {
      "verseNumber": 2,
      "verseString": "مَا الْقَارِعَةُ",
      "verseStringB": "What is the calamity?"
    },
    {
      "verseNumber": 3,
      "verseString": "وَمَا أَدْرَاكَ مَا الْقَارِعَةُ",
      "verseStringB": "And what will make thee know how terrible is the calamity?ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "يَوْمَ يَكُونُ النَّاسُ كَالْفَرَاشِ الْمَبْثُوثِ",
      "verseStringB": "The day wherein men will be as scattered moths,"
    },
    {
      "verseNumber": 5,
      "verseString": "وَتَكُونُ الْجِبَالُ كَالْعِهْنِ الْمَنْفُوشِ",
      "verseStringB": "And the mountains will be as carded wool.ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "فَأَمَّا مَنْ ثَقُلَتْ مَوَازِينُهُ",
      "verseStringB": "Then as for him whose measure (of good deeds) is heavy,"
    },
    {
      "verseNumber": 7,
      "verseString": "فَهُوَ فِي عِيشَةٍ رَاضِيَةٍ",
      "verseStringB": "He will live a pleasant life."
    },
    {
      "verseNumber": 8,
      "verseString": "وَأَمَّا مَنْ خَفَّتْ مَوَازِينُهُ",
      "verseStringB": "And as for him whose measure (of good deeds) is light,"
    },
    {
      "verseNumber": 9,
      "verseString": "فَأُمُّهُ هَاوِيَةٌ",
      "verseStringB": "The abyss is a mother to him.ᵃ"
    },
    {
      "verseNumber": 10,
      "verseString": "وَمَا أَدْرَاكَ مَا هِيَهْ",
      "verseStringB": "And what will make thee know what that is?"
    },
    {
      "verseNumber": 11,
      "verseString": "نَارٌ حَامِيَةٌ",
      "verseStringB": "A burning Fire."
    }
  ],
  "nameEnglish": "The Shocker",
  "nameTrans": "al-Qari'ah",
  "nameArabic": "الـقارعـة",
  "chapterNumber": 101,
  "nVerses": 11,
  "footnotes": [
    { 
	  "note": "3a. Al-Qāri‘ah (from qar‘, meaning striking with severity) signifies a very great calamity, and the word occurs without the definite article al in 13:31, where it is said:“And as for those who disbelieve, disaster (qāri‘ah) will not cease to afflict them ... until the promise of Allāh come to pass”. This use of the word qāri‘ah shows that the word signifies one of those great calamities which befell the Qurais̲h̲ from time to time, and alis added to indicate that it is the promised calamity. In 69:4, al-qāri‘ah signifies the great calamity which destroys a nation, i.e., their doom. Al-qāri‘ah is also a name of the day of Resurrection or of the great Calamity which will destroy this earth, after which comes the Resurrection.\n\n5a. This description may also apply to the doom of the opponents of Truth; see 13:31a.\n\n9a. Hāwiyah (from hawā, he made it to fall down) signifies a deep place of which the bottom cannot be reached or abyss (LL). The word umm means primarily a mother, and in all secondary significances some idea of the primary significance is retained. Thus among its various secondary significances are source, origin, foundation, support, efficient cause of subsistence, anything to which other things are collected together, the main part of a thing, a man who has charge of the food and service of a people (LL). A place of habitation or abode is also called umm (LL), because it grants protection to a man, asdoes the mother to a babe. The abyss, or hell, is here called a mother to indicate that man’s connection with hell is similar to that of a baby with its mother, viz., that his abode there fits him for progress in the spiritual world — he being brought up, as it were, in the bosom of hell, as a child is brought up in the bosom of its mother, and that his stay in hell is only for a time, as the child draws nourishment from his mother only for a time."
	} 
  ]

}
