{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "وَالْعَصْرِ",
      "verseStringB": "By the time! —"
    },
    {
      "verseNumber": 2,
      "verseString": "إِنَّ الْإِنْسَانَ لَفِي خُسْرٍ",
      "verseStringB": "Surely man is in loss,"
    },
    {
      "verseNumber": 3,
      "verseString": "إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ",
      "verseStringB": "Except those who believe and do good, and exhort one another to Truth, and exhort one another to patience.ᵃ"
    }
  ],
  "nameEnglish": "Time",
  "nameTrans": "al-'Asr",
  "nameArabic": "الـعصر",
  "chapterNumber": 103,
  "nVerses": 3,
  "footnotes": [
    {
      "note": "3a. The testimony of time is threefold; the flight of time affords the testimony that it is only those who do not waste the opportunity of doing good that reap the benefit; the light which shines along the path of by gone ages shows us that those who did good and enjoined good on others prospered, while the evil doers were brought to naught; lastly, the time of the Holy Prophet afforded the clearest and most conclusive evidence that the believers and doers of good were successful, while their opponents sustained evident loss. ‘Aṣr signifies time or succession of ages (LL). Some, however, understand by al-‘aṣr the time of the Holy Prophet, and an authentic saying of his, in which he compares his own time to ‘aṣr, or the afternoon (B), supports this interpretation. In fact, both significances hold good. While taking time in a general sense, it is true that every man who is not engaged in doing some permanent and lasting good is really losing every minute that passes away; the time of the Holy Prophet in which a great spiritual resurrection was brought about affords the clearest evidence that those who did not respond to the Prophet’s call were the losers, while the faithful brought about a revolution in the whole world by exhorting goodness and patience on others. The enjoining of patience on each other follows the direction to enjoin Truth, because the preaching of Truth brings man face to face with difficulties, and unless he is patient and for bearing under hardships, he cannot adhere to the Truth."
    }
  ]
}
