{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "وَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ",
      "verseStringB": "Woe to every slanderer, defamer!ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "الَّذِي جَمَعَ مَالًا وَعَدَّدَهُ",
      "verseStringB": "Who amasses wealth and counts itᵃ—"
    },
    {
      "verseNumber": 3,
      "verseString": "يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ",
      "verseStringB": "He thinks that his wealth will make him abide.ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "كَلَّا ۖ لَيُنْبَذَنَّ فِي الْحُطَمَةِ",
      "verseStringB": "Nay, he will certainly be hurled into the crushing disaster;ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "وَمَا أَدْرَاكَ مَا الْحُطَمَةُ",
      "verseStringB": "And what will make thee realize what the crushing disaster is? "
    },
    {
      "verseNumber": 6,
      "verseString": "نَارُ اللَّهِ الْمُوقَدَةُ",
      "verseStringB": "It is the Fire kindled by Allåh, "
    },
    {
      "verseNumber": 7,
      "verseString": "الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ",
      "verseStringB": "Which rises over the hearts.ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ",
      "verseStringB": "Surely it is closed in on them,"
    },
    {
      "verseNumber": 9,
      "verseString": "فِي عَمَدٍ مُمَدَّدَةٍ",
      "verseStringB": "In extended columns.ᵃ"
    }
  ],
  "nameEnglish": "The Backbiter",
  "nameTrans": "al-Humazah",
  "nameArabic": "الـهمزة",
  "chapterNumber": 104,
  "nVerses": 9,
  "footnotes": [
    {
      "note": "1a. The slanderers and defamers are condemned here generally, with particular reference to the opponents, who started their persecution of the Holy Prophet by bitterly slandering and defaming him, so that the pilgrims coming to Makkah from afar should not listen to his teachings. Just as goodness and patience are combined in the previous chapter as the two qualities which are the foundations on which human character should be built, the amassing of wealth and defaming are combined here as the two evils which lead ultimately to disaster.\n\n2a. ‘Addada-hū signifies he considered it a provision against the casualties of fortune (LA). It also means he reckoned or counted it (LL). It is a succinct but exact picture of the material civilization of our day.\n\n3a. By abiding is meant abiding in prosperity, or lasting forever.\n\n4a. Al-ḥuṭamah is derived from ḥaṭima, meaning it became broken into pieces (LL). The name is applied to hell, because it crushes everything that is cast into it. It includes both hell and other disasters which, it is prophesied, would crush the wealthy defamers of the Truth, their punishment being called by this name because they wanted to crush the Truth.\n\n7a. The Fire of hell is described as rising over the hearts, showing that it is within the heart of man that the origin of hell-fire lies. A man’s hell is thus within his own heart in this life.\n\n9a. It is inordinate desires extending beyond all limits that give rise to extended columns of fire. Spiritually they may be witnessed in this life, but they assume a palpable shape in the next."
    }
  ]
}
