{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ",
      "verseStringB": "Hast thou not seen how thy Lord dealt with the possessors of the elephant?ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "أَلَمْ يَجْعَلْ كَيْدَهُمْ فِي تَضْلِيلٍ",
      "verseStringB": "Did He not cause their war to end in confusion?"
    },
    {
      "verseNumber": 3,
      "verseString": "وَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ",
      "verseStringB": "And send against them birds in flocks?"
    },
    {
      "verseNumber": 4,
      "verseString": "تَرْمِيهِمْ بِحِجَارَةٍ مِنْ سِجِّيلٍ",
      "verseStringB": "Casting at them decreed stones —"
    },
    {
      "verseNumber": 5,
      "verseString": "فَجَعَلَهُمْ كَعَصْفٍ مَأْكُولٍ",
      "verseStringB": "So He rendered them like straw eaten up? ᵃ"
    }
  ],
  "nameEnglish": "The Elephant",
  "nameTrans": "al-Fil",
  "nameArabic": "الـفيل",
  "chapterNumber": 105,
  "nVerses": 5,
  "footnotes": [
    { 
	  "note": "1a. The reference is to the memorable invasion of Makkah by Abrahah, the Christian viceroy in Yaman of the King of Abyssinia. Abrahah’s object was to destroy the Ka‘bah so as to divert Arab religious enthusiasm and Arab trade to Ṣan‘ā, where he had built a magnificent cathedral for the purpose. This army is known in Arabia as the aṣḥāb al-Fīl,or the possessors of the Elephant, because of the presence in it of one or more elephants. The year in which the invasion took place is known as the year of the Elephant, being the year 570 of the Christian era, and coinciding with the year of the Holy Prophet’s birth. Unable to defend the Holy House against the huge army, ‘Abd al-Muṭṭalib thus prayed aloud, leaning upon the door of the Ka‘bah: “Defend, O Lord, Thine own House! and suffer not the Cross to triumph over the Ka‘bah” (Zurqānī). Then the whole population of Makkah repaired to the hills around the Holy City. Meanwhile a virulent form of smallpox, or some other pestilence, broke out in Abrahah’s army with such severity that the army retreated “in confusion and dismay”, many of them, being unable to find their wayback, perishing in the valleys, while a part was swept away by floods (Muir’s Life ofMuḥammad, Introduction, p. c.). There seems to be also an allusion to the circumstance that, in protecting the Ka‘bah against an enemy, though idols were worshipped there at the time, Almighty God had shown a purpose in its preservation. The coincidence of this year with the year of the Prophet’s birth no doubt furnishes the key to that purpose,because the Arabs not only knew that the Sacred House had Abraham’s blessing, but also that Abraham had prayed for the appearance of a prophet from among them who should purify the House. The mention of the incident thus conveyed a warning to the Qurais̲h̲ that, if the Lord had destroyed an army on account of its intention to demolish His Sacred House, would He leave those alone who wanted to destroy His Prophet?\n\n5a. There is no authentic ḥadīth as to how Abrahah’s army was destroyed. According to ‘Ikrimah, everyone at whom a stone was flung was affected with small-pox (RM). Are port from Ya‘qūb to the same effect is narrated by Ibn Kathīr. Thus it was a virulent small-pox that broke out in the invading army while yet a little distance from Makkah,and the result was that Abrahah himself being affected with the pestilence, the whole army fled in a state of confusion, leaving the corpses of the dead for the birds to feast on. The words tarmī-him bi-ḥijārat-in may mean the birds cast at them stones or flung them against stones, the reference in the latter case being to the birds tearing off flesh from their bodies. For ḥijārat-in min sijjīl, see 11:82c. For birds as indicating the destruction of an enemy, see 16:79a."	
	} 
  ]
}
