{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "Inᵃ the name of Allāh,ᵇ the Beneficent, the Merciful.ᶜ"
    },
    {
      "verseNumber": 1,
      "verseString": "إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ",
      "verseStringB": "Surely We have given thee abundance of good.ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "فَصَلِّ لِرَبِّكَ وَانْحَرْ",
      "verseStringB": "So pray to thy Lord and sacrifice.ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "إِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ",
      "verseStringB": "Surely thy enemy is cut off (from good).ᵃ"
    }
  ],
  "nameEnglish": "Plenty",
  "nameTrans": "al-Kawthar",
  "nameArabic": "الـكوثر",
  "chapterNumber": 108,
  "nVerses": 3,
  "footnotes": [
    { 
	  "note": "1a. Al-kauthar (from the same root kathura as takåthur — see 102:2a) means theabundance or the abundance of good. “It has been said that the kauthar here means theabundance of good which God will give to the followers of the Prophet on the day ofResurrection. ... And what is mentioned in commentaries about the kauthar was all givento the Prophet; that is to say, he was given abundance of good, and he was promised thetriumph of Islåm over all religions and he was granted help against his enemies and hewas granted intercession for his community, and he was granted of goodness that whichcannot be counted” (LA). ‘Ikrimah said that kauthar meant abundant good and the Qur’ånand wisdom; Sa‘ßd said that God granted him abundance of good of every kind, and onbeing asked if it was a river in paradise replied, the river and all (good) besides it (IJ).According to I‘Ab, the kauthar is the abundance of good which God gave the Prophet(B. 65:108). From what is stated further on, it is clear that it is not the Prophet alone whois promised this abundance of good but also every true follower of his who makes use ofthe means for the attainment of it as described in the next verse.\n\n2a. Two ways are pointed out in this verse to attain the abundance of good promisedin the first verse, praying to God, and na√r or sacrifice, which means the devoting of one’slife to the good of humanity. Prayer is communion with God which raises in man’s heartthe highest aspirations and makes him drink deep at the fountain of Divine morals. Toaspire after good is the first need. If there is no aspiration for good, it is simply impossibleto do good; hence prayer is mentioned first. And when these noble aspirations arise, man istold to lay down his very life for the service of humanity, not of one group or one nation orone community. The word na√r means the uppermost part of the breast and na√ara meanshe stabbed an animal in the na√r (LL), and thus stands for sacrificing an animal. But thesacrifice of an animal itself stands for sacrifice of self, for which see 22:34a, 38a.\n\n3a. The word abtar (from batr, meaning the cutting off of a thing entirely), as appliedto a beast, means one whose tail is cut off. As applied to a man it conveys several significances, for instance, in want or poor, suffering loss, one from whom all good or prosperityis cut off, having no offspring or progeny (LL). All good is cut off from him because hewalks contrary to the ways in which good can be attained."
    } 
  ]
}