{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ",
      "verseStringB": "Surely We have given thee abundance of good.ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "فَصَلِّ لِرَبِّكَ وَانْحَرْ",
      "verseStringB": "So pray to thy Lord and sacrifice.ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "إِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ",
      "verseStringB": "Surely thy enemy is cut off (from good).ᵃ"
    }
  ],
  "nameEnglish": "Plenty",
  "nameTrans": "al-Kawthar",
  "nameArabic": "الـكوثر",
  "chapterNumber": 108,
  "nVerses": 3,
  "footnotes": [
    { 
	  "note": "1a. Al-kaut̲h̲ar (from the same root kat̲h̲ura as takāthur — see 102:2a) means the abundance or the abundance of good. “It has been said that the kaut̲h̲ar here means the abundance of good which God will give to the followers of the Prophet on the day of Resurrection. ... And what is mentioned in commentaries about the kaut̲h̲ar was all given to the Prophet; that is to say, he was given abundance of good, and he was promised the triumph of Islām over all religions and he was granted help against his enemies and he was granted intercession for his community, and he was granted of goodness that which cannot be counted” (LA). ‘Ikrimah said that kaut̲h̲ar meant abundant good and the Qur’ān and wisdom; Sa‘īd said that God granted him abundance of good of every kind, and on being asked if it was a river in paradise replied, the river and all (good) besides it (IJ).According to I‘Ab, the kaut̲h̲ar is the abundance of good which God gave the Prophet(B. 65:108). From what is stated further on, it is clear that it is not the Prophet alone who is promised this abundance of good but also every true follower of his who makes use ofthe means for the attainment of it as described in the next verse.\n\n2a. Two ways are pointed out in this verse to attain the abundance of good promised in the first verse, praying to God, and naḥr or sacrifice, which means the devoting of one’s life to the good of humanity. Prayer is communion with God which raises in man’s heart the highest aspirations and makes him drink deep at the fountain of Divine morals. To aspire after good is the first need. If there is no aspiration for good, it is simply impossible to do good; hence prayer is mentioned first. And when these noble aspirations arise, man is told to lay down his very life for the service of humanity, not of one group or one nation or one community. The word naḥr means the uppermost part of the breast and naḥara mean she stabbed an animal in the naḥr (LL), and thus stands for sacrificing an animal. But the sacrifice of an animal itself stands for sacrifice of self, for which see 22:34a, 38a.\n\n3a. The word abtar (from batr, meaning the cutting off of a thing entirely), as applied to a beast, means one whose tail is cut off. As applied to a man it conveys several significances, for instance, in want or poor, suffering loss, one from whom all good or prosperity is cut off, having no offspring or progeny (LL). All good is cut off from him because he walks contrary to the ways in which good can be attained."
    } 
  ]
}
