{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "Inᵃ the name of Allāh,ᵇ the Beneficent, the Merciful.ᶜ"
    },
    {
      "verseNumber": 1,
      "verseString": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ",
      "verseStringB": "Say: I seek refuge in the Lord of the dawn,ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "مِنْ شَرِّ مَا خَلَقَ",
      "verseStringB": "From the evil of that which He has created,"
    },
    {
      "verseNumber": 3,
      "verseString": "وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ",
      "verseStringB": "And from the evil of intense darkness,ᵃ when it comes,"
    },
    {
      "verseNumber": 4,
      "verseString": "وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ",
      "verseStringB": "And from the evil of those who cast (evil suggestions) in firm resolutions,ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ",
      "verseStringB": "And from the evil of the envier when he envies.ᵃ”"
    }
  ],
  "nameEnglish": "Daybreak",
  "nameTrans": "al-Falaq",
  "nameArabic": "الـفلق",
  "chapterNumber": 113,
  "nVerses": 5,
  "footnotes": [
    { 
      "note": "1a. Falaq signifies the daybreak (LL), meaning primarily cleaving or splitting, thedaybreak being so called because it cleaves through the darkness. Hence it comes to signify the plain appearing of the Truth after its having been dubious (T, LL). The reference inthe Lord of the dawn is to the gradual manifestation of the Truth and its ultimate triumph. \n\n3a. Ghåsiq is derived from ghasaq, which signifies intense darkness (R). Hence itmeans darkness in which there is no ray of light, and stands for the dark difficulties withwhich an affair is sometimes attended — difficulties through which a man is unable tosee his way. Man is, therefore, here taught to pray that his affairs may not be envelopedin utter darkness.\n\n4a. Naff åthåt is the plural of naff åth, which is an intensive nominative fromnafatha, meaning primarily he blew. But nafatha f ß qalbi-hß means he put a thing intohis heart (LL), and nafatha f ß r∂‘ß means he inspired or put it into my mind (N). ‘Uqadis the plural of ‘uqdah, which signifies a tie (LL), and judgment and consideration ofone’s affairs (T), and management, regulating and ordering of one’s affairs (LL). It alsosignifies a promise of obedience or vow of allegiance (LA, LL). Hence the naffåthåt fi l-‘uqad are really those who put evil suggestions into the resolution of men or into themanagement of their affairs. Note that naff åthåt are not necessarily women; the wordequally applies to jamå‘åt, or companies of men (Rz).This verse deals with the second difficulty in the management of an affair. The firstdifficulty is its being enveloped in utter gloom (v. 3); the second is that darkness is dispelled, but the resolution to accomplish the affair is yet weak.\n\n5a. This is the third difficulty. Success is now in sight, but there are those who envythat success. Therefore, Divine protection has still to be sought when a man is successfulin accomplishing an affair.Note that the Prophet, who was charged with the heavy task of establishing truth inthe world and making it triumphant over falsehood, had to face all these difficulties, andhis faithful followers, whose goal of life is the same as that of the Prophet, stand most inneed of resorting to this prayer with which the Holy Qur’ån draws to a close."    
	} 
  ]
}