{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "الر ۚ كِتَابٌ أُحْكِمَتْ آيَاتُهُ ثُمَّ فُصِّلَتْ مِنْ لَدُنْ حَكِيمٍ خَبِيرٍ",
      "verseStringB": "I, Allāh, am the Seer. A Book, whose verses are characterized by wisdom, then they are made plain, from One Wise, Aware:"
    },
    {
      "verseNumber": 2,
      "verseString": "أَلَّا تَعْبُدُوا إِلَّا اللَّهَ ۚ إِنَّنِي لَكُمْ مِنْهُ نَذِيرٌ وَبَشِيرٌ",
      "verseStringB": "That you should serve none but Allāh. Surely I am to you from Him a warner and a giver of good news."
    },
    {
      "verseNumber": 3,
      "verseString": "وَأَنِ اسْتَغْفِرُوا رَبَّكُمْ ثُمَّ تُوبُوا إِلَيْهِ يُمَتِّعْكُمْ مَتَاعًا حَسَنًا إِلَىٰ أَجَلٍ مُسَمًّى وَيُؤْتِ كُلَّ ذِي فَضْلٍ فَضْلَهُ ۖ وَإِنْ تَوَلَّوْا فَإِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ كَبِيرٍ",
      "verseStringB": "And ask forgiveness of your Lord, then turn to Him. He will provide you with a goodly provision to an appointed term, and will bestow His grace on every one endowed with grace.ᵃ And if you turn away, I fear for you the chastisement of a great day."
    },
    {
      "verseNumber": 4,
      "verseString": "إِلَى اللَّهِ مَرْجِعُكُمْ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "To Allāh is your return, and He is Possessor of power over all things."
    },
    {
      "verseNumber": 5,
      "verseString": "أَلَا إِنَّهُمْ يَثْنُونَ صُدُورَهُمْ لِيَسْتَخْفُوا مِنْهُ ۚ أَلَا حِينَ يَسْتَغْشُونَ ثِيَابَهُمْ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ ۚ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ",
      "verseStringB": "Now surely they cover up their breastsa to conceal (their enmity) from Him. Now surely, when they put their garments as a covering,ᵇ He knows what they hide and what they make public. Surely He is Knower of what is in the breasts"
    },
    {
      "verseNumber": 6,
      "verseString": "وَمَا مِنْ دَابَّةٍ فِي الْأَرْضِ إِلَّا عَلَى اللَّهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَا ۚ كُلٌّ فِي كِتَابٍ مُبِينٍ",
      "verseStringB": "And there is no animal in the earth but on Allāh is the sustenance of it, and He knows its resting-place and its depository. All is in a clear record."
    },
    {
      "verseNumber": 7,
      "verseString": "وَهُوَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ وَكَانَ عَرْشُهُ عَلَى الْمَاءِ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا ۗ وَلَئِنْ قُلْتَ إِنَّكُمْ مَبْعُوثُونَ مِنْ بَعْدِ الْمَوْتِ لَيَقُولَنَّ الَّذِينَ كَفَرُوا إِنْ هَٰذَا إِلَّا سِحْرٌ مُبِينٌ",
      "verseStringB": "And He it is Who created the heavens and the earth in six periods; and His Throne of Power is ever on watera that He might manifest (the good qualities in) you, whoever of you is best in deeds.ᵇ And if thou sayest, You shall surely be raised up after death, those who disbelieve say: This is nothing but clear deceit.ᶜ"
    },
    {
      "verseNumber": 8,
      "verseString": "وَلَئِنْ أَخَّرْنَا عَنْهُمُ الْعَذَابَ إِلَىٰ أُمَّةٍ مَعْدُودَةٍ لَيَقُولُنَّ مَا يَحْبِسُهُ ۗ أَلَا يَوْمَ يَأْتِيهِمْ لَيْسَ مَصْرُوفًا عَنْهُمْ وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ",
      "verseStringB": "And if We delay for them the chastisement for a stated period,ᵃ they will certainly say: What prevents it? Now surely on the day when it will come to them, it will not be averted from them, and that which they scoffed at will beset them."
    },
    {
      "verseNumber": 9,
      "verseString": "وَلَئِنْ أَذَقْنَا الْإِنْسَانَ مِنَّا رَحْمَةً ثُمَّ نَزَعْنَاهَا مِنْهُ إِنَّهُ لَيَئُوسٌ كَفُورٌ",
      "verseStringB": "And if We make man taste mercy from Us, then withdraw it from him, he is surely despairing, ungrateful."
    },
    {
      "verseNumber": 10,
      "verseString": "وَلَئِنْ أَذَقْنَاهُ نَعْمَاءَ بَعْدَ ضَرَّاءَ مَسَّتْهُ لَيَقُولَنَّ ذَهَبَ السَّيِّئَاتُ عَنِّي ۚ إِنَّهُ لَفَرِحٌ فَخُورٌ",
      "verseStringB": "And if We make him taste a favour after distress has afflicted him, he says: The evils are gone away from me. Certainly he is exultant, boastful,"
    },
    {
      "verseNumber": 11,
      "verseString": "إِلَّا الَّذِينَ صَبَرُوا وَعَمِلُوا الصَّالِحَاتِ أُولَٰئِكَ لَهُمْ مَغْفِرَةٌ وَأَجْرٌ كَبِيرٌ",
      "verseStringB": "Except those who are patient and do good. For them is forgiveness and a great reward."
    },
    {
      "verseNumber": 12,
      "verseString": "فَلَعَلَّكَ تَارِكٌ بَعْضَ مَا يُوحَىٰ إِلَيْكَ وَضَائِقٌ بِهِ صَدْرُكَ أَنْ يَقُولُوا لَوْلَا أُنْزِلَ عَلَيْهِ كَنْزٌ أَوْ جَاءَ مَعَهُ مَلَكٌ ۚ إِنَّمَا أَنْتَ نَذِيرٌ ۚ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ وَكِيلٌ",
      "verseStringB": "Then, may it be that thou wilt give up part of what is revealed to thee and thy breast will be straitened by it, because they say: Why has not a treasure been sent down for him or an angel come with him? a Thou art only a warner. And Allāh is in charge of all things."
    },
    {
      "verseNumber": 13,
      "verseString": "أَمْ يَقُولُونَ افْتَرَاهُ ۖ قُلْ فَأْتُوا بِعَشْرِ سُوَرٍ مِثْلِهِ مُفْتَرَيَاتٍ وَادْعُوا مَنِ اسْتَطَعْتُمْ مِنْ دُونِ اللَّهِ إِنْ كُنْتُمْ صَادِقِينَ",
      "verseStringB": "Or, say they: He has forged it. Say: Then bring ten forged chapters like it, and call upon whom you can besides Allāh, if you are truthful.ᵃ"
    },
    {
      "verseNumber": 14,
      "verseString": "فَإِلَّمْ يَسْتَجِيبُوا لَكُمْ فَاعْلَمُوا أَنَّمَا أُنْزِلَ بِعِلْمِ اللَّهِ وَأَنْ لَا إِلَٰهَ إِلَّا هُوَ ۖ فَهَلْ أَنْتُمْ مُسْلِمُونَ",
      "verseStringB": "But if they answer you not, then know that it is revealed by Allāh’s knowledge, and that there is no God but He. Will you then submit?ᵃ"
    },
    {
      "verseNumber": 15,
      "verseString": "مَنْ كَانَ يُرِيدُ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا نُوَفِّ إِلَيْهِمْ أَعْمَالَهُمْ فِيهَا وَهُمْ فِيهَا لَا يُبْخَسُونَ",
      "verseStringB": "Whoever desires this world’s life and its finery — We repay them their deeds therein, and they are not made to suffer loss in it."
    },
    {
      "verseNumber": 16,
      "verseString": "أُولَٰئِكَ الَّذِينَ لَيْسَ لَهُمْ فِي الْآخِرَةِ إِلَّا النَّارُ ۖ وَحَبِطَ مَا صَنَعُوا فِيهَا وَبَاطِلٌ مَا كَانُوا يَعْمَلُونَ",
      "verseStringB": "These are they for whom there is nothing but Fire in the Hereafter. And what they work therein is fruitless and their deeds are vain.ᵃ"
    },
    {
      "verseNumber": 17,
      "verseString": "أَفَمَنْ كَانَ عَلَىٰ بَيِّنَةٍ مِنْ رَبِّهِ وَيَتْلُوهُ شَاهِدٌ مِنْهُ وَمِنْ قَبْلِهِ كِتَابُ مُوسَىٰ إِمَامًا وَرَحْمَةً ۚ أُولَٰئِكَ يُؤْمِنُونَ بِهِ ۚ وَمَنْ يَكْفُرْ بِهِ مِنَ الْأَحْزَابِ فَالنَّارُ مَوْعِدُهُ ۚ فَلَا تَكُ فِي مِرْيَةٍ مِنْهُ ۚ إِنَّهُ الْحَقُّ مِنْ رَبِّكَ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ",
      "verseStringB": "Is he then (like these) who has with him clear proof from his Lord, and a witness from Him recites it, and before it (is) the Book of Moses, a guide and a mercy? These believe in it. And whoever of the parties disbelieves in it, the Fire is his promised place. So be not in doubt about it. Surely it is the truth from thy Lord, but most men believe not.ᵃ"
    },
    {
      "verseNumber": 18,
      "verseString": "وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا ۚ أُولَٰئِكَ يُعْرَضُونَ عَلَىٰ رَبِّهِمْ وَيَقُولُ الْأَشْهَادُ هَٰؤُلَاءِ الَّذِينَ كَذَبُوا عَلَىٰ رَبِّهِمْ ۚ أَلَا لَعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ",
      "verseStringB": "And who is more unjust than he who forges a lie against Allāh? These will be brought before their Lord, and the witnesses will say: These are they who lied against their Lord. Now surely the curse of Allāh is on the wrongdoers,ᵃ"
    },
    {
      "verseNumber": 19,
      "verseString": "الَّذِينَ يَصُدُّونَ عَنْ سَبِيلِ اللَّهِ وَيَبْغُونَهَا عِوَجًا وَهُمْ بِالْآخِرَةِ هُمْ كَافِرُونَ",
      "verseStringB": "Who hinder (men) from the path of Allāh and desire to make it crooked. And they are disbelievers in the Hereafter."
    },
    {
      "verseNumber": 20,
      "verseString": "أُولَٰئِكَ لَمْ يَكُونُوا مُعْجِزِينَ فِي الْأَرْضِ وَمَا كَانَ لَهُمْ مِنْ دُونِ اللَّهِ مِنْ أَوْلِيَاءَ ۘ يُضَاعَفُ لَهُمُ الْعَذَابُ ۚ مَا كَانُوا يَسْتَطِيعُونَ السَّمْعَ وَمَا كَانُوا يُبْصِرُونَ",
      "verseStringB": "These will not escape in the earth,ᵃ nor have they guardians besides Allāh. The chastisement will be doubled for them. They could not bear to hear, and they did not see.ᵇ"
    },
    {
      "verseNumber": 21,
      "verseString": "أُولَٰئِكَ الَّذِينَ خَسِرُوا أَنْفُسَهُمْ وَضَلَّ عَنْهُمْ مَا كَانُوا يَفْتَرُونَ",
      "verseStringB": "These are they who have lost their souls, and that which they forged is gone from them."
    },
    {
      "verseNumber": 22,
      "verseString": "لَا جَرَمَ أَنَّهُمْ فِي الْآخِرَةِ هُمُ الْأَخْسَرُونَ",
      "verseStringB": "Truly in the Hereafter they are the greatest losers."
    },
    {
      "verseNumber": 23,
      "verseString": "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَأَخْبَتُوا إِلَىٰ رَبِّهِمْ أُولَٰئِكَ أَصْحَابُ الْجَنَّةِ ۖ هُمْ فِيهَا خَالِدُونَ",
      "verseStringB": "Surely those who believe and do good and humble themselves before their Lord, these are the owners of the Garden; therein they will abide."
    },
    {
      "verseNumber": 24,
      "verseString": "مَثَلُ الْفَرِيقَيْنِ كَالْأَعْمَىٰ وَالْأَصَمِّ وَالْبَصِيرِ وَالسَّمِيعِ ۚ هَلْ يَسْتَوِيَانِ مَثَلًا ۚ أَفَلَا تَذَكَّرُونَ",
      "verseStringB": "The likeness of the two parties is as the blind and the deaf, and the seer and the hearer. Are they equal in condition? Will you not then mind?"
    },
    {
      "verseNumber": 25,
      "verseString": "وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ إِنِّي لَكُمْ نَذِيرٌ مُبِينٌ",
      "verseStringB": "And certainly We sent Noah to his people: Surely I am a plain warner to you,"
    },
    {
      "verseNumber": 26,
      "verseString": "أَنْ لَا تَعْبُدُوا إِلَّا اللَّهَ ۖ إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ أَلِيمٍ",
      "verseStringB": "To serve none but Allāh. Verily I fear for you the chastisement of a painful day."
    },
    {
      "verseNumber": 27,
      "verseString": "فَقَالَ الْمَلَأُ الَّذِينَ كَفَرُوا مِنْ قَوْمِهِ مَا نَرَاكَ إِلَّا بَشَرًا مِثْلَنَا وَمَا نَرَاكَ اتَّبَعَكَ إِلَّا الَّذِينَ هُمْ أَرَاذِلُنَا بَادِيَ الرَّأْيِ وَمَا نَرَىٰ لَكُمْ عَلَيْنَا مِنْ فَضْلٍ بَلْ نَظُنُّكُمْ كَاذِبِينَ",
      "verseStringB": "But the chiefs of his people who disbelieved said: We see thee not but a mortal like us, and we see not that any follow thee but those who are the meanest of us at first thought. Nor do we see in you any superiority over us; nay, we deem you liars."
    },
    {
      "verseNumber": 28,
      "verseString": "قَالَ يَا قَوْمِ أَرَأَيْتُمْ إِنْ كُنْتُ عَلَىٰ بَيِّنَةٍ مِنْ رَبِّي وَآتَانِي رَحْمَةً مِنْ عِنْدِهِ فَعُمِّيَتْ عَلَيْكُمْ أَنُلْزِمُكُمُوهَا وَأَنْتُمْ لَهَا كَارِهُونَ",
      "verseStringB": "He said: O my people, see you if I have with me clear proof from my Lord, and He has granted me mercy from Himself and it has been made obscure to you. Can we compel you to (accept) it while you are averse to it?"
    },
    {
      "verseNumber": 29,
      "verseString": "وَيَا قَوْمِ لَا أَسْأَلُكُمْ عَلَيْهِ مَالًا ۖ إِنْ أَجْرِيَ إِلَّا عَلَى اللَّهِ ۚ وَمَا أَنَا بِطَارِدِ الَّذِينَ آمَنُوا ۚ إِنَّهُمْ مُلَاقُو رَبِّهِمْ وَلَٰكِنِّي أَرَاكُمْ قَوْمًا تَجْهَلُونَ",
      "verseStringB": "And, O my people, I ask you not for wealth (in return) for it. My reward is only with Allāh, and I am not going to drive away those who believe. Surely they will meet their Lord, but I see you a people who are ignorant."
    },
    {
      "verseNumber": 30,
      "verseString": "وَيَا قَوْمِ مَنْ يَنْصُرُنِي مِنَ اللَّهِ إِنْ طَرَدْتُهُمْ ۚ أَفَلَا تَذَكَّرُونَ",
      "verseStringB": "And, O my people, who will help me against Allāh, if I drive them away? Will you not then mind?"
    },
    {
      "verseNumber": 31,
      "verseString": "وَلَا أَقُولُ لَكُمْ عِنْدِي خَزَائِنُ اللَّهِ وَلَا أَعْلَمُ الْغَيْبَ وَلَا أَقُولُ إِنِّي مَلَكٌ وَلَا أَقُولُ لِلَّذِينَ تَزْدَرِي أَعْيُنُكُمْ لَنْ يُؤْتِيَهُمُ اللَّهُ خَيْرًا ۖ اللَّهُ أَعْلَمُ بِمَا فِي أَنْفُسِهِمْ ۖ إِنِّي إِذًا لَمِنَ الظَّالِمِينَ",
      "verseStringB": "And I say not to you that I have the treasures of Allāh; and I know not the unseen; nor do I say that I am an angel. Nor do I say about those whom your eyes scorn that Allāh will not grant them (any) good — Allāh knows best what is in their souls — for then indeed I should be of the wrongdoers."
    },
    {
      "verseNumber": 32,
      "verseString": "قَالُوا يَا نُوحُ قَدْ جَادَلْتَنَا فَأَكْثَرْتَ جِدَالَنَا فَأْتِنَا بِمَا تَعِدُنَا إِنْ كُنْتَ مِنَ الصَّادِقِينَ",
      "verseStringB": "They said: O Noah, indeed thou hast disputed with us and prolonged dispute with us, so bring upon us that which thou threatenest us with, if thou art truthful."
    },
    {
      "verseNumber": 33,
      "verseString": "قَالَ إِنَّمَا يَأْتِيكُمْ بِهِ اللَّهُ إِنْ شَاءَ وَمَا أَنْتُمْ بِمُعْجِزِينَ",
      "verseStringB": "He said: Only Allāh will bring it on you, if He please, and you will not escape:"
    },
    {
      "verseNumber": 34,
      "verseString": "وَلَا يَنْفَعُكُمْ نُصْحِي إِنْ أَرَدْتُ أَنْ أَنْصَحَ لَكُمْ إِنْ كَانَ اللَّهُ يُرِيدُ أَنْ يُغْوِيَكُمْ ۚ هُوَ رَبُّكُمْ وَإِلَيْهِ تُرْجَعُونَ",
      "verseStringB": "And my advice will not profit you, if I intend to give you good advice, if Allāh intends to destroy you. He is your Lord; and to Him you will be brought back."
    },
    {
      "verseNumber": 35,
      "verseString": "أَمْ يَقُولُونَ افْتَرَاهُ ۖ قُلْ إِنِ افْتَرَيْتُهُ فَعَلَيَّ إِجْرَامِي وَأَنَا بَرِيءٌ مِمَّا تُجْرِمُونَ",
      "verseStringB": "Or say they: He has forged it? Say: If I have forged it, on me is my guilt; and I am free of that of which you are guilty.ᵃ"
    },
    {
      "verseNumber": 36,
      "verseString": "وَأُوحِيَ إِلَىٰ نُوحٍ أَنَّهُ لَنْ يُؤْمِنَ مِنْ قَوْمِكَ إِلَّا مَنْ قَدْ آمَنَ فَلَا تَبْتَئِسْ بِمَا كَانُوا يَفْعَلُونَ",
      "verseStringB": "And it was revealed to Noah: None of thy people will believe except those who have already believed, so grieve not at what they do:"
    },
    {
      "verseNumber": 37,
      "verseString": "وَاصْنَعِ الْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا وَلَا تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُوا ۚ إِنَّهُمْ مُغْرَقُونَ",
      "verseStringB": "And make the ark under Our eyes and Our revelation, and speak not to Me on behalf of those who are unjust. Surely they will be drowned."
    },
    {
      "verseNumber": 38,
      "verseString": "وَيَصْنَعُ الْفُلْكَ وَكُلَّمَا مَرَّ عَلَيْهِ مَلَأٌ مِنْ قَوْمِهِ سَخِرُوا مِنْهُ ۚ قَالَ إِنْ تَسْخَرُوا مِنَّا فَإِنَّا نَسْخَرُ مِنْكُمْ كَمَا تَسْخَرُونَ",
      "verseStringB": "And he began to make the ark. And whenever the chiefs of his people passed by him, they laughed at him. He said: If you laugh at us, surely we, too, laugh at you as you laugh (at us).ᵃ"
    },
    {
      "verseNumber": 39,
      "verseString": "فَسَوْفَ تَعْلَمُونَ مَنْ يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُقِيمٌ",
      "verseStringB": "So you shall know who it is on whom will come a chastisement which will disgrace him, and on whom a lasting chastisement will fall."
    },
    {
      "verseNumber": 40,
      "verseString": "حَتَّىٰ إِذَا جَاءَ أَمْرُنَا وَفَارَ التَّنُّورُ قُلْنَا احْمِلْ فِيهَا مِنْ كُلٍّ زَوْجَيْنِ اثْنَيْنِ وَأَهْلَكَ إِلَّا مَنْ سَبَقَ عَلَيْهِ الْقَوْلُ وَمَنْ آمَنَ ۚ وَمَا آمَنَ مَعَهُ إِلَّا قَلِيلٌ",
      "verseStringB": "At length when Our command came and water gushed forth from the valley,ᵃ We said: Carry in it two of all things, a pair,ᵇ and thine own family — except those against whom the word has already gone forth — and those who believe. And there believed not with him but a few."
    },
    {
      "verseNumber": 41,
      "verseString": "وَقَالَ ارْكَبُوا فِيهَا بِسْمِ اللَّهِ مَجْرَاهَا وَمُرْسَاهَا ۚ إِنَّ رَبِّي لَغَفُورٌ رَحِيمٌ",
      "verseStringB": "And he said: Embark in it, in the name of Allāh be its sailing and its anchoring. Surely my Lord is Forgiving, Merciful."
    },
    {
      "verseNumber": 42,
      "verseString": "وَهِيَ تَجْرِي بِهِمْ فِي مَوْجٍ كَالْجِبَالِ وَنَادَىٰ نُوحٌ ابْنَهُ وَكَانَ فِي مَعْزِلٍ يَا بُنَيَّ ارْكَبْ مَعَنَا وَلَا تَكُنْ مَعَ الْكَافِرِينَ",
      "verseStringB": "And it moved on with them amid waves like mountains.ᵃ And Noah called out to his son, and he was aloof: O my son, embark with us and be not with the disbelievers."
    },
    {
      "verseNumber": 43,
      "verseString": "قَالَ سَآوِي إِلَىٰ جَبَلٍ يَعْصِمُنِي مِنَ الْمَاءِ ۚ قَالَ لَا عَاصِمَ الْيَوْمَ مِنْ أَمْرِ اللَّهِ إِلَّا مَنْ رَحِمَ ۚ وَحَالَ بَيْنَهُمَا الْمَوْجُ فَكَانَ مِنَ الْمُغْرَقِينَ",
      "verseStringB": "He said: I will betake myself for refuge to a mountain that will save me from the water. He said: There is none safe today from Allāh’s command, but he on whom He has mercy.ᵃ And a wave intervened between them, so he was among the drowned."
    },
    {
      "verseNumber": 44,
      "verseString": "وَقِيلَ يَا أَرْضُ ابْلَعِي مَاءَكِ وَيَا سَمَاءُ أَقْلِعِي وَغِيضَ الْمَاءُ وَقُضِيَ الْأَمْرُ وَاسْتَوَتْ عَلَى الْجُودِيِّ ۖ وَقِيلَ بُعْدًا لِلْقَوْمِ الظَّالِمِينَ",
      "verseStringB": "And it was said: O earth, swallow thy water, and O cloud, clear away. And the water was made to abate, and the affair was decided, and it rested on the J∂di,ᵃ and it was said: Away with the iniquitous people!"
    },
    {
      "verseNumber": 45,
      "verseString": "وَنَادَىٰ نُوحٌ رَبَّهُ فَقَالَ رَبِّ إِنَّ ابْنِي مِنْ أَهْلِي وَإِنَّ وَعْدَكَ الْحَقُّ وَأَنْتَ أَحْكَمُ الْحَاكِمِينَ",
      "verseStringB": "And Noah cried to his Lord and said: My Lord, surely my son is of my family, and Thy promise is true, and Thou art the Justest of the judges."
    },
    {
      "verseNumber": 46,
      "verseString": "قَالَ يَا نُوحُ إِنَّهُ لَيْسَ مِنْ أَهْلِكَ ۖ إِنَّهُ عَمَلٌ غَيْرُ صَالِحٍ ۖ فَلَا تَسْأَلْنِ مَا لَيْسَ لَكَ بِهِ عِلْمٌ ۖ إِنِّي أَعِظُكَ أَنْ تَكُونَ مِنَ الْجَاهِلِينَ",
      "verseStringB": "He said: O Noah, he is not of thy family; he is (an embodiment of) unrighteous conduct.ᵃ So ask not of Me that of which thou hast no knowledge. I admonish thee lest thou be of the ignorant."
    },
    {
      "verseNumber": 47,
      "verseString": "قَالَ رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ ۖ وَإِلَّا تَغْفِرْ لِي وَتَرْحَمْنِي أَكُنْ مِنَ الْخَاسِرِينَ",
      "verseStringB": "He said: My Lord, I seek refuge in Thee from asking of Thee that of which I have no knowledge. And unless Thou forgive me and have mercy on me, I shall be of the losers."
    },
    {
      "verseNumber": 48,
      "verseString": "قِيلَ يَا نُوحُ اهْبِطْ بِسَلَامٍ مِنَّا وَبَرَكَاتٍ عَلَيْكَ وَعَلَىٰ أُمَمٍ مِمَّنْ مَعَكَ ۚ وَأُمَمٌ سَنُمَتِّعُهُمْ ثُمَّ يَمَسُّهُمْ مِنَّا عَذَابٌ أَلِيمٌ",
      "verseStringB": "It was said: O Noah, descend with peace from Us and blessings on thee and on nations (springing) from those with thee. And there are nations whom We afford provisions, then a painful punishment from Us afflicts them."
    },
    {
      "verseNumber": 49,
      "verseString": "تِلْكَ مِنْ أَنْبَاءِ الْغَيْبِ نُوحِيهَا إِلَيْكَ ۖ مَا كُنْتَ تَعْلَمُهَا أَنْتَ وَلَا قَوْمُكَ مِنْ قَبْلِ هَٰذَا ۖ فَاصْبِرْ ۖ إِنَّ الْعَاقِبَةَ لِلْمُتَّقِينَ",
      "verseStringB": "These are announcements relating to the unseen which We reveal to thee; thou didst not know them — (neither) thou nor thy people — before this. So be patient. Surely, the (good) end is for the dutiful.ᵃ"
    },
    {
      "verseNumber": 50,
      "verseString": "وَإِلَىٰ عَادٍ أَخَاهُمْ هُودًا ۚ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَٰهٍ غَيْرُهُ ۖ إِنْ أَنْتُمْ إِلَّا مُفْتَرُونَ",
      "verseStringB": "And to ‘ād (We sent) their brother H∂d.ᵃ He said: O my people, serve Allāh, you have no god save Him. You are only fabricators."
    },
    {
      "verseNumber": 51,
      "verseString": "يَا قَوْمِ لَا أَسْأَلُكُمْ عَلَيْهِ أَجْرًا ۖ إِنْ أَجْرِيَ إِلَّا عَلَى الَّذِي فَطَرَنِي ۚ أَفَلَا تَعْقِلُونَ",
      "verseStringB": "O my people, I ask of you no reward for it. My reward is only with Him Who created me. Do you not then understand?"
    },
    {
      "verseNumber": 52,
      "verseString": "وَيَا قَوْمِ اسْتَغْفِرُوا رَبَّكُمْ ثُمَّ تُوبُوا إِلَيْهِ يُرْسِلِ السَّمَاءَ عَلَيْكُمْ مِدْرَارًا وَيَزِدْكُمْ قُوَّةً إِلَىٰ قُوَّتِكُمْ وَلَا تَتَوَلَّوْا مُجْرِمِينَ",
      "verseStringB": "And, O my people, ask forgiveness of your Lord, then turn to Him, He will send on you clouds pouring down abundance of rain and add strength to your strength, and turn not back, guilty."
    },
    {
      "verseNumber": 53,
      "verseString": "قَالُوا يَا هُودُ مَا جِئْتَنَا بِبَيِّنَةٍ وَمَا نَحْنُ بِتَارِكِي آلِهَتِنَا عَنْ قَوْلِكَ وَمَا نَحْنُ لَكَ بِمُؤْمِنِينَ",
      "verseStringB": "They said: O H∂d, thou hast brought us no clear argument, and we are not going to desert our gods for thy word, and we are not believers in thee."
    },
    {
      "verseNumber": 54,
      "verseString": "إِنْ نَقُولُ إِلَّا اعْتَرَاكَ بَعْضُ آلِهَتِنَا بِسُوءٍ ۗ قَالَ إِنِّي أُشْهِدُ اللَّهَ وَاشْهَدُوا أَنِّي بَرِيءٌ مِمَّا تُشْرِكُونَ",
      "verseStringB": "We say naught but that some of our gods have smitten thee with evil. He said: Surely I call Allāh to witness, and do you, too, bear witness that I am innocent of what you associate (with Allāh)"
    },
    {
      "verseNumber": 55,
      "verseString": "مِنْ دُونِهِ ۖ فَكِيدُونِي جَمِيعًا ثُمَّ لَا تُنْظِرُونِ",
      "verseStringB": "Besides Him. So scheme against me all together, then give me no respite."
    },
    {
      "verseNumber": 56,
      "verseString": "إِنِّي تَوَكَّلْتُ عَلَى اللَّهِ رَبِّي وَرَبِّكُمْ ۚ مَا مِنْ دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا ۚ إِنَّ رَبِّي عَلَىٰ صِرَاطٍ مُسْتَقِيمٍ",
      "verseStringB": "Surely I put my trust in Allāh, my Lord and your Lord. There is no living creature but He grasps it by its forelock. Surely my Lord is on the right path.ᵃ"
    },
    {
      "verseNumber": 57,
      "verseString": "فَإِنْ تَوَلَّوْا فَقَدْ أَبْلَغْتُكُمْ مَا أُرْسِلْتُ بِهِ إِلَيْكُمْ ۚ وَيَسْتَخْلِفُ رَبِّي قَوْمًا غَيْرَكُمْ وَلَا تَضُرُّونَهُ شَيْئًا ۚ إِنَّ رَبِّي عَلَىٰ كُلِّ شَيْءٍ حَفِيظٌ",
      "verseStringB": "But if you turn away, then indeed I have delivered to you that with which I am sent to you. And my Lord will bring another people in your place, and you cannot do Him any harm. Surely my Lord is the Preserver of all things."
    },
    {
      "verseNumber": 58,
      "verseString": "وَلَمَّا جَاءَ أَمْرُنَا نَجَّيْنَا هُودًا وَالَّذِينَ آمَنُوا مَعَهُ بِرَحْمَةٍ مِنَّا وَنَجَّيْنَاهُمْ مِنْ عَذَابٍ غَلِيظٍ",
      "verseStringB": "And when Our commandment came to pass, We delivered H∂d and those who believed with him with mercy from Us; and We delivered them from a hard chastisement."
    },
    {
      "verseNumber": 59,
      "verseString": "وَتِلْكَ عَادٌ ۖ جَحَدُوا بِآيَاتِ رَبِّهِمْ وَعَصَوْا رُسُلَهُ وَاتَّبَعُوا أَمْرَ كُلِّ جَبَّارٍ عَنِيدٍ",
      "verseStringB": "And such were ‘ād. They denied the messages of their Lord, and disobeyed His messengers and followed the bidding of every insolent opposer (of truth)."
    },
    {
      "verseNumber": 60,
      "verseString": "وَأُتْبِعُوا فِي هَٰذِهِ الدُّنْيَا لَعْنَةً وَيَوْمَ الْقِيَامَةِ ۗ أَلَا إِنَّ عَادًا كَفَرُوا رَبَّهُمْ ۗ أَلَا بُعْدًا لِعَادٍ قَوْمِ هُودٍ",
      "verseStringB": "And they were overtaken by a curse in this world and on the day of Resurrection. Now surely ‘ād disbelieved in their Lord. Now surely, away with ‘ād, the people of H∂d!"
    },
    {
      "verseNumber": 61,
      "verseString": "وَإِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحًا ۚ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَٰهٍ غَيْرُهُ ۖ هُوَ أَنْشَأَكُمْ مِنَ الْأَرْضِ وَاسْتَعْمَرَكُمْ فِيهَا فَاسْتَغْفِرُوهُ ثُمَّ تُوبُوا إِلَيْهِ ۚ إِنَّ رَبِّي قَرِيبٌ مُجِيبٌ",
      "verseStringB": "And to Tham∂d (We sent) their brother ˝āliƒ. He said: O my people, serve Allāh, you have no god other than Him. He brought you forth from the earth and made you dwell in it, so ask forgiveness of Him, then turn to Him. Surely my Lord is Nigh, Answering."
    },
    {
      "verseNumber": 62,
      "verseString": "قَالُوا يَا صَالِحُ قَدْ كُنْتَ فِينَا مَرْجُوًّا قَبْلَ هَٰذَا ۖ أَتَنْهَانَا أَنْ نَعْبُدَ مَا يَعْبُدُ آبَاؤُنَا وَإِنَّنَا لَفِي شَكٍّ مِمَّا تَدْعُونَا إِلَيْهِ مُرِيبٍ",
      "verseStringB": "They said: O ˝āliƒ, thou wast among us a centre of (our) hopes before this. Dost thou forbid us to worship what our fathers worshipped? And surely we are in grave doubt about that to which thou callest us."
    },
    {
      "verseNumber": 63,
      "verseString": "قَالَ يَا قَوْمِ أَرَأَيْتُمْ إِنْ كُنْتُ عَلَىٰ بَيِّنَةٍ مِنْ رَبِّي وَآتَانِي مِنْهُ رَحْمَةً فَمَنْ يَنْصُرُنِي مِنَ اللَّهِ إِنْ عَصَيْتُهُ ۖ فَمَا تَزِيدُونَنِي غَيْرَ تَخْسِيرٍ",
      "verseStringB": "He said: O my people, see you if I have clear proof from my Lord and He has granted me mercy from Himself — who will then help me against Allāh, if I disobey Him? So you would add to me naught but perdition."
    },
    {
      "verseNumber": 64,
      "verseString": "وَيَا قَوْمِ هَٰذِهِ نَاقَةُ اللَّهِ لَكُمْ آيَةً فَذَرُوهَا تَأْكُلْ فِي أَرْضِ اللَّهِ وَلَا تَمَسُّوهَا بِسُوءٍ فَيَأْخُذَكُمْ عَذَابٌ قَرِيبٌ",
      "verseStringB": "And, O my people, this is Allāh’s she-camel,ᵃ a sign for you, so leave her to pasture on Allāh’s earth and touch her not with evil, lest a near chastisement overtake you."
    },
    {
      "verseNumber": 65,
      "verseString": "فَعَقَرُوهَا فَقَالَ تَمَتَّعُوا فِي دَارِكُمْ ثَلَاثَةَ أَيَّامٍ ۖ ذَٰلِكَ وَعْدٌ غَيْرُ مَكْذُوبٍ",
      "verseStringB": "But they hamstrung her, so he said: Enjoy yourselves in your houses for three days. That is a promise not to be belied."
    },
    {
      "verseNumber": 66,
      "verseString": "فَلَمَّا جَاءَ أَمْرُنَا نَجَّيْنَا صَالِحًا وَالَّذِينَ آمَنُوا مَعَهُ بِرَحْمَةٍ مِنَّا وَمِنْ خِزْيِ يَوْمِئِذٍ ۗ إِنَّ رَبَّكَ هُوَ الْقَوِيُّ الْعَزِيزُ",
      "verseStringB": "So when Our commandment came to pass, We saved ˝āliƒ and those who believed with him by mercy from Us from the disgrace of that day. Surely thy Lord — He is the Strong, the Mighty."
    },
    {
      "verseNumber": 67,
      "verseString": "وَأَخَذَ الَّذِينَ ظَلَمُوا الصَّيْحَةُ فَأَصْبَحُوا فِي دِيَارِهِمْ جَاثِمِينَ",
      "verseStringB": "And the crya overtook those who did wrong, so they were motionless bodies in their abodes,"
    },
    {
      "verseNumber": 68,
      "verseString": "كَأَنْ لَمْ يَغْنَوْا فِيهَا ۗ أَلَا إِنَّ ثَمُودَ كَفَرُوا رَبَّهُمْ ۗ أَلَا بُعْدًا لِثَمُودَ",
      "verseStringB": "As though they had never dwelt therein. Now surely Tham∂d disbelieved in their Lord. So away with Tham∂d!"
    },
    {
      "verseNumber": 69,
      "verseString": "وَلَقَدْ جَاءَتْ رُسُلُنَا إِبْرَاهِيمَ بِالْبُشْرَىٰ قَالُوا سَلَامًا ۖ قَالَ سَلَامٌ ۖ فَمَا لَبِثَ أَنْ جَاءَ بِعِجْلٍ حَنِيذٍ",
      "verseStringB": "And certainly Our messengers came to Abraham with good news. They said: Peace! Peace! said he. And he made no delay in bringing a roasted calf.ᵃ"
    },
    {
      "verseNumber": 70,
      "verseString": "فَلَمَّا رَأَىٰ أَيْدِيَهُمْ لَا تَصِلُ إِلَيْهِ نَكِرَهُمْ وَأَوْجَسَ مِنْهُمْ خِيفَةً ۚ قَالُوا لَا تَخَفْ إِنَّا أُرْسِلْنَا إِلَىٰ قَوْمِ لُوطٍ",
      "verseStringB": "But when he saw that their hands reached not to it, he mistrusted them and conceived fear of them. They said: Fear not; we have been sent to Lot’s people.ᵃ"
    },
    {
      "verseNumber": 71,
      "verseString": "وَامْرَأَتُهُ قَائِمَةٌ فَضَحِكَتْ فَبَشَّرْنَاهَا بِإِسْحَاقَ وَمِنْ وَرَاءِ إِسْحَاقَ يَعْقُوبَ",
      "verseStringB": "And his wife was standing (by), so she wondered. Then We gave her the good news of Isaac, and beyond Isaac, of Jacob.ᵃ"
    },
    {
      "verseNumber": 72,
      "verseString": "قَالَتْ يَا وَيْلَتَىٰ أَأَلِدُ وَأَنَا عَجُوزٌ وَهَٰذَا بَعْلِي شَيْخًا ۖ إِنَّ هَٰذَا لَشَيْءٌ عَجِيبٌ",
      "verseStringB": "She said: O wonder!ᵃ Shall I bear a son when I am an extremely old woman, and this my husband an extremely old man? This is a wonderful thing indeed!"
    },
    {
      "verseNumber": 73,
      "verseString": "قَالُوا أَتَعْجَبِينَ مِنْ أَمْرِ اللَّهِ ۖ رَحْمَتُ اللَّهِ وَبَرَكَاتُهُ عَلَيْكُمْ أَهْلَ الْبَيْتِ ۚ إِنَّهُ حَمِيدٌ مَجِيدٌ",
      "verseStringB": "They said: Wonderest thou at Allāh’s commandment? The mercy of Allāh and His blessings on you, O people of the house!ᵃ Surely He is Praised, Glorious."
    },
    {
      "verseNumber": 74,
      "verseString": "فَلَمَّا ذَهَبَ عَنْ إِبْرَاهِيمَ الرَّوْعُ وَجَاءَتْهُ الْبُشْرَىٰ يُجَادِلُنَا فِي قَوْمِ لُوطٍ",
      "verseStringB": "So when fear departed from Abraham and good news came to him, he began to plead with Us for Lot’s people.ᵃ"
    },
    {
      "verseNumber": 75,
      "verseString": "إِنَّ إِبْرَاهِيمَ لَحَلِيمٌ أَوَّاهٌ مُنِيبٌ",
      "verseStringB": "Surely Abraham was forbearing, tender-hearted, oft-returning (to Allāh)."
    },
    {
      "verseNumber": 76,
      "verseString": "يَا إِبْرَاهِيمُ أَعْرِضْ عَنْ هَٰذَا ۖ إِنَّهُ قَدْ جَاءَ أَمْرُ رَبِّكَ ۖ وَإِنَّهُمْ آتِيهِمْ عَذَابٌ غَيْرُ مَرْدُودٍ",
      "verseStringB": "O Abraham, cease from this. Surely the decree of thy Lord has gone forth and there must come to them a chastisement that cannot be averted."
    },
    {
      "verseNumber": 77,
      "verseString": "وَلَمَّا جَاءَتْ رُسُلُنَا لُوطًا سِيءَ بِهِمْ وَضَاقَ بِهِمْ ذَرْعًا وَقَالَ هَٰذَا يَوْمٌ عَصِيبٌ",
      "verseStringB": "And when Our messengers came to Lot, he was grieved for them, and he was unable to protect them,ᵃ and said: This is a distressful day!"
    },
    {
      "verseNumber": 78,
      "verseString": "وَجَاءَهُ قَوْمُهُ يُهْرَعُونَ إِلَيْهِ وَمِنْ قَبْلُ كَانُوا يَعْمَلُونَ السَّيِّئَاتِ ۚ قَالَ يَا قَوْمِ هَٰؤُلَاءِ بَنَاتِي هُنَّ أَطْهَرُ لَكُمْ ۖ فَاتَّقُوا اللَّهَ وَلَا تُخْزُونِ فِي ضَيْفِي ۖ أَلَيْسَ مِنْكُمْ رَجُلٌ رَشِيدٌ",
      "verseStringB": "And his people came to him, (as if) driven on towards him, and they were used to the doing of evil deeds before. He said: O my people, these are my daughters — they are purer for you; so guard against (the punishment of) Allāh and disgrace me not about my guests. Is there not among you any right-minded man?ᵃ"
    },
    {
      "verseNumber": 79,
      "verseString": "قَالُوا لَقَدْ عَلِمْتَ مَا لَنَا فِي بَنَاتِكَ مِنْ حَقٍّ وَإِنَّكَ لَتَعْلَمُ مَا نُرِيدُ",
      "verseStringB": "They said: Certainly thou knowest that we have no claim on thy daughters, and thou knowest what we desire."
    },
    {
      "verseNumber": 80,
      "verseString": "قَالَ لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلَىٰ رُكْنٍ شَدِيدٍ",
      "verseStringB": "He said: Would that I had the power to repel you! — rather I shall have recourse to a strong support.ᵃ"
    },
    {
      "verseNumber": 81,
      "verseString": "قَالُوا يَا لُوطُ إِنَّا رُسُلُ رَبِّكَ لَنْ يَصِلُوا إِلَيْكَ ۖ فَأَسْرِ بِأَهْلِكَ بِقِطْعٍ مِنَ اللَّيْلِ وَلَا يَلْتَفِتْ مِنْكُمْ أَحَدٌ إِلَّا امْرَأَتَكَ ۖ إِنَّهُ مُصِيبُهَا مَا أَصَابَهُمْ ۚ إِنَّ مَوْعِدَهُمُ الصُّبْحُ ۚ أَلَيْسَ الصُّبْحُ بِقَرِيبٍ",
      "verseStringB": "They said: O Lot, we are the messengers of thy Lord. They shall not reach thee. So travel with thy people for a part of the night — and let none of you turn back — except thy wife.ᵃ Surely whatsoever befalls them shall befall her. Surely their appointed time is the morning. Is not the morning nigh?"
    },
    {
      "verseNumber": 82,
      "verseString": "فَلَمَّا جَاءَ أَمْرُنَا جَعَلْنَا عَالِيَهَا سَافِلَهَا وَأَمْطَرْنَا عَلَيْهَا حِجَارَةً مِنْ سِجِّيلٍ مَنْضُودٍ",
      "verseStringB": "So when Our decree came to pass, We turned them upside down,ᵃ and rained on them stones,ᵇ as decreed,ᶜ one after another,"
    },
    {
      "verseNumber": 83,
      "verseString": "مُسَوَّمَةً عِنْدَ رَبِّكَ ۖ وَمَا هِيَ مِنَ الظَّالِمِينَ بِبَعِيدٍ",
      "verseStringB": "Marked (for punishment) with thy Lord. And it is not far off from the wrongdoers.ᵃ"
    },
    {
      "verseNumber": 84,
      "verseString": "وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا ۚ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَٰهٍ غَيْرُهُ ۖ وَلَا تَنْقُصُوا الْمِكْيَالَ وَالْمِيزَانَ ۚ إِنِّي أَرَاكُمْ بِخَيْرٍ وَإِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ مُحِيطٍ",
      "verseStringB": "And to Midian (We sent) their brother Shu‘aib. He said: O my people, serve Allāh, you have no other god save Him. And give not short measure and weight. I see you in prosperity, and I fear for you the chastisement of an all-encompassing day:"
    },
    {
      "verseNumber": 85,
      "verseString": "وَيَا قَوْمِ أَوْفُوا الْمِكْيَالَ وَالْمِيزَانَ بِالْقِسْطِ ۖ وَلَا تَبْخَسُوا النَّاسَ أَشْيَاءَهُمْ وَلَا تَعْثَوْا فِي الْأَرْضِ مُفْسِدِينَ",
      "verseStringB": "And, O my people, give full measure and weight justly, and defraud not men of their things, and act not corruptly in the land, making mischief:"
    },
    {
      "verseNumber": 86,
      "verseString": "بَقِيَّتُ اللَّهِ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ ۚ وَمَا أَنَا عَلَيْكُمْ بِحَفِيظٍ",
      "verseStringB": "What remains with Allāh is better for you, if you are believers. And I am not a keeper over you.ᵃ"
    },
    {
      "verseNumber": 87,
      "verseString": "قَالُوا يَا شُعَيْبُ أَصَلَاتُكَ تَأْمُرُكَ أَنْ نَتْرُكَ مَا يَعْبُدُ آبَاؤُنَا أَوْ أَنْ نَفْعَلَ فِي أَمْوَالِنَا مَا نَشَاءُ ۖ إِنَّكَ لَأَنْتَ الْحَلِيمُ الرَّشِيدُ",
      "verseStringB": "They said: O Shu‘aib, does thy prayer enjoin thee that we should forsake what our fathers worshipped or that we should not do what we please with regard to our property? Forsooth thou art the forbearing, the right-directing one!"
    },
    {
      "verseNumber": 88,
      "verseString": "قَالَ يَا قَوْمِ أَرَأَيْتُمْ إِنْ كُنْتُ عَلَىٰ بَيِّنَةٍ مِنْ رَبِّي وَرَزَقَنِي مِنْهُ رِزْقًا حَسَنًا ۚ وَمَا أُرِيدُ أَنْ أُخَالِفَكُمْ إِلَىٰ مَا أَنْهَاكُمْ عَنْهُ ۚ إِنْ أُرِيدُ إِلَّا الْإِصْلَاحَ مَا اسْتَطَعْتُ ۚ وَمَا تَوْفِيقِي إِلَّا بِاللَّهِ ۚ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ",
      "verseStringB": "He said: O my people, see you if I have a clear proof from my Lord and He has given me a goodly sustenance from Himself. And I desire not to act in opposition to you, in that which I forbid you. I desire nothing but reform, so far as I am able. And with none but Allāh is the direction of my affair to a right issue. In Him I trust and to Him I turn."
    },
    {
      "verseNumber": 89,
      "verseString": "وَيَا قَوْمِ لَا يَجْرِمَنَّكُمْ شِقَاقِي أَنْ يُصِيبَكُمْ مِثْلُ مَا أَصَابَ قَوْمَ نُوحٍ أَوْ قَوْمَ هُودٍ أَوْ قَوْمَ صَالِحٍ ۚ وَمَا قَوْمُ لُوطٍ مِنْكُمْ بِبَعِيدٍ",
      "verseStringB": "And, O my people, let not opposition to me make you guilty so that there may befall you the like of that which befell the people of Noah, or the people of H∂d, or the people of ˝āliƒ. Nor are the people of Lot far off from you."
    },
    {
      "verseNumber": 90,
      "verseString": "وَاسْتَغْفِرُوا رَبَّكُمْ ثُمَّ تُوبُوا إِلَيْهِ ۚ إِنَّ رَبِّي رَحِيمٌ وَدُودٌ",
      "verseStringB": "And ask forgiveness of your Lord, then turn to Him. Surely my Lord is Merciful, Loving-kind."
    },
    {
      "verseNumber": 91,
      "verseString": "قَالُوا يَا شُعَيْبُ مَا نَفْقَهُ كَثِيرًا مِمَّا تَقُولُ وَإِنَّا لَنَرَاكَ فِينَا ضَعِيفًا ۖ وَلَوْلَا رَهْطُكَ لَرَجَمْنَاكَ ۖ وَمَا أَنْتَ عَلَيْنَا بِعَزِيزٍ",
      "verseStringB": "They said: O Shu‘aib, we understand not much of what thou sayest and surely we see thee to be weak among us. And were it not for thy family, we would surely stone thee, and thou art not mighty against us."
    },
    {
      "verseNumber": 92,
      "verseString": "قَالَ يَا قَوْمِ أَرَهْطِي أَعَزُّ عَلَيْكُمْ مِنَ اللَّهِ وَاتَّخَذْتُمُوهُ وَرَاءَكُمْ ظِهْرِيًّا ۖ إِنَّ رَبِّي بِمَا تَعْمَلُونَ مُحِيطٌ",
      "verseStringB": "He said: O my people, is my family more esteemed by you than Allāh? And you neglect Him as a thing cast behind your backs! Surely my Lord encompasses what you do."
    },
    {
      "verseNumber": 93,
      "verseString": "وَيَا قَوْمِ اعْمَلُوا عَلَىٰ مَكَانَتِكُمْ إِنِّي عَامِلٌ ۖ سَوْفَ تَعْلَمُونَ مَنْ يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَمَنْ هُوَ كَاذِبٌ ۖ وَارْتَقِبُوا إِنِّي مَعَكُمْ رَقِيبٌ",
      "verseStringB": "And, O my people, act according to your ability, I too am acting. You will come to know soon who it is on whom will light the punishment that will disgrace him, and who it is that is a liar. And watch, surely I too am watching with you."
    },
    {
      "verseNumber": 94,
      "verseString": "وَلَمَّا جَاءَ أَمْرُنَا نَجَّيْنَا شُعَيْبًا وَالَّذِينَ آمَنُوا مَعَهُ بِرَحْمَةٍ مِنَّا وَأَخَذَتِ الَّذِينَ ظَلَمُوا الصَّيْحَةُ فَأَصْبَحُوا فِي دِيَارِهِمْ جَاثِمِينَ",
      "verseStringB": "And when Our decree came to pass, We delivered Shu‘aib and those who believed with him by mercy from Us. And the cry overtook those who were iniquitous, so they were motionless bodies in their abodes,"
    },
    {
      "verseNumber": 95,
      "verseString": "كَأَنْ لَمْ يَغْنَوْا فِيهَا ۗ أَلَا بُعْدًا لِمَدْيَنَ كَمَا بَعِدَتْ ثَمُودُ",
      "verseStringB": "As though they had never dwelt in them. So away with Midian, just as Tham∂d perished!"
    },
    {
      "verseNumber": 96,
      "verseString": "وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِآيَاتِنَا وَسُلْطَانٍ مُبِينٍ",
      "verseStringB": "And certainly We sent Moses with Our signs and a clear authority,"
    },
    {
      "verseNumber": 97,
      "verseString": "إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ فَاتَّبَعُوا أَمْرَ فِرْعَوْنَ ۖ وَمَا أَمْرُ فِرْعَوْنَ بِرَشِيدٍ",
      "verseStringB": "To Pharaoh and his chiefs, but they followed the bidding of Pharaoh; and Pharaoh’s bidding was not right-directing."
    },
    {
      "verseNumber": 98,
      "verseString": "يَقْدُمُ قَوْمَهُ يَوْمَ الْقِيَامَةِ فَأَوْرَدَهُمُ النَّارَ ۖ وَبِئْسَ الْوِرْدُ الْمَوْرُودُ",
      "verseStringB": "He will lead his people on the day of Resurrection, and bring them down to the Fire. And evil the place to which they are brought!"
    },
    {
      "verseNumber": 99,
      "verseString": "وَأُتْبِعُوا فِي هَٰذِهِ لَعْنَةً وَيَوْمَ الْقِيَامَةِ ۚ بِئْسَ الرِّفْدُ الْمَرْفُودُ",
      "verseStringB": "And they are overtaken by a curse in this (world), and on the day of Resurrection. Evil the gift which shall be given!"
    },
    {
      "verseNumber": 100,
      "verseString": "ذَٰلِكَ مِنْ أَنْبَاءِ الْقُرَىٰ نَقُصُّهُ عَلَيْكَ ۖ مِنْهَا قَائِمٌ وَحَصِيدٌ",
      "verseStringB": "This is an account of the towns which We relate to thee. Of them are some that stand and (others) mown down."
    },
    {
      "verseNumber": 101,
      "verseString": "وَمَا ظَلَمْنَاهُمْ وَلَٰكِنْ ظَلَمُوا أَنْفُسَهُمْ ۖ فَمَا أَغْنَتْ عَنْهُمْ آلِهَتُهُمُ الَّتِي يَدْعُونَ مِنْ دُونِ اللَّهِ مِنْ شَيْءٍ لَمَّا جَاءَ أَمْرُ رَبِّكَ ۖ وَمَا زَادُوهُمْ غَيْرَ تَتْبِيبٍ",
      "verseStringB": "And We wronged them not but they wronged themselves. And their gods whom they called upon besides Allāh availed them naught when the decree of thy Lord came to pass. And they added to them naught but ruin."
    },
    {
      "verseNumber": 102,
      "verseString": "وَكَذَٰلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَىٰ وَهِيَ ظَالِمَةٌ ۚ إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ",
      "verseStringB": "And such is the punishment of thy Lord, when He punishes the towns while they are iniquitous. Surely His punishment is painful, severe."
    },
    {
      "verseNumber": 103,
      "verseString": "إِنَّ فِي ذَٰلِكَ لَآيَةً لِمَنْ خَافَ عَذَابَ الْآخِرَةِ ۚ ذَٰلِكَ يَوْمٌ مَجْمُوعٌ لَهُ النَّاسُ وَذَٰلِكَ يَوْمٌ مَشْهُودٌ",
      "verseStringB": "Surely there is a sign in this for him who fears the chastisement of the Hereafter. That is a day on which people will be gathered together, and that is a day to be witnessed."
    },
    {
      "verseNumber": 104,
      "verseString": "وَمَا نُؤَخِّرُهُ إِلَّا لِأَجَلٍ مَعْدُودٍ",
      "verseStringB": "And We delay it not but for an appointed term."
    },
    {
      "verseNumber": 105,
      "verseString": "يَوْمَ يَأْتِ لَا تَكَلَّمُ نَفْسٌ إِلَّا بِإِذْنِهِ ۚ فَمِنْهُمْ شَقِيٌّ وَسَعِيدٌ",
      "verseStringB": "On the day when it comes, no soul will speak except by His permission; so (some) of them will be unhappy and (others) happy."
    },
    {
      "verseNumber": 106,
      "verseString": "فَأَمَّا الَّذِينَ شَقُوا فَفِي النَّارِ لَهُمْ فِيهَا زَفِيرٌ وَشَهِيقٌ",
      "verseStringB": "Then as for those who are unhappy, they will be in the Fire; for them therein will be sighing and groaning —"
    },
    {
      "verseNumber": 107,
      "verseString": "خَالِدِينَ فِيهَا مَا دَامَتِ السَّمَاوَاتُ وَالْأَرْضُ إِلَّا مَا شَاءَ رَبُّكَ ۚ إِنَّ رَبَّكَ فَعَّالٌ لِمَا يُرِيدُ",
      "verseStringB": "Abiding therein so long as the heavens and the earth endure, except as thy Lord please. Surely thy Lord is Doer of what He intends.ᵃ"
    },
    {
      "verseNumber": 108,
      "verseString": "وَأَمَّا الَّذِينَ سُعِدُوا فَفِي الْجَنَّةِ خَالِدِينَ فِيهَا مَا دَامَتِ السَّمَاوَاتُ وَالْأَرْضُ إِلَّا مَا شَاءَ رَبُّكَ ۖ عَطَاءً غَيْرَ مَجْذُوذٍ",
      "verseStringB": "And as for those who are made happy, they will be in the Garden abiding therein so long as the heavens and the earth endure, except as thy Lord please — a gift never to be cut off.ᵃ"
    },
    {
      "verseNumber": 109,
      "verseString": "فَلَا تَكُ فِي مِرْيَةٍ مِمَّا يَعْبُدُ هَٰؤُلَاءِ ۚ مَا يَعْبُدُونَ إِلَّا كَمَا يَعْبُدُ آبَاؤُهُمْ مِنْ قَبْلُ ۚ وَإِنَّا لَمُوَفُّوهُمْ نَصِيبَهُمْ غَيْرَ مَنْقُوصٍ",
      "verseStringB": "So be not thou in doubt as to that which these worship. They worship only as their fathers worshipped before. And surely We shall pay them in full their due undiminished."
    },
    {
      "verseNumber": 110,
      "verseString": "وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ فَاخْتُلِفَ فِيهِ ۚ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَبِّكَ لَقُضِيَ بَيْنَهُمْ ۚ وَإِنَّهُمْ لَفِي شَكٍّ مِنْهُ مُرِيبٍ",
      "verseStringB": "And We certainly gave the Book to Moses, but differences arose therein.ᵃ And had not a word gone forth from thy Lord, the matter would have been decided between them. And they are surely in a disquieting doubt about it."
    },
    {
      "verseNumber": 111,
      "verseString": "وَإِنَّ كُلًّا لَمَّا لَيُوَفِّيَنَّهُمْ رَبُّكَ أَعْمَالَهُمْ ۚ إِنَّهُ بِمَا يَعْمَلُونَ خَبِيرٌ",
      "verseStringB": "And thy Lord will surely pay back to all their deeds in full. He indeed is Aware of what they do."
    },
    {
      "verseNumber": 112,
      "verseString": "فَاسْتَقِمْ كَمَا أُمِرْتَ وَمَنْ تَابَ مَعَكَ وَلَا تَطْغَوْا ۚ إِنَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "verseStringB": "Continue then in the right way as thou art commanded, as also (should) those who turn (to Allāh) with thee. And be not inordInᵃ te, (O men). Surely He is Seer of what you do."
    },
    {
      "verseNumber": 113,
      "verseString": "وَلَا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ وَمَا لَكُمْ مِنْ دُونِ اللَّهِ مِنْ أَوْلِيَاءَ ثُمَّ لَا تُنْصَرُونَ",
      "verseStringB": "And incline not to those who do wrong, lest the fire touch you; and you have no protectors besides Allāh, then you would not be helped.ᵃ"
    },
    {
      "verseNumber": 114,
      "verseString": "وَأَقِمِ الصَّلَاةَ طَرَفَيِ النَّهَارِ وَزُلَفًا مِنَ اللَّيْلِ ۚ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ ۚ ذَٰلِكَ ذِكْرَىٰ لِلذَّاكِرِينَ",
      "verseStringB": "And keep up prayer at the two ends of the day and in the first hours of the night. Surely good deeds take away evil deeds. This is a reminder for the mindful.ᵃ"
    },
    {
      "verseNumber": 115,
      "verseString": "وَاصْبِرْ فَإِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِينَ",
      "verseStringB": "And be patient, for surely Allāh wastes not the reward of the doers of good."
    },
    {
      "verseNumber": 116,
      "verseString": "فَلَوْلَا كَانَ مِنَ الْقُرُونِ مِنْ قَبْلِكُمْ أُولُو بَقِيَّةٍ يَنْهَوْنَ عَنِ الْفَسَادِ فِي الْأَرْضِ إِلَّا قَلِيلًا مِمَّنْ أَنْجَيْنَا مِنْهُمْ ۗ وَاتَّبَعَ الَّذِينَ ظَلَمُوا مَا أُتْرِفُوا فِيهِ وَكَانُوا مُجْرِمِينَ",
      "verseStringB": "Why were there not then among the generations before you those possessing understanding,ᵃ forbidding mischief in the earth, except a few among them whom We delivered? And the unjust pursued the enjoyment of plenty, and they were guilty."
    },
    {
      "verseNumber": 117,
      "verseString": "وَمَا كَانَ رَبُّكَ لِيُهْلِكَ الْقُرَىٰ بِظُلْمٍ وَأَهْلُهَا مُصْلِحُونَ",
      "verseStringB": "And thy Lord would not destroy the towns unjustly, while their people acted well.ᵃ"
    },
    {
      "verseNumber": 118,
      "verseString": "وَلَوْ شَاءَ رَبُّكَ لَجَعَلَ النَّاسَ أُمَّةً وَاحِدَةً ۖ وَلَا يَزَالُونَ مُخْتَلِفِينَ",
      "verseStringB": "And if thy Lord had pleased, He would have made people a single nation.ᵃ And they cease not to differ,"
    },
    {
      "verseNumber": 119,
      "verseString": "إِلَّا مَنْ رَحِمَ رَبُّكَ ۚ وَلِذَٰلِكَ خَلَقَهُمْ ۗ وَتَمَّتْ كَلِمَةُ رَبِّكَ لَأَمْلَأَنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَالنَّاسِ أَجْمَعِينَ",
      "verseStringB": "Except those on whom thy Lord has mercy; and for this did He create them.ᵃ And the word of thy Lord is fulfilled: I shall fill hell with jinn and men, all together.ᵇ"
    },
    {
      "verseNumber": 120,
      "verseString": "وَكُلًّا نَقُصُّ عَلَيْكَ مِنْ أَنْبَاءِ الرُّسُلِ مَا نُثَبِّتُ بِهِ فُؤَادَكَ ۚ وَجَاءَكَ فِي هَٰذِهِ الْحَقُّ وَمَوْعِظَةٌ وَذِكْرَىٰ لِلْمُؤْمِنِينَ",
      "verseStringB": "And all We relate to thee of the account of the messengers is to strengthen thy heart therewith. And in this has come to thee the truth and an admonition and a reminder for the believers."
    },
    {
      "verseNumber": 121,
      "verseString": "وَقُلْ لِلَّذِينَ لَا يُؤْمِنُونَ اعْمَلُوا عَلَىٰ مَكَانَتِكُمْ إِنَّا عَامِلُونَ",
      "verseStringB": "And say to those who believe not: Act according to your power, surely we too are acting;"
    },
    {
      "verseNumber": 122,
      "verseString": "وَانْتَظِرُوا إِنَّا مُنْتَظِرُونَ",
      "verseStringB": "And wait, surely we are waiting (also)."
    },
    {
      "verseNumber": 123,
      "verseString": "وَلِلَّهِ غَيْبُ السَّمَاوَاتِ وَالْأَرْضِ وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فَاعْبُدْهُ وَتَوَكَّلْ عَلَيْهِ ۚ وَمَا رَبُّكَ بِغَافِلٍ عَمَّا تَعْمَلُونَ",
      "verseStringB": "And Allāh’s is the unseen in the heavens and the earth, and to Him the whole affair will be returned. So serve Him and put thy trust in Him. And thy Lord is not heedless of what you d"
    }
  ],
  "nameEnglish": "Hud",
  "nameTrans": "Hud",
  "nameArabic": "هود",
  "chapterNumber": 11,
  "nVerses": 123,
  "footnotes": [
    {
      "note": "3a. One endowed with grace signifies one on whom Allåh bestows His grace. The  dhß fa˙l here is the possessor of spiritual blessings in addition to the material benefits  spoken of in the preceding words. /n/n 5a. Thanå ©adra-h∂ (lit., he folded his breast or bosom) means he concealed enmity  in his breast or bosom (LL). This meaning is made clear in the words that follow. /n/n 5b. He covered himself with his garment, in order that he might not see nor hear  (LL). According to R, the meaning is that they make their garments a covering over  their ears, and this signifies their holding back from lending an ear, or it is an allusion  to their running away. /n/n 7a. The meaning of ‘arsh (“Throne of Power”) has been explained in 7:54b. For  kåna, see 2:213a. What is the relation between water and the manifestation of the Power  of God, for which the ‘arsh stands? This is explained by the Qur’ån itself: “And We  made from water everything living” (21:30). Man is the highest developed form of life,  and life is due to water. The great power of God which is manifested in the creation of  man is thus connected with water. And as physical life grows out of water, so spiritual  life grows out of revelation, which is so often compared with rain or water. God’s great  power has thus been made manifest through water, and hence with the creation of the  heavens and the earth is mentioned the fact that God’s Throne of Power is ever on the  waters. The words that follow make it clearer still; see the next note.  /n/n 7b. The two words balå-hu and ibtalå-hu are synonymous and mean originally the  manifestation of good qualities and mean qualities (T). The object of the creation of  man and all that has been brought into existence is that the great qualities with which  man is endowed should be manifested. But that manifestation, we are told in the words  that follow, takes place, not in this life, but in the life after death. This truth is expressed  in the words, if thou sayest, You shall surely be raised up after death. For the use of the  words, balå and ibtalå, in the sense of the manifestation of the great and good qualities  with which man is endowed, see 8:17b. /n/n 7c. The word siƒr is used here clearly in the sense of deceit or falsehood; see  2:102e. /n/n 8a. The stated period of time is thus referred to in 8:33: “And Allåh would not chastise them while thou wast among them”.  /n/n 12a. This passage does not signify that the Prophet intended to give up any part of  the revelation; on the other hand, it is a strong statement indicating that he could not do  it. It is a peculiar use of the word la‘alla. Rz says: “You say of a person when you  intend to show his remoteness from a thing: Maybe (Ar., la‘alla-ka) you have power to  do such a thing”. /n/n 13a. This challenge is contained in four different chapters of the Holy Qur’ån.  Firstly in 17:88: “Say: If men and jinn should combine together to bring the like of this  Qur’ån, they could not bring the like of it, though some of them were aiders of others.”  This is the earliest in point of revelation. Then in the verse under discussion, the demand  is reduced to ten chapters. Lastly in 10:38 and 2:23 they are challenged to produce a  single chapter like the Qur’ån. Another point worth noting is that, while in 17:88 men  and jinn are challenged, in 2:23 the word shuhadå’, which means their great or learned  men, is substituted for jinn, thus showing that jinn in 17:88 means only their great men;  see 2:23a for full explanation. /n/n 14a. The disbelievers are addressed here, the meaning being that, if the false gods or  the leaders do not answer their devotees when they call on them to assist them in  producing a like of the Qur’ån, then at least no doubt should be left in their minds that  the Qur’ån is not the work of the Prophet, but a revelation from the Divine Being /n/n 16a. That is, their works and other deeds will not result in any good to them. /n/n 17a. The several statements made in this verse require to be explained. He who has with  him clear proof from his Lord applies to every believer in the truth of the Holy Qur’ån; the  words these believe in it, occuring further on, make this clear. The witness from Allåh, who  recites it, is the Holy Prophet, who is called a witness elsewhere, as being an exemplar for  the believers. Besides being a clear proof in itself, the Holy Qur’ån has a further evidence of  its truth in the book of Moses, which is, therefore, called a guide and a mercy, because it  contains clear prophecies of the truth of the Prophet. The meaning of the whole passage is:  He who, being a believer in the truth of the Holy Qur’ån, has clear proof from his Lord, and  who has an exemplar for him in the person of the Holy Prophet, and has additional testimony  of his truth in the book of Moses, is not like him who loves this world and cares not for the  Truth? The latter statement, being included in the previous verses, is omitted here. /n/n 18a. The witnesses are according to some the angels; according to others, the  prophets — and this is corroborated by 4:41; according to still others the believers. /n/n 20a. They would not escape the chastisement, if Allåh intended to punish them in  this world. A‘jaza-h∂, of which mu‘jiz is the noun form, may also be translated as he  found him without strength or ability, or he frustrated his power or purpose.   /n/n 20b. This only shows their great hatred of the truth. They could not bear even to   hear what the Prophet said, and they ran away when he spoke. /n/n 35a. The change shows positively that the disbelievers of Makkah are meant, and   the reference is to their calling the Qur’ån a forgery. This shows that the histories of the   prophets are referred to in the Holy Qur’ån as a warning for the Prophet’s opponents. /n/n 38a. The laughing of the righteous at the wicked is not to be taken literally. You laugh   at a thing to show your contempt for it; even as the disbelieving people showed their contempt for the making of the ark, the believer in Divine promise shows his contempt for   their opposition and their plans to destroy him. Kf gives another significance: If you think   us ignorant on account of what we are doing, we consider you ignorant on account of your   disbelief ... because your thinking us ignorant is due really to your own ignorance. /n/n 40a. Får al-tann∂r is translated by Sale as meaning the oven poured forth water, by   Palmer the oven boiled, and by Rodwell the earth’s surface boiled up, all three at the   same time adding a note that the word tann∂r also signifies a reservoir (Palmer), or a   reservoir of water (Rodwell), or a place whence waters spring forth or where they are   collected (Sale). But it is, I think, more a misconception of the word fåra which has led   to the error, than that of the word tann∂r. Fåra means it (the water) boiled, or it (the   fire) raged, but neither of these significances is applicable here, as the oven could not   boil, nor could it rage, because tann∂r does not mean fire. But it has also another significance. LL Says: “Fåra, said of water, signifies also it welled or came forth from the   earth or ground (Mgh); it appeared, spouting forth from the spring or source (T)”.   Hence also fawwårah signifies a spring or source of water. And tann∂r, according to the   same authority, means the highest part of the earth or ground (T); any place from which   water pours forth, a place where the water of a valley collects (Q). Now these two significances of the two words fåra and tann∂r so suit each other, and each so suits the context, that they would appeal even to a man of ordinary intelligence. We know, from v.   43, where Noah’s son is made to say: “I will betake myself for refuge to a mountain,”   that there must have been a valley.  /n/n 40b. Each of a pair is called in Arabic a zauj, and hence the dual form zaujain   means only a pair, and accordingly by two zaujain are meant one male and one female   of each pair. By all things are apparently meant all things needed by Noah, and not all   things existing in the world, which was too extensive for Noah to travel over. /n/n 42a. It should be borne in mind that the Qur’ån does not give any countenance to   the story that the deluge covered the whole surface of the earth. On the other hand, it   repeatedly speaks of Noah as having been sent to his people, i.e. to a single tribe, and   according to the Divine law the punishment must have overtaken his people, who not   only rejected the truth, but also sought to destroy Noah and his followers. The mention   of the water flowing from the valley also shows that it was only a tract of land that was   deluged, and not the entire earth. The taking in of a pair of all things does not mean that   Noah had travelled over the whole earth and taken a pair of every living animal wherever it could be found: in that case he would have spent perhaps a thousand years in collecting pairs of all living creatures on earth, and then without success. The order is   clearly to take in pairs of all those things that he considered necessary for himself and   those who were with him in the ark. The Bible narrative, which makes God “bring a   flood of waters upon the earth, to destroy all flesh wherein is the breath of life, from   under heaven” (Gen. 6:17), and then makes Noah collect and lodge in an ark a pair of   each of the thousands of animals and birds, cannot be accepted /n/n 43a. Man raƒima may either mean He Who has mercy, referring to Allåh, the   significance being that only the Merciful One can save from the punishment, or the   phrase may mean he on whom He has mercy. The meaning in the latter case is: Nothing   can protect from the chastisement sent by Allåh, but he only will be protected on whom   Allåh has mercy. /n/n 44a. The Greek name of this mountain is said to be Gordyoei, being one of those   mountains which divide Armenia on the south from Mesopotamia. Sale says: “The   tradition which affirms the ark to have rested on those mountains must have been very   ancient, since it is a tradition of the Chaldeans themselves”. And again: “The relics of   the ark were also to be seen in the time of Epiphanius, if we are to believe him (Epiph.   Haeres, 18); we are also told that the Emperor Heraclius went from the town of   Thamanin up to the mountain Al-J∂dß, and saw the place of the ark (Elmacin, I. i.c.l.).   Formerly there also existed a famous monastery, called the monastery of the ark, on one   of those mountains”. /n/n 46a. When it is meant to speak of a person as the very embodiment of a certain   quality, he is designated not as the possessor of that quality, but as that quality itself.   Thus you speak of a person as being karm, lit. excellence, or j∂d, lit. charity, meaning he   is the very embodiment of excellence or charity. In 2:177 it is said, literally, righteousness is he who believes, the meaning apparently being that such a person is the embodiment of righteousness. Inna-h∂ ‘amal-un ghairu ©åliƒ-in thus means that he is an   embodiment of unrighteous conduct. /n/n 49a. The announcement relating to the unseen is not the history of Noah, but the fate of   the opponents of the Holy Prophet, as read in that history. The words that follow — be   patient — are a clear indication, for patient waiting was needed for the fate of the Prophet’s   opponents, not for anything relating to Noah’s history. At the end of the last section there is   also a similar reference to the opponents of the Holy Prophet; compare also the 26th chapter, in which the history of every prophet is concluded with the words: “Surely there is a   sign in this, yet most of them believe not”, where the fate of the opponents of the Holy   Prophet is indicated as being identical with the fate of those who opposed earlier prophets.  /n/n 50a. For ‘Åd and their prophet H∂d, see 7:65a. /n/n 56a. My Lord is on the right path signifies that He does not deviate from justice so   that He should destroy the righteous or that the iniquitous should escape His punishment. /n/n 64a. See 7:73a, 74a. For the she-camel, see 7:73c. /n/n 67a. It was an earthquake; see 7:78a.  /n/n 69a. Compare Gen. 18:1– 7. According to the Bible (Gen. 18:8), they ate the roasted   calf and other food provided by Abraham. But the contrary, as Rodwell notes, was maintained by the Rabbins, and he directs attention to Is. Baba Mezia, fol. 86: “They made as   though they ate”. Whether they were angels or men, is not made clear here or anywhere   else in the Holy Qur’ån. But owing to the fact that they did not partake of food, and the   fact that they brought to Abraham news of a son and of the destruction of Lot’s people,   they are generally looked upon as angels who appeared in the similitude of men. /n/n 70a. Elsewhere it is made clear that the news of the birth of a son was given to   Abraham first: “So he conceived fear of them. They said: Fear not. And they gave him   good news of a boy possessing knowledge. Then his wife came up in grief, and she   smote her face and said: A barren old woman!” (51:28, 29). This explains Sarah’s wonder as stated in v. 71. It was after receiving the good news of the birth of a son that   Abraham was informed of the destruction of Lot’s people. The statement made further   on in v. 71 that Sarah was given the good news of the birth of a son is by way of reassurance on her expression of wonder, and to give the further news of a son’s son, Jacob.  /n/n 71a. Compare Gen. 18:10 –12. The mention of a son’s son (Jacob) was to show that   that son should have progeny. It should be borne in mind that warå’, which ordinarily   signifies beyond, behind or before, also means a son’s son (T). Elsewhere Jacob is   expressly called nåfilah (21:72) which means a grandson. /n/n 72a. The original words are yå wailatå, and they are expressive of grief and sorrow.   It should be remembered, however, that according to the best authorities wail is used to   express wonder, whether the occasion be one of weal or woe. “And wail does occur in   the sense of wonder” (T). According to AH, it is a word which is frequently used by   women when anything causing wonder occurs to them. /n/n 73a. Ahl al-bait includes the wife of a person; in fact, it is Abraham’s wife that is   primarily addressed here. The same phrase in the case of the Holy Prophet (33:33)   includes his wives as well as his children. /n/n 74a. Compare Gen. 18:21–23. /n/n 77a. Dhar‘, which primarily signifies stretching forth the arm, is used in the sense   of power or ability (T). The meaning of the phrase here is that he was unable to do the   thing, or he lacked strength to accomplish the affair (LL).  /n/n 78a. Lot, it appears from Gen. 19:9, was a stranger in the city: “This one fellow   came in to sojourn, and he will needs be a judge,” and the messengers being strangers,   the townsmen would not allow him to keep them. Lot offered his daughters as hostages   so that he might be allowed to keep his guests with him, for according to 15:70 he had   not permission to allow any stranger to come under his roof: “Did we not forbid thee   from people?” i.e. from giving shelter to them. This may have been due to the constant   danger of tribal fighting. Another view is that Lot offered his daughters for marriage, as   thus he would not be a stranger among them but would be one of them. Some commentators have suggested that Lot did not point to his real daughters, but to women of the   tribe, because a prophet would speak of the women of his tribe as his daughters (Rz,   JB), and in that case he did no more than point to the natural relation of man and   woman. The answer of his people seems, however, to relate to his daughters. /n/n 80a. Allåh is the strong support to Whom the righteous have recourse when they are   in trouble. The particle au signifies or, as well as rather, in the latter case being the   equivalent of bal (LL). /n/n 81a. Compare Gen. 19:26.  /n/n 82a. It was a severe earthquake, which so utterly demolished the cities as to turn   them upside down. In 15:73 it is called ©aiƒah, i.e., the rumbling that precedes an earthquake; see 7:84a.  /n/n 82b. The raining down of stones might have been the result of a volcanic eruption   which was accompanied by an earthquake. /n/n 82c. The word sijjßl is derived from the root sajala, meaning he poured forth   (water), from which a large number of derivatives have followed, as usual in Arabic.   Sajjala means he wrote a paper or a scroll, or decided judicially. Sijjßl means what had   been written or decreed for them (LL).  /n/n 83a. The concluding words indicate a reversion to the subject of the punishment of   the opponents of the Holy Prophet. It refers to the punishment. /n/n 83a. The concluding words indicate a reversion to the subject of the punishment of   the opponents of the Holy Prophet. It refers to the punishment. /n/n 107a. This limitation on the duration of abiding in hell — except as thy Lord please —   is given twice in the Holy Qur’ån, here and in 6:128, and it shows clearly that the punishment of hell is not everlasting. A comparison with the verse that follows makes it clearer.   There, too, we have that those in paradise will abide there as long as the heavens and the   earth endure, except as thy Lord please, but the statement is immediately followed by   another: A gift never to be cut off. This shows that in fact there is no limitation upon the   eternity of paradise, and the words except as thy Lord please have been used, in the case of   paradise, only to express the unbounded power and greatness of the Divine Being and the   fact that it is due to God’s pleasure that they are there. In the case of hell, however, the   words except as thy Lord please are followed by a statement which corroborates the limitation thus placed, for, Fa“ål, as an attribute of the Divine Being, indicates that He does even   those things which seem impossible to others, the word being an intensive form of få‘ßl,   meaning doer. It should be noted further that in both cases it is Rabb, lit., the Nourisher to   perfection, Whose will is to be exercised. The end is in both cases the same. Man is   ultimately to be brought to perfection, but this cannot be, unless those in hell are taken out   of it and set on the road to spiritual progress, thrown into the river of Life as a ƒadßth has it.   Various sayings of the Holy Prophet corroborate the statement made above. For   instance, the concluding portion of a ƒadßth which is met with in one of the most reliable   collections runs thus: “Then will Allåh say: The angels and the prophets and the faithful   have all in their turn interceded for the sinners, and now there remains none to intercede   for them except the most Merciful of all the merciful ones. So He will take out a handful   from the Fire and bring out a people who never worked any good” (B. 97:24).   According to this ƒadßth, such people are called Ôulaqå al-Raƒmån, or the freed ones of   the Beneficent, Who exercises His mercy towards those who have done nothing to   deserve it. There are also other sayings in the Kanz al-‘Ummål: “Surely a day will come   over hell when it will be like a field of corn that has dried up after flourishing for a   while”; and again: “Surely a day will come over hell when there will not be a single   human being in it” (vol. vii, p. 245). There is also a saying of ‘Umar on record: “Even if   the dwellers in hell may be numberless as the sands of the desert, a day will surely come   when they will be taken out of it” (FB).   One question, however, remains to be answered, and that is the use of the word   abad, which is generally considered as meaning forever. The abiding in hell for abad is   mentioned thrice in the Holy Qur’ån, in 4:169, 33:65 and 72:23. It is, however, stated   by all lexicologists that abad signifies a long time (LL), being synonymous with dahr   Δawßl or a long time (Mgh), as also time without end (T). It is due to its significance as a   long time that it has a plural form åbåd, which it could not have if eternity were its only   significance. The Qur’ån makes this use of the word clear by stating in 78:23 that the   disbelievers will remain in hell for aƒqåb, i.e. long years, the word being plural of   ƒuqbah, which means seventy or eighty years (see 78:23a). /n/n 108a. In accordance with what is said here in connection with the heavenly life, that   it is a gift which shall never be cut off, we have in 15:48: “Nor will they be ejected   therefrom”.  /n/n 110a. Ikhtalafa means also khålafa, i.e. he acted in opposition to, or disagreed with   (see 2:176a for full explanation), and thus the words may mean that the Jews acted   against it.  /n/n 113a. Not only is man forbidden to do any wrong himself, but he should keep himself at a safe distance from wrong and refrain from leaning towards the wrongdoers. /n/n 114a. The times of prayer are clearly indicated in this verse. Of the two ends of the   day, the first is the fajr, or the prayer before sunrise, and the second includes the ˚uhr, or the early afternoon, and the ‘a©r, or the later afternoon, prayers. In the first hours of the   night we have the maghrib, or the after sunset prayer, and the ‘ishå’, or the prayer   before going to bed. The two afternoon prayers and the two after sunset prayers, which   are spoken of together, may under exceptional circumstances be said together. /n/n 116a. The phrase ul∂ baqiyyah is interpreted in a number of ways: persons possessed   of excellence, or possessing a relic of judgment and intelligence, or persons of understanding and discrimination, or persons of obedience (LL). For the word baqiyyah, see 86a.  /n/n 117a. We are told here that God does not destroy people unjustly; He destroys them   only when they act corruptly and make mischief in the land. He would not destroy them   if they act well, whatever their beliefs. Most of the commentators take the word ˚ulm   here as meaning shirk, the significance being that God would not destroy people, even   though they were guilty of shirk, provided they acted well. The translation in this case   would be, thy Lord would not destroy the towns for wrong beliefs, while their people   acted well. It should be noted that the word ˚ulm is very broad in its significance.   According to R, ˚ulm is of three kinds: (1) as between man and Allåh, the greatest of   which is kufr or disbelief and shirk or polytheism; this would, of course, include all   wrong beliefs with regard to the Divine Being; (2) as between man and man, which   would include all kinds of transgressions involving a violation of the rights of others;   (3) as between man and his own self, which would include all kinds of guilty action   injurious not to others but to man’s own self.  /n/n 118a. God does not force men to one particular belief; He has given them the choice   to accept or reject the truth. /n/n 119a. Here it is clearly stated that Allåh created all men to have mercy on them. By   His mercy He guides some to the right path, while to others, who go over to evil and make themselves deserving of hell, mercy will come only after suffering. It is by their   own hands that they get into distress and difficulty, while Allåh has mercy on them in   extricating them from it. /n/n 119b. Because they went against the ways which Allåh had mercifully shown to   them, therefore they must pass through another ordeal, so that they may be purged of   evil and made fit for spiritual progress."
    }
  ]
}
