{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "المر ۚ تِلْكَ آيَاتُ الْكِتَابِ ۗ وَالَّذِي أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ الْحَقُّ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ",
      "verseStringB": ". I, Allāh, am the Best Knower, the Seer.ᵃ These are verses of the Book. And that which is revealed to thee from thy Lord is the Truth, but most people believe not."
    },
    {
      "verseNumber": 2,
      "verseString": "اللَّهُ الَّذِي رَفَعَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ۖ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۖ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ ۖ كُلٌّ يَجْرِي لِأَجَلٍ مُسَمًّى ۚ يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ لَعَلَّكُمْ بِلِقَاءِ رَبِّكُمْ تُوقِنُونَ",
      "verseStringB": "Allāh is He Who raised the heavens without any pillars that you can see, and He is established on the Throne of Power,ᵃ and He made the sun and the moon subservient (to you). Each one runs to an appointed term. He regulates the affair, making clear the messages that you may be certain of the meeting with your Lord."
    },
    {
      "verseNumber": 3,
      "verseString": "وَهُوَ الَّذِي مَدَّ الْأَرْضَ وَجَعَلَ فِيهَا رَوَاسِيَ وَأَنْهَارًا ۖ وَمِنْ كُلِّ الثَّمَرَاتِ جَعَلَ فِيهَا زَوْجَيْنِ اثْنَيْنِ ۖ يُغْشِي اللَّيْلَ النَّهَارَ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ",
      "verseStringB": "And He it is Who spread the earth, and made in it firm mountains and rivers. And of all fruits He has made in it pairs, two (of every kind). He makes the night cover the day. Surely there are signs in this for a people who reflect."
    },
    {
      "verseNumber": 4,
      "verseString": "وَفِي الْأَرْضِ قِطَعٌ مُتَجَاوِرَاتٌ وَجَنَّاتٌ مِنْ أَعْنَابٍ وَزَرْعٌ وَنَخِيلٌ صِنْوَانٌ وَغَيْرُ صِنْوَانٍ يُسْقَىٰ بِمَاءٍ وَاحِدٍ وَنُفَضِّلُ بَعْضَهَا عَلَىٰ بَعْضٍ فِي الْأُكُلِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَعْقِلُونَ",
      "verseStringB": "And in the earth are tracts side by side, and gardens of vines, and corn, and palm-trees growing from one root and distinct roots — they are watered with one water; and We make some of them to excel others in fruit. Surely there are signs in this for a people who understand.ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "وَإِنْ تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ أَإِذَا كُنَّا تُرَابًا أَإِنَّا لَفِي خَلْقٍ جَدِيدٍ ۗ أُولَٰئِكَ الَّذِينَ كَفَرُوا بِرَبِّهِمْ ۖ وَأُولَٰئِكَ الْأَغْلَالُ فِي أَعْنَاقِهِمْ ۖ وَأُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ",
      "verseStringB": "And if thou wonderest, then wondrous is their saying: When we are dust, shall we then be raised in a new creation? These are they who disbelieve in their Lord, and these have chains on their necks, and they are the companions of the Fire; in it they will abide.ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "وَيَسْتَعْجِلُونَكَ بِالسَّيِّئَةِ قَبْلَ الْحَسَنَةِ وَقَدْ خَلَتْ مِنْ قَبْلِهِمُ الْمَثُلَاتُ ۗ وَإِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ لِلنَّاسِ عَلَىٰ ظُلْمِهِمْ ۖ وَإِنَّ رَبَّكَ لَشَدِيدُ الْعِقَابِ",
      "verseStringB": "And they ask thee to hasten on the evil before the good, and indeed there have been exemplary punishmentsa before them. And surely thy Lord is full of forgiveness for mankind notwithstanding their iniquity.ᵇ And surely thy Lord is Severe in requiting."
    },
    {
      "verseNumber": 7,
      "verseString": "وَيَقُولُ الَّذِينَ كَفَرُوا لَوْلَا أُنْزِلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ ۗ إِنَّمَا أَنْتَ مُنْذِرٌ ۖ وَلِكُلِّ قَوْمٍ هَادٍ",
      "verseStringB": "And those who disbelieve say: Why has not a sign been sent down to him from his Lord? Thou art only a warner and for every people a guide.ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "اللَّهُ يَعْلَمُ مَا تَحْمِلُ كُلُّ أُنْثَىٰ وَمَا تَغِيضُ الْأَرْحَامُ وَمَا تَزْدَادُ ۖ وَكُلُّ شَيْءٍ عِنْدَهُ بِمِقْدَارٍ",
      "verseStringB": "Allāh knows what every female bears, and that of which the wombs fall short of completion and that which they grow.ᵃ And everything with Him has a measure."
    },
    {
      "verseNumber": 9,
      "verseString": "عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْكَبِيرُ الْمُتَعَالِ",
      "verseStringB": "The Knower of the unseen and the seen, the Great, the Most High."
    },
    {
      "verseNumber": 10,
      "verseString": "سَوَاءٌ مِنْكُمْ مَنْ أَسَرَّ الْقَوْلَ وَمَنْ جَهَرَ بِهِ وَمَنْ هُوَ مُسْتَخْفٍ بِاللَّيْلِ وَسَارِبٌ بِالنَّهَارِ",
      "verseStringB": "Alike (to Him) among you is he who conceals (the) word and he who speaks openly, and he who hides himself by night and (who) goes forth by day.ᵃ"
    },
    {
      "verseNumber": 11,
      "verseString": "لَهُ مُعَقِّبَاتٌ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنْ أَمْرِ اللَّهِ ۗ إِنَّ اللَّهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتَّىٰ يُغَيِّرُوا مَا بِأَنْفُسِهِمْ ۗ وَإِذَا أَرَادَ اللَّهُ بِقَوْمٍ سُوءًا فَلَا مَرَدَّ لَهُ ۚ وَمَا لَهُمْ مِنْ دُونِهِ مِنْ وَالٍ",
      "verseStringB": "For him are (angels) guarding the consequences (of his deeds), before him and behind him, who guard him by Allāh’s command.ᵃ Surely Allāh changes not the condition of a people, until they change their own condition. And when Allāh intends evil to a people, there is no averting it, and besides Him they have no protector."
    },
    {
      "verseNumber": 12,
      "verseString": "هُوَ الَّذِي يُرِيكُمُ الْبَرْقَ خَوْفًا وَطَمَعًا وَيُنْشِئُ السَّحَابَ الثِّقَالَ",
      "verseStringB": "He it is Who shows you the lightning causing fear and hope and (Who) brings up the heavy cloud."
    },
    {
      "verseNumber": 13,
      "verseString": "وَيُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ وَيُرْسِلُ الصَّوَاعِقَ فَيُصِيبُ بِهَا مَنْ يَشَاءُ وَهُمْ يُجَادِلُونَ فِي اللَّهِ وَهُوَ شَدِيدُ الْمِحَالِ",
      "verseStringB": "And the thunder celebrates His praise, and the angels too for awe of Him. And He sends the thunderbolts and smites with them whom He pleases, yet they dispute concerning Allāh, and He is Mighty in prowess."
    },
    {
      "verseNumber": 14,
      "verseString": "لَهُ دَعْوَةُ الْحَقِّ ۖ وَالَّذِينَ يَدْعُونَ مِنْ دُونِهِ لَا يَسْتَجِيبُونَ لَهُمْ بِشَيْءٍ إِلَّا كَبَاسِطِ كَفَّيْهِ إِلَى الْمَاءِ لِيَبْلُغَ فَاهُ وَمَا هُوَ بِبَالِغِهِ ۚ وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ",
      "verseStringB": "To Him is due the true prayer. And those to whom they pray besides Him give them no answer, but (they are) like one who stretches forth his two hands towards water that it may reach his mouth, but it will not reach it. And the prayer of the disbelievers is only wasted."
    },
    {
      "verseNumber": 15,
      "verseString": "وَلِلَّهِ يَسْجُدُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا وَظِلَالُهُمْ بِالْغُدُوِّ وَالْآصَالِ ۩",
      "verseStringB": "And whoever is in the heavens and the earth makes obeisance to Allāh only, willingly and unwillingly, and their shadows, too, at morn and eve.ᵃ"
    },
    {
      "verseNumber": 16,
      "verseString": "قُلْ مَنْ رَبُّ السَّمَاوَاتِ وَالْأَرْضِ قُلِ اللَّهُ ۚ قُلْ أَفَاتَّخَذْتُمْ مِنْ دُونِهِ أَوْلِيَاءَ لَا يَمْلِكُونَ لِأَنْفُسِهِمْ نَفْعًا وَلَا ضَرًّا ۚ قُلْ هَلْ يَسْتَوِي الْأَعْمَىٰ وَالْبَصِيرُ أَمْ هَلْ تَسْتَوِي الظُّلُمَاتُ وَالنُّورُ ۗ أَمْ جَعَلُوا لِلَّهِ شُرَكَاءَ خَلَقُوا كَخَلْقِهِ فَتَشَابَهَ الْخَلْقُ عَلَيْهِمْ ۚ قُلِ اللَّهُ خَالِقُ كُلِّ شَيْءٍ وَهُوَ الْوَاحِدُ الْقَهَّارُ",
      "verseStringB": "Say: Who is the Lord of the heavens and the earth? Say: Allāh. Say: Do you then take besides Him, guardians who control no benefit or harm even for themselves? Say: Are the blind and the seeing alike? Or, are darkness and light equal? Or, have they set up with Allāh associates who have created creation like His, so that what is created became confused to them? Say: Allāh is the Creator of all things, and He is the One, the Supreme."
    },
    {
      "verseNumber": 17,
      "verseString": "أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَسَالَتْ أَوْدِيَةٌ بِقَدَرِهَا فَاحْتَمَلَ السَّيْلُ زَبَدًا رَابِيًا ۚ وَمِمَّا يُوقِدُونَ عَلَيْهِ فِي النَّارِ ابْتِغَاءَ حِلْيَةٍ أَوْ مَتَاعٍ زَبَدٌ مِثْلُهُ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ الْحَقَّ وَالْبَاطِلَ ۚ فَأَمَّا الزَّبَدُ فَيَذْهَبُ جُفَاءً ۖ وَأَمَّا مَا يَنْفَعُ النَّاسَ فَيَمْكُثُ فِي الْأَرْضِ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ الْأَمْثَالَ",
      "verseStringB": "He sends down water from the clouds, then watercourses flow according to their measure, and the torrent bears along the swelling foam. And from that which they melt in the fire for the sake of making ornaments or apparatusa arises a scum like it. Thus does Allāh compare truth and falsehood. Then as for the scum, it passes away as a worthless thing; and as for that which does good to men, it tarries in the earth. Thus does Allāh set forth parables.ᵇ"
    },
    {
      "verseNumber": 18,
      "verseString": "لِلَّذِينَ اسْتَجَابُوا لِرَبِّهِمُ الْحُسْنَىٰ ۚ وَالَّذِينَ لَمْ يَسْتَجِيبُوا لَهُ لَوْ أَنَّ لَهُمْ مَا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لَافْتَدَوْا بِهِ ۚ أُولَٰئِكَ لَهُمْ سُوءُ الْحِسَابِ وَمَأْوَاهُمْ جَهَنَّمُ ۖ وَبِئْسَ الْمِهَادُ",
      "verseStringB": "For those who respond to their Lord is good. And as for those who respond not to Him, even if they had all that is in the earth and the like thereof with it, they would certainly offer it for a ransom. As for those, theirs is an evil reckoning and their abode is hell; and evil is the resting-place."
    },
    {
      "verseNumber": 19,
      "verseString": "أَفَمَنْ يَعْلَمُ أَنَّمَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ الْحَقُّ كَمَنْ هُوَ أَعْمَىٰ ۚ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ",
      "verseStringB": "Is he who knows that what is revealed to thee from thy Lord is the truth like him who is blind? Only men of understanding mind —"
    },
    {
      "verseNumber": 20,
      "verseString": "الَّذِينَ يُوفُونَ بِعَهْدِ اللَّهِ وَلَا يَنْقُضُونَ الْمِيثَاقَ",
      "verseStringB": "Those who fulfil the pact of Allāh, and break not the covenant,"
    },
    {
      "verseNumber": 21,
      "verseString": "وَالَّذِينَ يَصِلُونَ مَا أَمَرَ اللَّهُ بِهِ أَنْ يُوصَلَ وَيَخْشَوْنَ رَبَّهُمْ وَيَخَافُونَ سُوءَ الْحِسَابِ",
      "verseStringB": "And those who join that which Allāh has bidden to be joineda and have awe of their Lord, and fear the evil reckoning."
    },
    {
      "verseNumber": 22,
      "verseString": "وَالَّذِينَ صَبَرُوا ابْتِغَاءَ وَجْهِ رَبِّهِمْ وَأَقَامُوا الصَّلَاةَ وَأَنْفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ أُولَٰئِكَ لَهُمْ عُقْبَى الدَّارِ",
      "verseStringB": "And those who are steadfasta seeking the pleasure of their Lord, and keep up prayer and spend of that which We have given them, secretly and openly, and repel evil with good;ᵇ for such is the (happy) issue of the abode —"
    },
    {
      "verseNumber": 23,
      "verseString": "جَنَّاتُ عَدْنٍ يَدْخُلُونَهَا وَمَنْ صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ ۖ وَالْمَلَائِكَةُ يَدْخُلُونَ عَلَيْهِمْ مِنْ كُلِّ بَابٍ",
      "verseStringB": "Gardens of perpetuity, which they will enter along with those who do good from among their fathers and their spousesa and their offspring; and the angels will enter in upon them from every gate."
    },
    {
      "verseNumber": 24,
      "verseString": "سَلَامٌ عَلَيْكُمْ بِمَا صَبَرْتُمْ ۚ فَنِعْمَ عُقْبَى الدَّارِ",
      "verseStringB": "Peace be to you, because you were constant — how excellent is then the fInᵃ l Abode!"
    },
    {
      "verseNumber": 25,
      "verseString": "وَالَّذِينَ يَنْقُضُونَ عَهْدَ اللَّهِ مِنْ بَعْدِ مِيثَاقِهِ وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَنْ يُوصَلَ وَيُفْسِدُونَ فِي الْأَرْضِ ۙ أُولَٰئِكَ لَهُمُ اللَّعْنَةُ وَلَهُمْ سُوءُ الدَّارِ",
      "verseStringB": "And those who break the covenant of Allāh after its confirmation, and cut asunder that which Allāh has ordered to be joined, and make mischief in the land, for them is the curse, and theirs is the evil end of the Abode."
    },
    {
      "verseNumber": 26,
      "verseString": "اللَّهُ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِرُ ۚ وَفَرِحُوا بِالْحَيَاةِ الدُّنْيَا وَمَا الْحَيَاةُ الدُّنْيَا فِي الْآخِرَةِ إِلَّا مَتَاعٌ",
      "verseStringB": "Allāh amplifies and straitens provision for whom He pleases. And they rejoice in this world’s life. And this world’s life, compared with the Hereafter, is only a temporary enjoyment. by his Lord? a Say: Allāh leaves in error whom He pleases, and guides to Himself those who turn (to Him)b —"
    },
    {
      "verseNumber": 27,
      "verseString": "وَيَقُولُ الَّذِينَ كَفَرُوا لَوْلَا أُنْزِلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ ۗ قُلْ إِنَّ اللَّهَ يُضِلُّ مَنْ يَشَاءُ وَيَهْدِي إِلَيْهِ مَنْ أَنَابَ",
      "verseStringB": ""
    },
    {
      "verseNumber": 28,
      "verseString": "الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
      "verseStringB": "Those who believe and whose hearts find rest in the remembrance of Allāh. Now surely in Allāh’s remembrance do hearts find rest."
    },
    {
      "verseNumber": 29,
      "verseString": "الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ طُوبَىٰ لَهُمْ وَحُسْنُ مَآبٍ",
      "verseStringB": "Those who believe and do good, a good fInᵃ l state is theirs and a goodly return.ᵃ"
    },
    {
      "verseNumber": 30,
      "verseString": "كَذَٰلِكَ أَرْسَلْنَاكَ فِي أُمَّةٍ قَدْ خَلَتْ مِنْ قَبْلِهَا أُمَمٌ لِتَتْلُوَ عَلَيْهِمُ الَّذِي أَوْحَيْنَا إِلَيْكَ وَهُمْ يَكْفُرُونَ بِالرَّحْمَٰنِ ۚ قُلْ هُوَ رَبِّي لَا إِلَٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ مَتَابِ",
      "verseStringB": "Thus We have sent thee among a nation before which other nations have passed away, that thou mightest recite to them what We have revealed to thee, and (still) they deny the Beneficent. Say: He is my Lord, there is no god but He; in Him do I trust and to Him is my return."
    },
    {
      "verseNumber": 31,
      "verseString": "وَلَوْ أَنَّ قُرْآنًا سُيِّرَتْ بِهِ الْجِبَالُ أَوْ قُطِّعَتْ بِهِ الْأَرْضُ أَوْ كُلِّمَ بِهِ الْمَوْتَىٰ ۗ بَلْ لِلَّهِ الْأَمْرُ جَمِيعًا ۗ أَفَلَمْ يَيْأَسِ الَّذِينَ آمَنُوا أَنْ لَوْ يَشَاءُ اللَّهُ لَهَدَى النَّاسَ جَمِيعًا ۗ وَلَا يَزَالُ الَّذِينَ كَفَرُوا تُصِيبُهُمْ بِمَا صَنَعُوا قَارِعَةٌ أَوْ تَحُلُّ قَرِيبًا مِنْ دَارِهِمْ حَتَّىٰ يَأْتِيَ وَعْدُ اللَّهِ ۚ إِنَّ اللَّهَ لَا يُخْلِفُ الْمِيعَادَ",
      "verseStringB": "And if there could be a Qur’ān with which the mountains were made to pass away, or the earth were cloven asunder, or the dead were made to speaka— nay, the commandment is wholly Allāh’s. Do not those who believe know that, if Allāh please, He would certainly guide all the people? And as for those who disbelieve, disaster will not cease to afflict them because of what they do, or it will alight close by their abodes, until the promise of Allāh come to pass. Surely Allāh will not fail in (His) promise."
    },
    {
      "verseNumber": 32,
      "verseString": "وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِنْ قَبْلِكَ فَأَمْلَيْتُ لِلَّذِينَ كَفَرُوا ثُمَّ أَخَذْتُهُمْ ۖ فَكَيْفَ كَانَ عِقَابِ",
      "verseStringB": "And messengers before thee were certainly mocked, but I gave respite to those who disbelieved, then I seized them. How (awful) was then My requital!"
    },
    {
      "verseNumber": 33,
      "verseString": "أَفَمَنْ هُوَ قَائِمٌ عَلَىٰ كُلِّ نَفْسٍ بِمَا كَسَبَتْ ۗ وَجَعَلُوا لِلَّهِ شُرَكَاءَ قُلْ سَمُّوهُمْ ۚ أَمْ تُنَبِّئُونَهُ بِمَا لَا يَعْلَمُ فِي الْأَرْضِ أَمْ بِظَاهِرٍ مِنَ الْقَوْلِ ۗ بَلْ زُيِّنَ لِلَّذِينَ كَفَرُوا مَكْرُهُمْ وَصُدُّوا عَنِ السَّبِيلِ ۗ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ",
      "verseStringB": "Is, then, He Who watches every soul as to what it earns —? a And yet they ascribe partners to Allāh! Say: Name them.ᵇ Would you inform Him of that which He knows not in the earth, or of an outward saying? c Rather, their plan is made fair-seeming to those who disbelieve,ᵈ and they are kept back from the path. And whom Allāh leaves in error, he has no guide."
    },
    {
      "verseNumber": 34,
      "verseString": "لَهُمْ عَذَابٌ فِي الْحَيَاةِ الدُّنْيَا ۖ وَلَعَذَابُ الْآخِرَةِ أَشَقُّ ۖ وَمَا لَهُمْ مِنَ اللَّهِ مِنْ وَاقٍ",
      "verseStringB": "For them is chastisement in this world’s life, and the chastisement of the Hereafter is certainly more grievous. And they have no protector against Allāh."
    },
    {
      "verseNumber": 35,
      "verseString": "مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ ۖ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۖ أُكُلُهَا دَائِمٌ وَظِلُّهَا ۚ تِلْكَ عُقْبَى الَّذِينَ اتَّقَوْا ۖ وَعُقْبَى الْكَافِرِينَ النَّارُ",
      "verseStringB": "A parable of the Garden which is promised to those who keep their duty:ᵃ Therein flow rivers. Its fruits are perpetual and its plenty.ᵇ Such is the end for those who keep their duty; and the end for the disbelievers is the Fire."
    },
    {
      "verseNumber": 36,
      "verseString": "وَالَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَفْرَحُونَ بِمَا أُنْزِلَ إِلَيْكَ ۖ وَمِنَ الْأَحْزَابِ مَنْ يُنْكِرُ بَعْضَهُ ۚ قُلْ إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ وَلَا أُشْرِكَ بِهِ ۚ إِلَيْهِ أَدْعُو وَإِلَيْهِ مَآبِ",
      "verseStringB": "And those to whom We have given the Booka rejoice in that which has been revealed to thee, and of the confederates are some who deny a part of it. Say: I am commanded only to serve Allāh and not associate anything with Him. To Him do I invite (you), and to Him is my return."
    },
    {
      "verseNumber": 37,
      "verseString": "وَكَذَٰلِكَ أَنْزَلْنَاهُ حُكْمًا عَرَبِيًّا ۚ وَلَئِنِ اتَّبَعْتَ أَهْوَاءَهُمْ بَعْدَمَا جَاءَكَ مِنَ الْعِلْمِ مَا لَكَ مِنَ اللَّهِ مِنْ وَلِيٍّ وَلَا وَاقٍ",
      "verseStringB": "And thus have We revealed it, a true judgment, in Arabic. And if thou follow their low desires after that which has come to thee of knowledge, thou wouldst have against Allāh no guardian nor protector."
    },
    {
      "verseNumber": 38,
      "verseString": "وَلَقَدْ أَرْسَلْنَا رُسُلًا مِنْ قَبْلِكَ وَجَعَلْنَا لَهُمْ أَزْوَاجًا وَذُرِّيَّةً ۚ وَمَا كَانَ لِرَسُولٍ أَنْ يَأْتِيَ بِآيَةٍ إِلَّا بِإِذْنِ اللَّهِ ۗ لِكُلِّ أَجَلٍ كِتَابٌ",
      "verseStringB": "And certainly We sent messengers before thee and appointed for them wives and children. And it is not in (the power of) a messenger to bring a sign except by Allāh’s permission. For every term there is an appointment.ᵃ"
    },
    {
      "verseNumber": 39,
      "verseString": "يَمْحُو اللَّهُ مَا يَشَاءُ وَيُثْبِتُ ۖ وَعِنْدَهُ أُمُّ الْكِتَابِ",
      "verseStringB": "Allāh effaces what He pleases and establishes (what He pleases),ᵃ and with Him is the basis of the Book.ᵇ"
    },
    {
      "verseNumber": 40,
      "verseString": "وَإِنْ مَا نُرِيَنَّكَ بَعْضَ الَّذِي نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ فَإِنَّمَا عَلَيْكَ الْبَلَاغُ وَعَلَيْنَا الْحِسَابُ",
      "verseStringB": "Whether We let thee see part of that which We promise them, or cause thee to die, thine is but the delivery of the message, and Ours to call (them) to account."
    },
    {
      "verseNumber": 41,
      "verseString": "أَوَلَمْ يَرَوْا أَنَّا نَأْتِي الْأَرْضَ نَنْقُصُهَا مِنْ أَطْرَافِهَا ۚ وَاللَّهُ يَحْكُمُ لَا مُعَقِّبَ لِحُكْمِهِ ۚ وَهُوَ سَرِيعُ الْحِسَابِ",
      "verseStringB": "See they not that We are visiting the land, curtailing it of its sides? a And Allāh pronounces a doom — there is no repeller of His decree. And He is Swift in calling to account."
    },
    {
      "verseNumber": 42,
      "verseString": "وَقَدْ مَكَرَ الَّذِينَ مِنْ قَبْلِهِمْ فَلِلَّهِ الْمَكْرُ جَمِيعًا ۖ يَعْلَمُ مَا تَكْسِبُ كُلُّ نَفْسٍ ۗ وَسَيَعْلَمُ الْكُفَّارُ لِمَنْ عُقْبَى الدَّارِ",
      "verseStringB": "And those before them planned indeed, but all planning is Allāh’s.ᵃ He knows what every soul earns. And the disbelievers will come to know for whom is the (good) end of the Abode."
    },
    {
      "verseNumber": 43,
      "verseString": "وَيَقُولُ الَّذِينَ كَفَرُوا لَسْتَ مُرْسَلًا ۚ قُلْ كَفَىٰ بِاللَّهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ وَمَنْ عِنْدَهُ عِلْمُ الْكِتَابِ",
      "verseStringB": "And those who disbelieve say: Thou art not a messenger. Say: Allāh is sufficient for a witness between me and you and whoever has knowledge of the Book"
    }
  ],
  "nameEnglish": "Thunder",
  "nameTrans": "ar-Ra'd",
  "nameArabic": "الرعد",
  "chapterNumber": 13,
  "nVerses": 43,
  "footnotes": [
    {
      "note": "1a. The letters are alif, standing for ana, meaning I, låm for Allåh, mßm for A‘lam,meaning the Best Knower, and rå for Rå’ß, meaning the Seer. /n/n 2a. All heavenly bodies are raised high without any pillars that man can see. Thosepillars are the laws of gravitation. All heavenly bodies, we are further told, run theircourse to an appointed term; they have a beginning and an end, as all things on earthhave a beginning and an end.  /n/n 4a. Unity in diversity is observable in the whole of nature, which is a sure sign of theUnity of the great Author of all existence. Besides this, as there is a difference in the produce of different tracts, though they are subject to the same laws of nature, even so are thehearts of men in relation to the growth of the seed of virtue, which is sown by revelation. /n/n 5a. The chains spoken of here are the chains which keep them constrained to evilusages and corrupt practices.  /n/n 6a. Mathulåt is the plural of muthlah, which means a punishment that comes downupon a man so that he is made an example by which another is restrained (R).  /n/n 6b. The Makkans were warned again and again, and they demanded that the threatened punishment should overtake them, but they are told that the Merciful God woulddeal with them not according to their iniquities, but according to His vast and comprehensive forgiveness. But when evil outsteps all bounds, His very mercy, which must beexercised towards His righteous servants, requires that the iniquitous should not be leftwithout punishment. Hence the Lord is also severe in requiting evil.  /n/n 7a. The words for every people a guide refer to the Holy Prophet. He was a warnerindeed; he warned the evildoers of the evil consequences of their evil deeds, but he wasultimately to be a guide for every people, to lead them out of their evil ways and to setthem on the right path. /n/n 8a. The wombs fall short of completion when no gestation takes place. The physicallaw of nature is spoken of here with a deeper reference to the spiritual law, according towhich some receive a new birth through the Prophet and others do not. The subject ismade clearer in the verses that follow. /n/n 10a. A general law is given expression to with a deeper reference to the secret andopen counsels against the Prophet and to enemies seeking his life by day and by night. Aperusal of the history of his life shows that those who sought his life sometimes followed him secretly, when he went out to pray during the early hours of the morning, andsometimes openly followed him in the daytime with an evil purpose. /n/n 11a. While the statement is no doubt general and refers to the guardian angelsreferred to in 6:61, there is a deeper allusion to the Divine protection specially vouchsafed to the Holy Prophet against the numerous enemies among whom he lived day andnight. Mu‘aqqibåt (sing. mu‘aqqib) is derived from ‘aqqaba, meaning he looked to theconsequence, or result of the affair (LL). The word may also be translated as meaningthose following one another. Such are the angels, who are mentioned as ƒafa˚ah orkeepers in 6:61, and as kiråm-an kåtibßn or honourable recorders in 82:11, 12. Theyguard the consequences of the deeds of man, and are therefore spoken of here as guarding him, i.e., guarding whatever he does, by Allåh’s command.  /n/n 15a. The recital of this verse is followed by actual prostration; see 7:206a /n/n 17a. Matå‘ includes here all kinds of things necessary for the life of man, such asutensils, tools, implements, and instruments of war (S).  /n/n 17b. The parable set forth here signifies that the Holy Prophet and his followers willlive and prosper, as they work for the good of man. On the other hand, evil practices andworthless usages and customs, as well as those who uphold them, will be swept awaybefore the mighty current of Truth, as rubbish is borne away by a torrent. /n/n 21a. While the previous verse deals with man’s duty to his Maker, this treats of therelations with His creatures. “What Allåh has bidden to be joined” includes all those tiesof love and relationship which Allåh has taught man to observe and keep inviolate. /n/n 22a. Patience in trials and sufferings is only one of the ideas which the word ©abrconveys. According to R, ©abr is the keeping oneself constrained to that which reasonor law requires, or the withholding from that from which it requires to withhold.  /n/n 22b. Evil is a thing which is by all means to be repelled, and hence good for evil is recommended only in cases when evil would be repelled by that good. Unconditionallyrequiting evil with good would abolish all safeguards; evildoers who received nothing butgood for every evil they committed would most assuredly establish a condition of anarchyby their evil deeds. Elsewhere it is said: whoever forgives and amends (42:40).  /n/n 23a. The Qur’ån is full of clear statements that women shall enjoy the bliss of paradise. Azwåj is the plural of zauj, which means either husband or wife, and hence I haverendered it as spouses or mates.  /n/n 27a. The answer to this question is given in the concluding words of the section:“disaster will not cease to afflict them because of what they do, or it will alight close bytheir abodes, until the promise of Allåh come to pass”. This promise related to the utterannihilation of the power of the disbelievers. The question why is not a sign sent downto him? here as elsewhere in the Holy Qur’ån, is really a demand for the promisedannihilation of their power and their vanquishment, and the answer is always conveyedin somewhat similar terms, stating first that they should ask for mercy; that the Qur’ånhas healing power, the condition of the faithful being a witness to it; that the fate of theformer generations affords a lesson; that smaller calamities continue to afflict them, andin these they can see the signs of their ultimate vanquishment; and that finally, if allthose tokens are rejected, the great calamity will not fail to overtake them.  /n/n 27b. The contrast with those who turn to God makes it clear that Allåh’s pleasure toleave some in error is exercised only in the case of those who, though invited to God, donot turn to Him but choose to remain in error. The first part may also be translated thus:Allåh leaves in error who will (remain in error) /n/n 29a. Ô∂bå, as an infinitive noun (from Δåba, meaning it became good), means agood final state or good future (LL). /n/n 31a. According to some, the words la-kåna hådha-l-Qur’ån are understood, i.e. it isthis Qur’ån (JB). But the answer is contained in what follows and there is no omissionhere. That the Qur’ån should work great wonders is not here treated as an impossibility,but rather as a fact, for we are immediately told that the commandment is wholly Allåh’s,which is equivalent to saying that it will be brought about soon by His commandment.At the time when these verses were revealed, difficulties in the spread of Islåm appearedlike mountains. Formidable opponents of the Prophet stood undoubtedly like impassablemountains — and they were given the name of jibål, or mountains, by the Arabs (LL) —in the way of the advance of Truth. That they were made to pass away is a matter ofhistory. The words quΔΔi‘at bi-hi-l-ar˙u may mean the earth were cloven asunder, bywhich is to be understood that the Qur’ån would go deep down into the hearts of men,which are compared here to the earth, which would thus be cloven asunder, with streamsand springs flowing in it. Another significance of the words is that the earth will betravelled over. There were no facilities at that time for going to distant corners ofArabia, to say nothing of the distant countries of the world. Yet so irresistible was theurge within the hearts of Muslims to deliver the message of Truth that not only was thewhole of Arabia travelled over by the message-bearers of Islåm within ten years afterthis in the Prophet’s lifetime, but within a hundred years after the Prophet, Islåm hadtraversed the whole of the known world, spreading from the farthest East in China to thefarthest West in Spain. As regards the last statement, the dead were made to speak, it isagain a matter of history. Men who were dead spiritually now spoke with such powerthat the whole earth from end to end responded to their call. See 6:122, where it is madeclear that by the dead in the terminology of the Qur’ån are sometimes meant the spiritually dead and by giving life is meant their spiritual quickening.  /n/n 33a. Allåh watches what everyone does, i.e. requites everyone for what he does —their alleged associate-gods are admittedly unable to do this. The answer to the question,Is He ...? is given in the words that follow, yet they ascribe partners to Allåh.  /n/n 33b. It is to show the utmost contempt for the alleged associates of the Divine Beingthat their worshippers are called upon to give them a name, as if it were said that theyare not worthy of a name. Or the meaning may be, give them a name expressing anyqualification of godhead, such as a sustainer, creator, etc.  /n/n 33c. The appeal is to the inner self of man. Is anything hidden from God? Is He notAware of the inmost feelings of man? Must there be a partner with God, who should tellHim of what He knows not? Are your outward sayings not known to Him, so that theremust be a partner to inform Him of what you say? He knows both the inner feelings ofman and his outward sayings, and He does not stand in need of a mediator.  /n/n 33d. It is the devil who makes the evil deeds fair-seeming to men; see 6:43, 16:63.And elsewhere it is made clear: “And the devil made their deeds fair-seeming to them,so he kept them back from the path” (29:38). /n/n 35a. It should be noted that the paradise mentioned here is called a parable, as alsoin 47:15. The reason is, as a saying of the Holy Prophet makes clear, that the blessingsof paradise are such as no eye has seen, nor has ear heard, nor has it entered into theheart of man to conceive of them (B. 59:8). Therefore, what it actually is cannot beknown to man, until he has tasted of its blessings; the description given in the Qur’ånbeing only a likeness of what it actually is, for an impression of a thing which is of anature entirely different from the things of this world can only be conveyed by parables. /n/n 35b. The word ˚ill has other meanings besides shade. It signifies mightiness, inaccessibility, ease, or plenty, (R). It also signifies protection (LL).  /n/n 36a. By the Book is meant the Qur’ån, as the context clearly shows. Some, however, take the Book to signify the previous revelation given to the Israelite prophets, andunderstand Jewish or Christian converts to Islåm to be meant here.  /n/n 38a. The significance is that the sign so often demanded will come at the appointedtime. The ultimate discomfiture of the power of the opponents had been prophesied inthe earliest revelations, hence the repeated demands. /n/n 39a. God was now going to efface falsehood and to establish the Truth. /n/n 39b. The same word, umm al-kitåb, occurs in 3:7, where the verses that are ofobvious import are called the basis of the Book, because allegorical verses must beinterpreted subject to the principles laid down in plain words. Here the Divine ordinanceto annihilate the power of the opponents of the Holy Prophet and to bring about theestablishment of the Truth is called the basis of the Book, because the final vanquishment of the powers of evil, which was previously foretold, would be such a clear signthat it would dispel all doubts. /n/n 41a. AΔråf signifies sides, as indicating the high and the low or exalted men (LL).The reference may be either to some of the exalted men having come over to Islåm andthe opposition being thus weakened, or to the diminution of the number of disbelievers,both high and low, by men daily leaving their ranks and joining the ranks of Islåm. /n/n 42a. The meaning is that the plans of the enemy need not be feared, for all their planning is controlled by Allåh, or that the requital of their plans is in the hands of Allåh.  /n/n 43a. The Book here stands for previous revelation from Allåh, and attention iscalled to the fact that all those who have any knowledge of previous revelation will testify to the truth of the revelation of the Qur’ån, because it fulfils all previous propheciesand satisfies the criteria of a true revelation."
    }
  ]
}
