{
  "verses": [
    {
      "verseNumber": 1,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "Praise be to Allāh, the Lordᵃ of the worlds,ᵇ"
    },
    {
      "verseNumber": 2,
      "verseString": "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
      "verseStringB": "The Beneficent, the Merciful,"
    },
    {
      "verseNumber": 3,
      "verseString": "الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "Masterᵃ of the day of Requital.ᵇ"
    },
    {
      "verseNumber": 4,
      "verseString": "مَالِكِ يَوْمِ الدِّينِ",
      "verseStringB": "Thee do we serve and Thee do we beseech for help.ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ",
      "verseStringB": "Guide us onᵃ the right path,"
    },
    {
      "verseNumber": 6,
      "verseString": "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ",
      "verseStringB": "The path of those upon whom Thou hast bestowed favours,ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ",
      "verseStringB": "Not those upon whom wrath is brought down, nor those who go astray.ᵃ"
    }
  ],
  "nameEnglish": "The Opening",
  "nameTrans": "al-Fatihah",
  "nameArabic": "الفاتحة",
  "chapterNumber": 1,
  "nVerses": 7,
  "footnotes": [
    {
      "note": "a. I retain the ordinary translation of the particle bå, but I must warn the reader that    the sense of this particle is not the same in Arabic as the sense of the word in in the    equivalent phrase in the name of God. In, in the latter case, signifies on account of,    whereas the bå in Arabic signifies by, or through, or, to be more exact, with the    assistance of. The phrase is in fact equivalent to: I seek the assistance of Allåh, the    Beneficent, the Merciful (AH). Hence it is that a Muslim is required to begin every    important affair with Bismillåh. \n\n    b. Allåh, according to the most correct of the opinions respecting it, is a proper    name applied to the Being Who exists necessarily by Himself, comprising all the    attributes of perfection (T-LL), the al being inseparable from it, not derived (Msb-LL).    Al-ilåh is a different word, and Allåh is not a contraction of al-ilåh. The word Allåh is    not applied to any being except the only true God, and comprises all the excellent    names, and the Arabs never gave the name Allåh to any of their numerous idols. Hence,    as being the proper name of the Divine Being and not having any equivalent in any other    language, I have adopted the original word in this translation. \n\n    c. Ra√mån and Ra√ßm are both derived from ra√mat, signifying tenderness requiring    the exercise of beneficence (R), and thus comprising the ideas of love and mercy. AlRa√mån and al-Ra√ßm are both active participle nouns of different measures denoting    intensiveness of significance, the former being of the measure of fa‘lån and indicating the    greatest preponderance of the quality of mercy, and the latter being of the measure of fa‘ßl    and being expressive of a constant repetition and manifestation of the attribute (AH). The    Prophet is reported to have said: “Al-Ra√mån is the Beneficent God Whose love and    mercy are manifested in the creation of this world, and al-Ra√ßm is the Merciful God    Whose love and mercy are manifested in the state that comes after” (AH), i.e. in the consequences of the deeds of men. Thus the former is expressive of the utmost degree of love    and generosity, the latter of unbounded and constant favour and mercy. Lexicologists    agree in holding that the former includes both the believer and the unbeliever for its    objects, while the latter relates specially to the believer (LL). Hence I render al-Ra√mån as    meaning the Beneficent, because the idea of doing good is predominant in it, though I must    admit that the English language lacks an equivalent of al-Ra√mån. \n\n    1a. The Arabic word Rabb conveys not only the idea of fostering, bringing-up, or    nourishing but also that of regulating, completing and accomplishing (T-LL), i.e., of the    evolution of things from the crudest state to that of the highest perfection. According to    R, Rabb signifies the fostering of a thing in such a manner as to make it attain one    condition after another until it reaches its goal of completion. Hence Rabb is the Author    of all existence, Who has not only given to the whole creation its means of nourishment    but has also beforehand ordained for each a sphere of capacity and within that sphere    provided the means by which it continues to attain gradually to its goal of perfection. By    the use of the word Rabb the Holy Qur’ån thus hints at the law of evolution which is    working in the universe. There is no single word in English carrying the significance of    the word Rabb — Nourisher unto perfection would be nearest; but the word Lord has    generally been adopted for the sake of brevity. Rabb or Nourisher to perfection, how -    ever, includes both the physical and spiritual sides so far as man is concerned, His Word    being the spiritual nourishment through which man is brought to perfection. \n\n    1b. The word translated as worlds is ‘ålamßn, which is plural of ‘ålam (from the root    ‘ilm, to know), indicating literally that by means of which one knows a thing, and hence    it signifies world or creation, because by it the Creator is known. In a restricted sense it    is applied to any class or division of created beings or of mankind (LL). Hence ‘ålamßn    has been translated as “nations” in 2: 47 and elsewhere. The all-comprehensiveness of    the Lordship of Allåh in the very first words of the Qur’ån is quite in consonance with    the cosmopolitan nature of the religion of Islåm, which requires an admission of the    truth of the prophets of all nations. \n\n    3a. English translations have usually adopted King as the translation of the word    Målik, which is not correct. Målik and malik are two different words from the same root,    the former signifying master and the latter king. According to the rule of forming    derivations in Arabic, an additional letter (as the alif in Målik) gives the meaning a    greater intensity (AH), and hence a master is more than a king. The adoption of the word    målik or master is to show that Allåh is not guilty of injustice if He forgives His servants, because He is not a mere king or a mere judge, but more properly a Master.\n\n    3b. The word yaum is applied in the Holy Qur’ån to any period of time, from a    moment (55: 29) to fifty thousand years (70: 4), and may therefore indicate an indefinitely    small or indefinitely large space of time. According to LL, yaum is a time, whether day    or night, time absolutely, whether night or not, little or not; also a day, meaning the period from the rising of the sun to its setting. According to R, the word yaum indicates a    period of time, whatever period it may be, and this is the proper signification. As there    are ample indications in the Qur’ån that the Divine law of requital is working every    moment, and there is nothing to support the idea that it will not come into force before a    particular day, the law of requital referred to in this verse is therefore a law which is    constantly at work, the day of Judgment being the day of complete manifestation of it.    Master of the day of Requital in fact stands for Master of the law of Requital, as that law    is working every moment.    The word dßn means both requital and religion, being derived from dåna, he recompensed, judged, obeyed (LL). In describing God as Master of the day of Requital, the    Holy Qur’ån lays stress, on the one hand, on the fact that the Divine law of requital of    deeds is working every moment, and thus makes man feel the responsibility of what he    does, and gives prominence, on the other, to the quality of forgiveness in Divine nature    so that the law of requital is not like a rigid law of nature but like the dealing of a Master    Who is essentially merciful, as already described. In speaking of the law of requital after    the two great attributes of beneficence and mercy, the aim is to show that requital is as    essential a Divine attribute to bring humanity to perfection as the attributes of beneficence and mercy. Beneficence is exercised towards the whole of humanity, mercy    towards those who accept the Truth, and through requital are brought to perfection those    who do not accept the Truth. Their punishment sometimes takes the form of distress and    affliction in this life but it will receive a final shape on the day of Judgment. Both the    afflictions of this life and the hell of the Hereafter are really remedial measures to exterminate spiritual diseases, and awaken spiritual life in man.It may be further noted that God may also be said to be the Master of the day of    Religion, in the sense that spiritual awakening will gradually be brought about in the    world, so that ultimately the majority of people will recognize the truth of religion. The    law of evolution is, in fact, working spiritually as it is working physically in this vast    creation.\n\n    4a. The first three verses of this s∂rah speak of the grandeur of God and the last    three of the aspiration of man’s soul to attain spiritual loftiness, while this, the middle    verse, speaks of the relation of the spirit of man to the Divine Spirit. Here the way is    pointed out through which man can attain to real greatness. It is through ‘ibådat of God    which means obedience (Δå‘at) combined with complete humility (khud∂‘) (R), and    through isti‘ånat, or seeking help (‘aun) from God. The idea of ‘ibådat (service or    worship) in Islåm is not a mere declaration of the glory of God, but the imbibing of    Divine morals and receiving their impress through humble service to God; hence the    prayer for Divine help.\n\n5a. Hidåyat (guidance) means not only showing the way but also leading one on the    right way till one reaches the goal. This is the significance here. Through Divine help    man seeks to be guided in the right path until he reaches his goal of perfection. Man    indeed stands in need of guidance and light from God in his everyday life affairs and is    therefore taught to look for light in the right direction, for light from God. But he needs    this light in a greater degree for attaining to the great spiritual goal. What that goal is, is    stated in the next verse.\n\n6a. Those upon whom favours are bestowed are according to I‘Ab the four classes    mentioned in 4:69, viz., the prophets, the truthful, the faithful and the righteous (AH). It    is in the footsteps of these spiritual leaders of the world that the Muslim aspires to walk,    the chief aim of his life thus being not only his own spiritual perfection but to try also,    and lay down his very life, for the spiritual perfection of others. He thus also prays for    the Divine favours which were vouchsafed to the righteous in the uprooting of evil and    establishing good in the world. It further shows that according to the Holy Qur’ån the    favours that were bestowed upon the prophets — the gift of Divine revelation being one    of them — can still be bestowed upon the righteous who follow the right way. It should,    however, be borne in mind that prophethood and revelation are two different things,    because the gift of revelation was, according to the express teachings of the Holy    Qur’ån, granted to others than prophets as well; as, for instance, to the mother of Moses    (20:38) and to the disciples of Jesus Christ (5:111). This gift of revelation or being    spoken to by God, according to most authentic √adßth, will be granted to the righteous    among the Holy Prophet’s followers — there will be among them men to whom God will    speak though they would not be prophets (B. 62:6).\n\n7a. The Muslims are warned here that even after receiving Divine favours they may    incur Divine displeasure and go astray from the path which leads to the goal of perfection, and this is what the prayer of v. 7 aims at. The Holy Qur’ån speaks of the Jews as    incurring Divine displeasure (2:61, 90; 3:112; 5:60) and it speaks of the Christians as    having gone astray (5:77), and the Prophet is reported to have said: “Those upon whom    wrath is brought down are the Jews and those who went astray are the Christians” (Tr.    44:2). Of course, the words are only explanatory and do not limit the significance of the    original words used. The Jews afford an example of a people failing in righteous deeds,    in carrying out the spirit of the doctrine while retaining the doctrine, and the Christians    an example of a people corrupting the doctrine itself, and both these are the pitfalls of a    people to whom the right direction has been pointed out. Again, the Jews and the    Christians afford an example of the two extremes, the Jews rejecting Jesus, a prophet of    God, as a liar, and doing their utmost to slay him, and the Christians raising a mortal    prophet to the dignity of Godhead. The Muslims are thus taught a prayer that they may    neither fail in good deeds while retaining the letter of the law, nor corrupt the doctrine,    and that they may be kept on the middle path, avoiding either extreme."
    }
  ]
}
