{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمْ ۚ إِنَّ زَلْزَلَةَ السَّاعَةِ شَيْءٌ عَظِيمٌ",
      "verseStringB": "O people, keep your duty to your Lord; surely the shocka of the Hour is a grievous thing.ᵇ"
    },
    {
      "verseNumber": 2,
      "verseString": "يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّا أَرْضَعَتْ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَى النَّاسَ سُكَارَىٰ وَمَا هُمْ بِسُكَارَىٰ وَلَٰكِنَّ عَذَابَ اللَّهِ شَدِيدٌ",
      "verseStringB": "The day you see it, every woman giving suck will forget her suckling and every pregnant one will lay down her burden, and thou wilt see men as drunken, yet they will not be drunken, but the chastisement of Allāh will be severe."
    },
    {
      "verseNumber": 3,
      "verseString": "وَمِنَ النَّاسِ مَنْ يُجَادِلُ فِي اللَّهِ بِغَيْرِ عِلْمٍ وَيَتَّبِعُ كُلَّ شَيْطَانٍ مَرِيدٍ",
      "verseStringB": "And among men is he who disputes about Allāh without knowledge, and follows every rebellious devila—"
    },
    {
      "verseNumber": 4,
      "verseString": "كُتِبَ عَلَيْهِ أَنَّهُ مَنْ تَوَلَّاهُ فَأَنَّهُ يُضِلُّهُ وَيَهْدِيهِ إِلَىٰ عَذَابِ السَّعِيرِ",
      "verseStringB": "For him it is written that whoever takes him for a friend, he will lead him astray and conduct him to the chastisement of the burning Fire."
    },
    {
      "verseNumber": 5,
      "verseString": "يَا أَيُّهَا النَّاسُ إِنْ كُنْتُمْ فِي رَيْبٍ مِنَ الْبَعْثِ فَإِنَّا خَلَقْنَاكُمْ مِنْ تُرَابٍ ثُمَّ مِنْ نُطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ مِنْ مُضْغَةٍ مُخَلَّقَةٍ وَغَيْرِ مُخَلَّقَةٍ لِنُبَيِّنَ لَكُمْ ۚ وَنُقِرُّ فِي الْأَرْحَامِ مَا نَشَاءُ إِلَىٰ أَجَلٍ مُسَمًّى ثُمَّ نُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوا أَشُدَّكُمْ ۖ وَمِنْكُمْ مَنْ يُتَوَفَّىٰ وَمِنْكُمْ مَنْ يُرَدُّ إِلَىٰ أَرْذَلِ الْعُمُرِ لِكَيْلَا يَعْلَمَ مِنْ بَعْدِ عِلْمٍ شَيْئًا ۚ وَتَرَى الْأَرْضَ هَامِدَةً فَإِذَا أَنْزَلْنَا عَلَيْهَا الْمَاءَ اهْتَزَّتْ وَرَبَتْ وَأَنْبَتَتْ مِنْ كُلِّ زَوْجٍ بَهِيجٍ",
      "verseStringB": "O people, if you are in doubt about the Resurrection,ᵃ then surely We created you from dust,ᵇ then from a small life-germ, then from a clot, then from a lump of flesh, complete in make and incomplete, that We may make clear to you.ᶜ And We cause what We please to remain in the wombs till an appointed time, then We bring you forth as babies, then that you may attain your maturity. And of you is he who is caused to die, and of you is he who is brought back to the worst part of life,ᵈ so that after knowledge he knows nothing. And thou seest the earth barren, but when We send down thereon water, it stirs and swells and brings forth a beautiful (growth) of every kind.ᵉ"
    },
    {
      "verseNumber": 6,
      "verseString": "ذَٰلِكَ بِأَنَّ اللَّهَ هُوَ الْحَقُّ وَأَنَّهُ يُحْيِي الْمَوْتَىٰ وَأَنَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "That is because Allāh, He is the Truth, and He gives life to the dead, and He is Possessor of power over all things,"
    },
    {
      "verseNumber": 7,
      "verseString": "وَأَنَّ السَّاعَةَ آتِيَةٌ لَا رَيْبَ فِيهَا وَأَنَّ اللَّهَ يَبْعَثُ مَنْ فِي الْقُبُورِ",
      "verseStringB": "And the Hour is coming, there is no doubt about it; and Allāh will raise up those who are in the graves.ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "وَمِنَ النَّاسِ مَنْ يُجَادِلُ فِي اللَّهِ بِغَيْرِ عِلْمٍ وَلَا هُدًى وَلَا كِتَابٍ مُنِيرٍ",
      "verseStringB": "And among men is he who disputes about Allāh without knowledge, and without guidance, and without an illumInᵃ ting Book,"
    },
    {
      "verseNumber": 9,
      "verseString": "ثَانِيَ عِطْفِهِ لِيُضِلَّ عَنْ سَبِيلِ اللَّهِ ۖ لَهُ فِي الدُّنْيَا خِزْيٌ ۖ وَنُذِيقُهُ يَوْمَ الْقِيَامَةِ عَذَابَ الْحَرِيقِ",
      "verseStringB": "Turning away haughtilya to lead men astray from the way of Allāh. For him is disgrace in this world, and on the day of Resurrection We shall make him taste the punishment of burning."
    },
    {
      "verseNumber": 10,
      "verseString": "ذَٰلِكَ بِمَا قَدَّمَتْ يَدَاكَ وَأَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِلْعَبِيدِ",
      "verseStringB": "This is for that which thy two hands have sent before, and Allāh is not in the least unjust to the servants."
    },
    {
      "verseNumber": 11,
      "verseString": "وَمِنَ النَّاسِ مَنْ يَعْبُدُ اللَّهَ عَلَىٰ حَرْفٍ ۖ فَإِنْ أَصَابَهُ خَيْرٌ اطْمَأَنَّ بِهِ ۖ وَإِنْ أَصَابَتْهُ فِتْنَةٌ انْقَلَبَ عَلَىٰ وَجْهِهِ خَسِرَ الدُّنْيَا وَالْآخِرَةَ ۚ ذَٰلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ",
      "verseStringB": "And among men is he who serves Allāh, (standing) on the verge,ᵃ so that if good befalls him he is satisfied therewith, but if a trial afflicts him he turns back headlong. He loses this world and the Hereafter. That is a manifest loss."
    },
    {
      "verseNumber": 12,
      "verseString": "يَدْعُو مِنْ دُونِ اللَّهِ مَا لَا يَضُرُّهُ وَمَا لَا يَنْفَعُهُ ۚ ذَٰلِكَ هُوَ الضَّلَالُ الْبَعِيدُ",
      "verseStringB": "He calls besides Allāh on that which harms him not, nor benefits him; that is straying far."
    },
    {
      "verseNumber": 13,
      "verseString": "يَدْعُو لَمَنْ ضَرُّهُ أَقْرَبُ مِنْ نَفْعِهِ ۚ لَبِئْسَ الْمَوْلَىٰ وَلَبِئْسَ الْعَشِيرُ",
      "verseStringB": "He calls on him whose harm is nearer than his benefit. Certainly an evil guardian and an evil associate!"
    },
    {
      "verseNumber": 14,
      "verseString": "إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۚ إِنَّ اللَّهَ يَفْعَلُ مَا يُرِيدُ",
      "verseStringB": "Surely Allāh causes those who believe and do good deeds to enter Gardens wherein flow rivers. Allāh indeed does what He pleases."
    },
    {
      "verseNumber": 15,
      "verseString": "مَنْ كَانَ يَظُنُّ أَنْ لَنْ يَنْصُرَهُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ فَلْيَمْدُدْ بِسَبَبٍ إِلَى السَّمَاءِ ثُمَّ لْيَقْطَعْ فَلْيَنْظُرْ هَلْ يُذْهِبَنَّ كَيْدُهُ مَا يَغِيظُ",
      "verseStringB": "Whoever thinks that Allāh will not assist him in this life and the Hereafter, let him raise (himself) by some means to the heaven, then let him cut (it) off, then let him see if his plan will take away that at which he is enraged.ᵃ"
    },
    {
      "verseNumber": 16,
      "verseString": "وَكَذَٰلِكَ أَنْزَلْنَاهُ آيَاتٍ بَيِّنَاتٍ وَأَنَّ اللَّهَ يَهْدِي مَنْ يُرِيدُ",
      "verseStringB": "And thus have We revealed it, clear arguments, and Allāh guides whom He will."
    },
    {
      "verseNumber": 17,
      "verseString": "إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا وَالصَّابِئِينَ وَالنَّصَارَىٰ وَالْمَجُوسَ وَالَّذِينَ أَشْرَكُوا إِنَّ اللَّهَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيَامَةِ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ",
      "verseStringB": "Those who believe and those who are Jews and the Sabians and the Christians and the Magians and the polytheists — surely Allāh will decide between them on the day of Resurrection. Surely Allāh is Witness over all things.ᵃ"
    },
    {
      "verseNumber": 18,
      "verseString": "أَلَمْ تَرَ أَنَّ اللَّهَ يَسْجُدُ لَهُ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ وَالشَّمْسُ وَالْقَمَرُ وَالنُّجُومُ وَالْجِبَالُ وَالشَّجَرُ وَالدَّوَابُّ وَكَثِيرٌ مِنَ النَّاسِ ۖ وَكَثِيرٌ حَقَّ عَلَيْهِ الْعَذَابُ ۗ وَمَنْ يُهِنِ اللَّهُ فَمَا لَهُ مِنْ مُكْرِمٍ ۚ إِنَّ اللَّهَ يَفْعَلُ مَا يَشَاءُ ۩",
      "verseStringB": "Seest thou not that to Allāh makes submission whoever is in the heavens and whoever is in the earth, and the sun and the moon and the stars, and the mountains and the trees, and the animals and many of the people? And many there are to whom chastisement is due. And he whom Allāh abases, none can give him honour. Surely Allāh does what He pleases.ᵃ"
    },
    {
      "verseNumber": 19,
      "verseString": "هَٰذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ ۖ فَالَّذِينَ كَفَرُوا قُطِّعَتْ لَهُمْ ثِيَابٌ مِنْ نَارٍ يُصَبُّ مِنْ فَوْقِ رُءُوسِهِمُ الْحَمِيمُ",
      "verseStringB": "These are two adversariesa who dispute about their Lord. So those who disbelieve, for them are cut out garments of fire. Boiling water will be poured out over their heads."
    },
    {
      "verseNumber": 20,
      "verseString": "يُصْهَرُ بِهِ مَا فِي بُطُونِهِمْ وَالْجُلُودُ",
      "verseStringB": "With it will be melted what is in their bellies and (their) skins as well."
    },
    {
      "verseNumber": 21,
      "verseString": "وَلَهُمْ مَقَامِعُ مِنْ حَدِيدٍ",
      "verseStringB": "And for them are whips of iron.ᵃ"
    },
    {
      "verseNumber": 22,
      "verseString": "كُلَّمَا أَرَادُوا أَنْ يَخْرُجُوا مِنْهَا مِنْ غَمٍّ أُعِيدُوا فِيهَا وَذُوقُوا عَذَابَ الْحَرِيقِ",
      "verseStringB": "Whenever they desire to go forth from it, from grief,ᵃ they are turned back into it, and (it is said): Taste the chastisement of burning."
    },
    {
      "verseNumber": 23,
      "verseString": "إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِنْ ذَهَبٍ وَلُؤْلُؤًا ۖ وَلِبَاسُهُمْ فِيهَا حَرِيرٌ",
      "verseStringB": "Surely Allāh will make those who believe and do good deeds enter Gardens wherein flow rivers — they are adorned therein with bracelets of gold and (with) pearls. And their garments therein are of silk.ᵃ"
    },
    {
      "verseNumber": 24,
      "verseString": "وَهُدُوا إِلَى الطَّيِّبِ مِنَ الْقَوْلِ وَهُدُوا إِلَىٰ صِرَاطِ الْحَمِيدِ",
      "verseStringB": "And they are guided to pure words, and they are guided to the path of the Praised One."
    },
    {
      "verseNumber": 25,
      "verseString": "إِنَّ الَّذِينَ كَفَرُوا وَيَصُدُّونَ عَنْ سَبِيلِ اللَّهِ وَالْمَسْجِدِ الْحَرَامِ الَّذِي جَعَلْنَاهُ لِلنَّاسِ سَوَاءً الْعَاكِفُ فِيهِ وَالْبَادِ ۚ وَمَنْ يُرِدْ فِيهِ بِإِلْحَادٍ بِظُلْمٍ نُذِقْهُ مِنْ عَذَابٍ أَلِيمٍ",
      "verseStringB": "Those who disbelieve and hinder (men) from Allāh’s way and from the Sacred Mosque, which We have made equally for all men, (for) the dweller therein and the visitor.ᵃ And whoever inclines therein to wrong, unjustly, We shall make him taste of painful chastisement."
    },
    {
      "verseNumber": 26,
      "verseString": "وَإِذْ بَوَّأْنَا لِإِبْرَاهِيمَ مَكَانَ الْبَيْتِ أَنْ لَا تُشْرِكْ بِي شَيْئًا وَطَهِّرْ بَيْتِيَ لِلطَّائِفِينَ وَالْقَائِمِينَ وَالرُّكَّعِ السُّجُودِ",
      "verseStringB": "And when We pointed to Abraham the place of the House, saying: Associate naught with Me, and purify My House for those who make circuits and stand to pray and bow and prostrate themselves."
    },
    {
      "verseNumber": 27,
      "verseString": "وَأَذِّنْ فِي النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجَالًا وَعَلَىٰ كُلِّ ضَامِرٍ يَأْتِينَ مِنْ كُلِّ فَجٍّ عَمِيقٍ",
      "verseStringB": "And proclaim to men the Pilgrimage:ᵃ they will come to thee on foot and on every lean camel, coming from every remote path:ᵇ"
    },
    {
      "verseNumber": 28,
      "verseString": "لِيَشْهَدُوا مَنَافِعَ لَهُمْ وَيَذْكُرُوا اسْمَ اللَّهِ فِي أَيَّامٍ مَعْلُومَاتٍ عَلَىٰ مَا رَزَقَهُمْ مِنْ بَهِيمَةِ الْأَنْعَامِ ۖ فَكُلُوا مِنْهَا وَأَطْعِمُوا الْبَائِسَ الْفَقِيرَ",
      "verseStringB": "That they may witness benefits (provided) for them, and mention the name of Allāh on appointed days over what He has given them of the cattle quadrupeds; then eat of them and feed the distressed one, the needy.ᵃ"
    },
    {
      "verseNumber": 29,
      "verseString": "ثُمَّ لْيَقْضُوا تَفَثَهُمْ وَلْيُوفُوا نُذُورَهُمْ وَلْيَطَّوَّفُوا بِالْبَيْتِ الْعَتِيقِ",
      "verseStringB": "Then let them accomplish their needful acts of cleansing, and let them fulfil their vows and go round the Ancient House.ᵃ"
    },
    {
      "verseNumber": 30,
      "verseString": "ذَٰلِكَ وَمَنْ يُعَظِّمْ حُرُمَاتِ اللَّهِ فَهُوَ خَيْرٌ لَهُ عِنْدَ رَبِّهِ ۗ وَأُحِلَّتْ لَكُمُ الْأَنْعَامُ إِلَّا مَا يُتْلَىٰ عَلَيْكُمْ ۖ فَاجْتَنِبُوا الرِّجْسَ مِنَ الْأَوْثَانِ وَاجْتَنِبُوا قَوْلَ الزُّورِ",
      "verseStringB": "That (shall be so). And whoever respects the sacred ordInᵃ nces of Allāh, it is good for him with his Lord. And the cattle are made lawful for you, except that which is recited to you, so shun the filth of the idols and shun false words,"
    },
    {
      "verseNumber": 31,
      "verseString": "حُنَفَاءَ لِلَّهِ غَيْرَ مُشْرِكِينَ بِهِ ۚ وَمَنْ يُشْرِكْ بِاللَّهِ فَكَأَنَّمَا خَرَّ مِنَ السَّمَاءِ فَتَخْطَفُهُ الطَّيْرُ أَوْ تَهْوِي بِهِ الرِّيحُ فِي مَكَانٍ سَحِيقٍ",
      "verseStringB": "Being upright for Allāh, not associating aught with Him. And whoever associates (aught) with Allāh, it is as if he had fallen from on high, then the birds had snatched him away, or the wind had carried him off to a distant place."
    },
    {
      "verseNumber": 32,
      "verseString": "ذَٰلِكَ وَمَنْ يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِنْ تَقْوَى الْقُلُوبِ",
      "verseStringB": "That (shall be so). And whoever respects the ordInᵃ nces of Allāh, this is surely from the piety of hearts."
    },
    {
      "verseNumber": 33,
      "verseString": "لَكُمْ فِيهَا مَنَافِعُ إِلَىٰ أَجَلٍ مُسَمًّى ثُمَّ مَحِلُّهَا إِلَى الْبَيْتِ الْعَتِيقِ",
      "verseStringB": "Therein are benefits for you for a term appointed, then their place of sacrifice is the Ancient House."
    },
    {
      "verseNumber": 34,
      "verseString": "وَلِكُلِّ أُمَّةٍ جَعَلْنَا مَنْسَكًا لِيَذْكُرُوا اسْمَ اللَّهِ عَلَىٰ مَا رَزَقَهُمْ مِنْ بَهِيمَةِ الْأَنْعَامِ ۗ فَإِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ فَلَهُ أَسْلِمُوا ۗ وَبَشِّرِ الْمُخْبِتِينَ",
      "verseStringB": "And for every nation We appointed acts of devotion that they might mention the name of Allāh on what He has given them of the cattle quadrupeds. So your God is One God, therefore to Him should you submit. And give good news to the humble,ᵃ"
    },
    {
      "verseNumber": 35,
      "verseString": "الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ وَالصَّابِرِينَ عَلَىٰ مَا أَصَابَهُمْ وَالْمُقِيمِي الصَّلَاةِ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ",
      "verseStringB": "Whose hearts tremble when Allāh is mentioned, and who are patient in their afflictions, and who keep up prayer, and spend of what We have given them.ᵃ"
    },
    {
      "verseNumber": 36,
      "verseString": "وَالْبُدْنَ جَعَلْنَاهَا لَكُمْ مِنْ شَعَائِرِ اللَّهِ لَكُمْ فِيهَا خَيْرٌ ۖ فَاذْكُرُوا اسْمَ اللَّهِ عَلَيْهَا صَوَافَّ ۖ فَإِذَا وَجَبَتْ جُنُوبُهَا فَكُلُوا مِنْهَا وَأَطْعِمُوا الْقَانِعَ وَالْمُعْتَرَّ ۚ كَذَٰلِكَ سَخَّرْنَاهَا لَكُمْ لَعَلَّكُمْ تَشْكُرُونَ",
      "verseStringB": "And the camels, We have made them of the signs appointed by Allāh for youa — for you therein is much good. So mention the name of Allāh on them standing in a row. Then when they fall down on their sides, eat of them and feed the contented one and the beggar.ᵇ Thus have We made them subservient to you that you may be grateful."
    },
    {
      "verseNumber": 37,
      "verseString": "لَنْ يَنَالَ اللَّهَ لُحُومُهَا وَلَا دِمَاؤُهَا وَلَٰكِنْ يَنَالُهُ التَّقْوَىٰ مِنْكُمْ ۚ كَذَٰلِكَ سَخَّرَهَا لَكُمْ لِتُكَبِّرُوا اللَّهَ عَلَىٰ مَا هَدَاكُمْ ۗ وَبَشِّرِ الْمُحْسِنِينَ",
      "verseStringB": "Not their flesh, nor their blood, reaches Allāh, but to Him is acceptable observance of duty on your part.ᵃ Thus has He made them subservient to you, that you may magnify Allāh for guiding you aright. And give good news to those who do good (to others)."
    },
    {
      "verseNumber": 38,
      "verseString": "إِنَّ اللَّهَ يُدَافِعُ عَنِ الَّذِينَ آمَنُوا ۗ إِنَّ اللَّهَ لَا يُحِبُّ كُلَّ خَوَّانٍ كَفُورٍ",
      "verseStringB": "Surely Allāh defends those who believe. Surely Allāh loves not anyone who is unfaithful, ungrateful.ᵃ"
    },
    {
      "verseNumber": 39,
      "verseString": "أُذِنَ لِلَّذِينَ يُقَاتَلُونَ بِأَنَّهُمْ ظُلِمُوا ۚ وَإِنَّ اللَّهَ عَلَىٰ نَصْرِهِمْ لَقَدِيرٌ",
      "verseStringB": "Permission (to fight) is given to those on whom war is made, because they are oppressed. And surely Allāh is Able to assist thema—"
    },
    {
      "verseNumber": 40,
      "verseString": "الَّذِينَ أُخْرِجُوا مِنْ دِيَارِهِمْ بِغَيْرِ حَقٍّ إِلَّا أَنْ يَقُولُوا رَبُّنَا اللَّهُ ۗ وَلَوْلَا دَفْعُ اللَّهِ النَّاسَ بَعْضَهُمْ بِبَعْضٍ لَهُدِّمَتْ صَوَامِعُ وَبِيَعٌ وَصَلَوَاتٌ وَمَسَاجِدُ يُذْكَرُ فِيهَا اسْمُ اللَّهِ كَثِيرًا ۗ وَلَيَنْصُرَنَّ اللَّهُ مَنْ يَنْصُرُهُ ۗ إِنَّ اللَّهَ لَقَوِيٌّ عَزِيزٌ",
      "verseStringB": "Those who are driven from their homes without a just cause except that they say: Our Lord is Allāh. And if Allāh did not repel some people by others, cloisters, and churches, and synagogues, and mosques in which Allāh’s name is much remembered, would have been pulled down. And surely Allāh will help him who helps Him. Surely Allāh is Strong, Mighty.ᵃ"
    },
    {
      "verseNumber": 41,
      "verseString": "الَّذِينَ إِنْ مَكَّنَّاهُمْ فِي الْأَرْضِ أَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ وَأَمَرُوا بِالْمَعْرُوفِ وَنَهَوْا عَنِ الْمُنْكَرِ ۗ وَلِلَّهِ عَاقِبَةُ الْأُمُورِ",
      "verseStringB": "Those who, if We establish them in the land, will keep up prayer and pay the poor-rate and enjoin good and forbid evil. And Allāh’s is the end of affairs."
    },
    {
      "verseNumber": 42,
      "verseString": "وَإِنْ يُكَذِّبُوكَ فَقَدْ كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَعَادٌ وَثَمُودُ",
      "verseStringB": "And if they reject thee, already before them did the people of Noah and ‘ād and Tham∂d reject (prophets),"
    },
    {
      "verseNumber": 43,
      "verseString": "وَقَوْمُ إِبْرَاهِيمَ وَقَوْمُ لُوطٍ",
      "verseStringB": "And the people of Abraham and the people of Lot,"
    },
    {
      "verseNumber": 44,
      "verseString": "وَأَصْحَابُ مَدْيَنَ ۖ وَكُذِّبَ مُوسَىٰ فَأَمْلَيْتُ لِلْكَافِرِينَ ثُمَّ أَخَذْتُهُمْ ۖ فَكَيْفَ كَانَ نَكِيرِ",
      "verseStringB": "And the dwellers of Midian. And Moses (too) was rejected. But I gave respite to the disbelievers, then I seized them; so how (severe) was My disapproval!"
    },
    {
      "verseNumber": 45,
      "verseString": "فَكَأَيِّنْ مِنْ قَرْيَةٍ أَهْلَكْنَاهَا وَهِيَ ظَالِمَةٌ فَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا وَبِئْرٍ مُعَطَّلَةٍ وَقَصْرٍ مَشِيدٍ",
      "verseStringB": "How many a town We destroyed while it was iniquitous, so it is fallen down upon its roofs; and (how many) a deserted well and palace raised high!"
    },
    {
      "verseNumber": 46,
      "verseString": "أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ فَتَكُونَ لَهُمْ قُلُوبٌ يَعْقِلُونَ بِهَا أَوْ آذَانٌ يَسْمَعُونَ بِهَا ۖ فَإِنَّهَا لَا تَعْمَى الْأَبْصَارُ وَلَٰكِنْ تَعْمَى الْقُلُوبُ الَّتِي فِي الصُّدُورِ",
      "verseStringB": "Have they not travelled in the land so that they should have hearts with which to understand, or ears with which to hear? For surely it is not the eyes that are blind, but blind are the hearts which are in the breasts.ᵃ"
    },
    {
      "verseNumber": 47,
      "verseString": "وَيَسْتَعْجِلُونَكَ بِالْعَذَابِ وَلَنْ يُخْلِفَ اللَّهُ وَعْدَهُ ۚ وَإِنَّ يَوْمًا عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ",
      "verseStringB": "And they ask thee to hasten on the chastisement, and Allāh by no means fails in His promise. And surely a day with thy Lord is as a thousand years of what you reckon.ᵃ"
    },
    {
      "verseNumber": 48,
      "verseString": "وَكَأَيِّنْ مِنْ قَرْيَةٍ أَمْلَيْتُ لَهَا وَهِيَ ظَالِمَةٌ ثُمَّ أَخَذْتُهَا وَإِلَيَّ الْمَصِيرُ",
      "verseStringB": "And how many a town to which I gave respite while it was unjust, then I seized it! And to Me is the return."
    },
    {
      "verseNumber": 49,
      "verseString": "قُلْ يَا أَيُّهَا النَّاسُ إِنَّمَا أَنَا لَكُمْ نَذِيرٌ مُبِينٌ",
      "verseStringB": "Say: O people, I am only a plain warner to you."
    },
    {
      "verseNumber": 50,
      "verseString": "فَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ مَغْفِرَةٌ وَرِزْقٌ كَرِيمٌ",
      "verseStringB": "So those who believe and do good, for them is forgiveness and an honourable sustenance."
    },
    {
      "verseNumber": 51,
      "verseString": "وَالَّذِينَ سَعَوْا فِي آيَاتِنَا مُعَاجِزِينَ أُولَٰئِكَ أَصْحَابُ الْجَحِيمِ",
      "verseStringB": "And those who strive to oppose Our messages, they are the inmates of the flaming Fire."
    },
    {
      "verseNumber": 52,
      "verseString": "وَمَا أَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَسُولٍ وَلَا نَبِيٍّ إِلَّا إِذَا تَمَنَّىٰ أَلْقَى الشَّيْطَانُ فِي أُمْنِيَّتِهِ فَيَنْسَخُ اللَّهُ مَا يُلْقِي الشَّيْطَانُ ثُمَّ يُحْكِمُ اللَّهُ آيَاتِهِ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
      "verseStringB": "And We never sent a messenger or a prophet before thee but when he desired, the devil made a suggestion respecting his desire; but Allāh annuls that which the devil casts, then does Allāh establish His messages. And Allāh is Knowing, Wisea—"
    },
    {
      "verseNumber": 53,
      "verseString": "لِيَجْعَلَ مَا يُلْقِي الشَّيْطَانُ فِتْنَةً لِلَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ وَالْقَاسِيَةِ قُلُوبُهُمْ ۗ وَإِنَّ الظَّالِمِينَ لَفِي شِقَاقٍ بَعِيدٍ",
      "verseStringB": "That He may make what the devil casts a trial for those in whose hearts is a disease and the hard-hearted.ᵃ And surely the wrongdoers are in severe opposition,"
    },
    {
      "verseNumber": 54,
      "verseString": "وَلِيَعْلَمَ الَّذِينَ أُوتُوا الْعِلْمَ أَنَّهُ الْحَقُّ مِنْ رَبِّكَ فَيُؤْمِنُوا بِهِ فَتُخْبِتَ لَهُ قُلُوبُهُمْ ۗ وَإِنَّ اللَّهَ لَهَادِ الَّذِينَ آمَنُوا إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ",
      "verseStringB": "And that those who have been given knowledge may know that it is the Truth from thy Lord, so they should believe in it that their hearts may be lowly before Him. And surely Allāh is the Guide of those who believe, into a right path."
    },
    {
      "verseNumber": 55,
      "verseString": "وَلَا يَزَالُ الَّذِينَ كَفَرُوا فِي مِرْيَةٍ مِنْهُ حَتَّىٰ تَأْتِيَهُمُ السَّاعَةُ بَغْتَةً أَوْ يَأْتِيَهُمْ عَذَابُ يَوْمٍ عَقِيمٍ",
      "verseStringB": "And those who disbelieve will not cease to be in doubt concerning it, until the Hour overtakes them suddenly, or there comes to them the chastisement of a destructive day.ᵃ"
    },
    {
      "verseNumber": 56,
      "verseString": "الْمُلْكُ يَوْمَئِذٍ لِلَّهِ يَحْكُمُ بَيْنَهُمْ ۚ فَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فِي جَنَّاتِ النَّعِيمِ",
      "verseStringB": "The kingdom on that day is Allāh’s. He will judge between them. So those who believe and do good will be in Gardens of bliss."
    },
    {
      "verseNumber": 57,
      "verseString": "وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا فَأُولَٰئِكَ لَهُمْ عَذَابٌ مُهِينٌ",
      "verseStringB": "And those who disbelieve and reject Our messages, for them is an abasing chastisement."
    },
    {
      "verseNumber": 58,
      "verseString": "وَالَّذِينَ هَاجَرُوا فِي سَبِيلِ اللَّهِ ثُمَّ قُتِلُوا أَوْ مَاتُوا لَيَرْزُقَنَّهُمُ اللَّهُ رِزْقًا حَسَنًا ۚ وَإِنَّ اللَّهَ لَهُوَ خَيْرُ الرَّازِقِينَ",
      "verseStringB": "And those who flee in Allāh’s waya and are then slain or die, Allāh will certainly grant them a goodly sustenance. And surely Allāh is the Best of providers."
    },
    {
      "verseNumber": 59,
      "verseString": "لَيُدْخِلَنَّهُمْ مُدْخَلًا يَرْضَوْنَهُ ۗ وَإِنَّ اللَّهَ لَعَلِيمٌ حَلِيمٌ",
      "verseStringB": "He will certainly cause them to enter a place which they are pleased with. And surely Allāh is Knowing, Forbearing."
    },
    {
      "verseNumber": 60,
      "verseString": "ذَٰلِكَ وَمَنْ عَاقَبَ بِمِثْلِ مَا عُوقِبَ بِهِ ثُمَّ بُغِيَ عَلَيْهِ لَيَنْصُرَنَّهُ اللَّهُ ۗ إِنَّ اللَّهَ لَعَفُوٌّ غَفُورٌ",
      "verseStringB": "That (is so). And whoever retaliates with the like of that with which he is afflicted and he is oppressed, Allāh will certainly help him. Surely Allāh is Pardoning, Forgiving.ᵃ"
    },
    {
      "verseNumber": 61,
      "verseString": "ذَٰلِكَ بِأَنَّ اللَّهَ يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ وَأَنَّ اللَّهَ سَمِيعٌ بَصِيرٌ",
      "verseStringB": "That is because Allāh causes the night to enter into the day and causes the day to enter into the night, and because Allāh is Hearing, Seeing.ᵃ"
    },
    {
      "verseNumber": 62,
      "verseString": "ذَٰلِكَ بِأَنَّ اللَّهَ هُوَ الْحَقُّ وَأَنَّ مَا يَدْعُونَ مِنْ دُونِهِ هُوَ الْبَاطِلُ وَأَنَّ اللَّهَ هُوَ الْعَلِيُّ الْكَبِيرُ",
      "verseStringB": "That is because Allāh is the Truth, and that which they call upon besides Him — that is the falsehood, and because Allāh — He is the High, the Great."
    },
    {
      "verseNumber": 63,
      "verseString": "أَلَمْ تَرَ أَنَّ اللَّهَ أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَتُصْبِحُ الْأَرْضُ مُخْضَرَّةً ۗ إِنَّ اللَّهَ لَطِيفٌ خَبِيرٌ",
      "verseStringB": "Seest thou not that Allāh sends down water from the cloud, then the earth becomes green? Surely Allāh is Knower of subtilities, Aware."
    },
    {
      "verseNumber": 64,
      "verseString": "لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَإِنَّ اللَّهَ لَهُوَ الْغَنِيُّ الْحَمِيدُ",
      "verseStringB": "To Him belongs whatever is in the heavens and whatever is in the earth. And surely Allāh — He is the Self-Sufficient, the Praised."
    },
    {
      "verseNumber": 65,
      "verseString": "أَلَمْ تَرَ أَنَّ اللَّهَ سَخَّرَ لَكُمْ مَا فِي الْأَرْضِ وَالْفُلْكَ تَجْرِي فِي الْبَحْرِ بِأَمْرِهِ وَيُمْسِكُ السَّمَاءَ أَنْ تَقَعَ عَلَى الْأَرْضِ إِلَّا بِإِذْنِهِ ۗ إِنَّ اللَّهَ بِالنَّاسِ لَرَءُوفٌ رَحِيمٌ",
      "verseStringB": "Seest thou not that Allāh has made subservient to you all that is in the earth, and the ships gliding in the sea by His command? And He withholds the heaven from falling on the earth except with His permission. Surely Allāh is Compassionate, Merciful to men.ᵃ"
    },
    {
      "verseNumber": 66,
      "verseString": "وَهُوَ الَّذِي أَحْيَاكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ۗ إِنَّ الْإِنْسَانَ لَكَفُورٌ",
      "verseStringB": "And He it is Who brings you to life, then He causes you to die, then He will bring you to life. Surely man is ungrateful."
    },
    {
      "verseNumber": 67,
      "verseString": "لِكُلِّ أُمَّةٍ جَعَلْنَا مَنْسَكًا هُمْ نَاسِكُوهُ ۖ فَلَا يُنَازِعُنَّكَ فِي الْأَمْرِ ۚ وَادْعُ إِلَىٰ رَبِّكَ ۖ إِنَّكَ لَعَلَىٰ هُدًى مُسْتَقِيمٍ",
      "verseStringB": "To every nation We appointed acts of devotion, which they observe,ᵃ so let them not dispute with thee in the matter, and call to thy Lord. Surely thou art on a right guidance."
    },
    {
      "verseNumber": 68,
      "verseString": "وَإِنْ جَادَلُوكَ فَقُلِ اللَّهُ أَعْلَمُ بِمَا تَعْمَلُونَ",
      "verseStringB": "And if they contend with thee, say: Allāh best knows what you do."
    },
    {
      "verseNumber": 69,
      "verseString": "اللَّهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ الْقِيَامَةِ فِيمَا كُنْتُمْ فِيهِ تَخْتَلِفُونَ",
      "verseStringB": "Allāh will judge between you on the day of Resurrection respecting that in which you differ."
    },
    {
      "verseNumber": 70,
      "verseString": "أَلَمْ تَعْلَمْ أَنَّ اللَّهَ يَعْلَمُ مَا فِي السَّمَاءِ وَالْأَرْضِ ۗ إِنَّ ذَٰلِكَ فِي كِتَابٍ ۚ إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ",
      "verseStringB": "Knowest thou not that Allāh knows what is in the heaven and the earth? Surely this is in a book. That is surely easy to Allāh."
    },
    {
      "verseNumber": 71,
      "verseString": "وَيَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَمْ يُنَزِّلْ بِهِ سُلْطَانًا وَمَا لَيْسَ لَهُمْ بِهِ عِلْمٌ ۗ وَمَا لِلظَّالِمِينَ مِنْ نَصِيرٍ",
      "verseStringB": "And they serve besides Allāh that for which He has not sent any authority, and of which they have no knowledge. And for the unjust there is no helper."
    },
    {
      "verseNumber": 72,
      "verseString": "وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ تَعْرِفُ فِي وُجُوهِ الَّذِينَ كَفَرُوا الْمُنْكَرَ ۖ يَكَادُونَ يَسْطُونَ بِالَّذِينَ يَتْلُونَ عَلَيْهِمْ آيَاتِنَا ۗ قُلْ أَفَأُنَبِّئُكُمْ بِشَرٍّ مِنْ ذَٰلِكُمُ ۗ النَّارُ وَعَدَهَا اللَّهُ الَّذِينَ كَفَرُوا ۖ وَبِئْسَ الْمَصِيرُ",
      "verseStringB": "And when Our clear messages are recited to them, thou wilt notice a denial on the faces of those who disbelieve — they almost attack those who recite to them Our messages. Say: Shall I inform you of what is worse than this? The Fire. Allāh has promised it to those who disbelieve. And evil is the resort. back from it. Weak are (both) the invoker and the invoked.ᵃ"
    },
    {
      "verseNumber": 73,
      "verseString": "يَا أَيُّهَا النَّاسُ ضُرِبَ مَثَلٌ فَاسْتَمِعُوا لَهُ ۚ إِنَّ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ لَنْ يَخْلُقُوا ذُبَابًا وَلَوِ اجْتَمَعُوا لَهُ ۖ وَإِنْ يَسْلُبْهُمُ الذُّبَابُ شَيْئًا لَا يَسْتَنْقِذُوهُ مِنْهُ ۚ ضَعُفَ الطَّالِبُ وَالْمَطْلُوبُ",
      "verseStringB": ""
    },
    {
      "verseNumber": 74,
      "verseString": "مَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ ۗ إِنَّ اللَّهَ لَقَوِيٌّ عَزِيزٌ",
      "verseStringB": "They estimate not Allāh with His due estimation. Surely Allāh is Strong, Mighty."
    },
    {
      "verseNumber": 75,
      "verseString": "اللَّهُ يَصْطَفِي مِنَ الْمَلَائِكَةِ رُسُلًا وَمِنَ النَّاسِ ۚ إِنَّ اللَّهَ سَمِيعٌ بَصِيرٌ",
      "verseStringB": "Allāh chooses messengers from angels and from men. Surely Allāh is Hearing, Seeing."
    },
    {
      "verseNumber": 76,
      "verseString": "يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۗ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ",
      "verseStringB": "He knows what is before them and what is behind them. And to Allāh are all affairs returned."
    },
    {
      "verseNumber": 77,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا ارْكَعُوا وَاسْجُدُوا وَاعْبُدُوا رَبَّكُمْ وَافْعَلُوا الْخَيْرَ لَعَلَّكُمْ تُفْلِحُونَ ۩",
      "verseStringB": "O you who believe, bow down and prostrate yourselves and serve your Lord, and do good that you may succeed.ᵃ"
    },
    {
      "verseNumber": 78,
      "verseString": "وَجَاهِدُوا فِي اللَّهِ حَقَّ جِهَادِهِ ۚ هُوَ اجْتَبَاكُمْ وَمَا جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ ۚ مِلَّةَ أَبِيكُمْ إِبْرَاهِيمَ ۚ هُوَ سَمَّاكُمُ الْمُسْلِمِينَ مِنْ قَبْلُ وَفِي هَٰذَا لِيَكُونَ الرَّسُولُ شَهِيدًا عَلَيْكُمْ وَتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ ۚ فَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَاعْتَصِمُوا بِاللَّهِ هُوَ مَوْلَاكُمْ ۖ فَنِعْمَ الْمَوْلَىٰ وَنِعْمَ النَّصِيرُ",
      "verseStringB": "And strive hard for Allāh with due striving. He has chosen you and has not laid upon you any hardship in religion — the faith of your father Abraham. He named you Muslims before and in this,ᵃ that the Messenger may be a bearer of witness to you, and you may be bearers of witness to the people;ᵇ so keep up prayer and pay the poor-rate and hold fast to Allāh. He is your Protector; excellent the Protector and excellent the Helpe"
    }
  ],
  "nameEnglish": "The Pilgrimage",
  "nameTrans": "al-Hajj",
  "nameArabic": "الحج",
  "chapterNumber": 22,
  "nVerses": 78,
  "footnotes": [
    {
      "note":"1a. Zalzala means originally he put him into a state of commotion or agitation (LL).      It is noteworthy that the word is specially used in connection with wars implying a casting of terror into the heart. Thus in 33:11 and also in a prayer of the Prophet the word is      used in connection with the terror or affliction of war. And zalåzil, which is plural of      zalzalah, means difficulties, trials, afflictions (LL).\n\n      1b. In the Holy Qur’ån, al-så‘ah or the Hour does not necessarily imply the day of      Judgment. It often implies the time of judgment in this life, the time when the threatened      doom overtakes a people, and this seems to be the significance here. Some consider that      a severe shaking of the earth is meant as a sign of the approach of the great judgment,      but even in that case it might imply any terrible calamity, such as a great war.\n\n      3a. The devil here is, as very frequently in the Holy Qur’ån, the devil in human form.\n\n      5a. The word ba‘th (raising) is used in three senses in the Holy Qur’ån, viz., (1) the      raising of the dead to life according to their good or evil deeds on the Judgment day;      (2) the raising of the spiritually dead to life by the prophets; and (3) the raising up of      prophets by Allåh for the guidance of mankind. The word as used here may include all      three cases, whether it is the denial of the Resurrection or the denial of Allåh’s raising      the Prophet, or the denial of the Prophet’s raising them to spiritual life. The argument      contained in this and the following verses is equally applicable to all, but it most prominently refers to the spiritual resurrection of the dead.       5b. These words explain the meaning of Adam’s or man’s creation from dust, which is      frequently referred to in the Holy Qur’ån, for all people are here spoken of as being created      from dust. Man’s creation from dust implies the ultimate springing of all life from earth.\n\n      5c. The various stages through which every human child passes are spoken of here,      the object being to show how humble is his origin. Or, the reference may be to the various stages through which man has passed in his evolution to the present stage of perfection. Attention is thus drawn to the fact that, just as the physical evolution of man is      gradual, so is his spiritual growth and development.\n\n      5d. By the worst part of life is meant dotage and decrepitude (Rz).\n\n      5e. The stirring and swelling of the earth means its stirring and swelling with the      growth of herbage. Compare 41:39, and see 41:39a. The illustration draws attention to      the fact that revelation quickens dead hearts as rain quickens dead earth. The next verse      makes it plain: He gives life to the dead and He is Possessor of power over all things.\n\n      7a. To understand what is meant by those who are in the graves compare 35:22:      “Surely Allåh makes whom He pleases hear, and thou canst not make those hear who are in      the graves”. The significance is that even the incorrigible will be raised to a spiritual life.\n\n      9a. Thåniya ‘iΔfi-hß signifies literally folding up, twisting, or turning his side, ‘iΔf      meaning the side of a man from the head to the hip, but the expression is used metaphorically to signify behaving proudly (LL) or turning away (R).\n\n      11a. ‘Alå √arf (lit., on the verge) is variously explained, the ultimate significance      being in all cases the same. LL quotes many of these explanations. It either means      standing aloof with respect to religion in a fluctuating state, like him who is on the outskirts of the army, who, if sure of victory and spoil, stands firm but otherwise flees; or,      the meaning is, who serves Allåh in doubt or suspense, being unsteady like him who      stands on the edge of a mountain, or who serves Allåh in one mode of circumstances,      i.e., when in ample circumstances. All these explanations indicate the attitude of a man      who wavers, being ready to quit the faith on any pretence. \n\n      15a. This passage is misconstrued on account of a misconception in connection with      the personal pronoun hu in yan©ura-hu (“assist him”), which refers really to the Holy      Prophet. The second difficulty is in connection with the object of yaqΔa’, i.e., cut (it) off,      which is understood as being really the Divine assistance, which the opponents are told      must come to the Holy Prophet, however hard their struggle against that Divine assistance, and this is clearly indicated by the concluding words of the verse. The prophecies      of the final triumph of the Truth and of the coming of Divine assistance to the Holy      Prophet were repeatedly declared in the Holy Qur’ån, and the disbelievers were enraged      at this. They are told that the Divine assistance must come, and that they should leave no      stone unturned in their struggle against it, insomuch that, if they could, they should rise      to heaven and cut off all heavenly or Divine assistance from the Prophet. Or, the meaning may be that they may carry their anger to the greatest possible extremity and be driven to the utmost desperation, yet they will be unable to stop the coming of Divine help.      The meaning is in either case that Divine assistance, which is promised to the Prophet,      will come to him most surely, however hard the struggle carried on against him, or however great the disappointment of the opponents.\n\n      17a. It is implied that differences in religious beliefs do not call for punishment in      this life; these will be decided on the day of Judgment. Punishment in this life is brought      upon those who work mischief and transgress all limits in doing evil. \n\n      18a. The recital of this verse is followed by an actual prostration; see 7:206a.      19a. The two adversaries are the believers and the disbelievers. It should be noted      that the enmity of the two parties, whose original difference is only a dispute about their      Lord, is now assuming a graver aspect, and the fate of the two in the coming conflicts is      clearly foretold — of the disbelievers in vv. 19 –22, and of the believers in vv. 23, 24.\n\n      21a. The iron whips indicate holding in subjection. Qama‘a-h∂, the root from which      maqma‘, meaning whip, is derived, signifies he held him in subjection and brought him      to submission (T).\n\n      22a. Min ghamm-in (from grief ) explains min-hå (from it), and thus explains the      nature of the chastisement in this and the previous verse. It is a grief which will constantly burn their souls so as to melt them.\n\n      23a. The following incident, mentioned by Baihaqß, shows that the companions of      the Prophet understood these prophecies in another sense too: “The bracelets of Kisrå,      the Persian monarch, were brought to ‘Umar, and he caused Suråqah, son of Målik, to      wear them, on which he praised the Almighty”. The reason for ‘Umar causing the      bracelets to be worn by Suråqah is also given by the same authority in another report,      according to which the Holy Prophet had said to Suråqah: “How wilt thou feel when      thou wearest the bracelets of Kisrå?” (Kha©å’i© al-Kubrå, vol. ii, p. 113).\n\n      25a. Or, ‘åkif may signify the dweller in Makkah, and båd, the dweller in the desert,      or the two may respectively signify one who dwells in it constantly and one who comes      to it occasionally. The disbelievers, being then in possession of the Sacred Mosque, prevented the Muslims from using it. They are told that this state of things will be brought      to an end, for it must be open to all visitors, and that could only be brought about by the      Muslims being made masters of it.\n\n      27a.  The words are addressed to the Holy Prophet, and contain a mighty prophecy      that Makkah will become the centre to which men will come for pilgrimage. It was      announced just at the time when the Holy Prophet was being driven away from Makkah      by his enemies, who were the sole masters of the place. Just when Makkah seemed to      have lost every chance of becoming a Muslim centre, and when the Muslims themselves      were in danger of being entirely destroyed, a mighty prophecy is announced in the most      forcible words that Islåm will spread to all countries of the world, and Makkah will      become the universal centre to which pilgrims from all nations will resort.\n\n      27b. The lean camel is particularly mentioned here to indicate the great distances      from which the pilgrims would come. The addition of the words from every remote path      shows that people will come from the remotest parts of the earth. \n\n      28a. The subject of sacrifice is one that is specially related to the pilgrimage,      because every pilgrim must sacrifice an animal. Thus it is the lesson of sacrifice that is      taught in pilgrimage. It may be added that the act of the pilgrim finds an echo throughout the Muslim world, for every Muslim who can afford is required to sacrifice an animal on this occasion, and this subject is discussed in the next section.\n\n      29a. The mention of the Ka‘bah as the Ancient House, here and in v. 33, shows that      it is so old that it came to be known throughout Arabia by that name, thus pointing to its      very remote antiquity; see 2:125a. \n\n      34a. The principle of sacrifice is one which is accepted in one form or another by all      nations of the world; but it has a deeper meaning in Islåm. The outward act is still there,      as of old, but it no more conveys the meaning attached to it in ancient religions, viz.,      that of appeasing an offended Deity, or that of serving as an atonement for sins. It signifies the sacrifice of the sacrificer himself, and becomes thus an outward symbol of his      readiness to lay down his life, if required, and to sacrifice all his interests and desires in      the cause of Truth. Hence it is that words introducing the subject of sacrifice are immediately followed by an injunction to submit oneself entirely to Allåh, Who is the one      God, i.e., the only Being Who deserves to be made the true object of one’s love.\n\n      35a. It is by the mention of Allåh’s name that an animal is sacrificed, and the meaning underlying it is that their own hearts should tremble at the mention of that name.      Thus they should bear in mind, when sacrificing an animal over which they hold control,      how much more necessary it is that they should lay down their lives in the way of Allåh,      Who holds control over all. Hence a verse speaking of sacrifices is immediately followed by one which requires the exercise of great patience and endurance under hard trials by the faithful. The sacrifice of an animal is thus a reminder to man that he must be      ready to sacrifice his own life in the cause of Truth.\n\n      36a. The meaning conveyed here is the same as that in the previous verse. The camels      which are brought for sacrifice to Makkah by the pilgrims are here stated to be only outward signs of the true religion of Allåh, that religion being no other than the religion of      entire submission and of laying down all one has, even one’s life, in the way of Allåh.\n\n      36b. The flesh of the animals sacrificed is not to be wasted, but it should serve as      food for the poor and the needy. The burying of the flesh of the numerous sacrifices at      Makkah on the occasion of the pilgrimage is not in accordance with any injunction of      the Holy Qur’ån or any saying of the Holy Prophet. It can be turned to good use. \n\n      37a. This verse settles conclusively that it is not the outward act of sacrifice, which      is acceptable, but the deep meaning of sacrifice which underlies it. It should also be      borne in mind that the idea of atonement is quite foreign to Islamic sacrifice. It is the      righteous whom Islåm requires to sacrifice, and this is hinted at in the words, to Him is      acceptable observance of duty on your part.\n\n      38a. With this verse, which brings this section to a close, is introduced a new subject,      the subject of fighting in the way of Allåh, which is dealt with at length in the following      section. This sheds light upon the connection which exists between the two subjects. After      dealing with the subject of sacrifice theoretically, the Muslim has in fact been prepared to      bring into practice the theory of the sacrifice. Hence he is told that the time is near when he      will be required to lay down his very life in the defence of Truth, which the opponents      were striving to exterminate. Therefore, the subject of fighting in the cause of Truth is a      fitting sequel to the subject of sacrifice, as casting further light upon the inner meaning of      sacrifice, and also requiring that doctrine to be carried into practice.\n\n      39a. According to authentic reports, this is the earliest permission given to the      Muslims to fight. There is nothing to show that this verse was not revealed at Makkah. On      the other hand, it was owing to this revelation that in the well-known oath of allegiance      taken at ‘Aqabah, the Holy Prophet required a promise from the Madßnah deputation that      they would defend him against his enemies even as they would defend their own children.      The words in which the permission is granted show clearly that war was first made on the      Muslims by their opponents; and secondly, that the Muslims had already suffered great      oppression at the hands of their persecutors. The words of the next verse, those who are      driven from their homes, may refer to the emigration to Abyssinia, or to the exodus to      Madßnah, which commenced soon after the ‘Aqabah allegiance was sworn. \n\n      40a. The religious freedom which was established by Islåm thirteen hundred years      ago has not yet been surpassed by the most civilized and tolerant of nations. It deserves to      be noted that the lives of Muslims are to be sacrificed not only to stop their own persecution by their opponents and to save their own mosques, but to save churches, synagogues      and cloisters as well — in fact, to establish perfect religious freedom. The mosques,      though they are the places where the name of Allåh is remembered most of all, come in      for their share of protection even after the churches and the synagogues. Early Muslims      closely followed these directions, and every commander of an army had express orders to      respect all houses of worship, and even the cloisters of monks, along with their inmates.\n\n      46a. It should be noted that the Holy Qur’ån very often speaks of the blind, the deaf      and the dead, meaning thereby the spiritually blind, deaf and dead, as it has plainly      stated here.\n\n      47a. Those spoken of here are undoubtedly the opponents of Truth who were to      come later, and who have been allowed to oppose the advance of Islåm for a thousand      years. Compare 20:103a, 104a. The set-back which Islåm was to receive for a thousand      years is again spoken of in 32:5; see 32:5a.\n\n      52a. Some careless commentators mention here the false story relating to what the      Christian critics call “the Lapse” of the Prophet. The Prophet, they say, on this occasion      recognized that the idols worshipped by the Arabs could intercede with God on their      behalf. That such a thing never happened is shown in 53:21a. This story has been rejected by all sound and reliable commentators. Thus Ibn Kathßr says: “Many commentators      relate here the story of the Gharånßq ... but it is from sources not traceable to any      companion”. According to Rz, commentators who aim at accuracy and truth say that      this story is false and a forgery. Bd makes similar remarks.      The words do not, and cannot, mean that when a prophet recites a revelation, the      devil introduces his own words into his recitation. It is absurd on the face of it, and the      Holy Qur’ån belies it when it says: “He makes His secrets known to none, except a messenger whom He chooses. For surely He makes a guard to go before him and after him,      that He may know that they have truly delivered the messages of their Lord” (72:26–28).      Moreover, it is absolutely inconceivable that such an important incident as the Prophet’s      having accepted the intercession of idols should have been mentioned in the Qur’ån eight      years after it happened. The 53rd chapter, in which the change is said to have taken place,      was revealed before the fifth year of the Prophet’s call, while this chapter was revealed on      the eve of the Prophet’s departure from Makkah. That more than half the Qur’ån should      have been revealed during this long period without a single reference to the alleged story,      and that it should then have been quite unnecessarily referred to in a chapter where it is      quite out of place, is alone sufficient to give the lie to this story.      Now take the words. Tamannå, according to all lexicologists, signifies he desired,      and according to T, tamannß signifies the desire to attain to that which is liked by one.      Now, what every prophet desires is the establishing of the Truth that is revealed to him,      and it is with this desire of every prophet that the devil interferes, instigating men, making suggestions to them, as stated here, to oppose the Truth. That this is the true meaning      is also shown by the context, which deals with the establishing of the Truth and the      desire of the opponents of Truth to annihilate it. See the previous verse, which condemns those who fight and contest with the Prophet to render him unable to establish the      Truth in the world. And here we are told that the plans of the enemies will be frustrated      and Truth will be established in the world.\n\n      53a. The devil’s strivings against the Prophet become a trial for the weak, who are      unable to endure the severe persecutions of their enemies.\n\n      55a. ‘Aqßm, applied to a womb, means barren; applied to wind, it signifies such as      does not fructify (LL); hence al-rß√ al-‘aqßm in 51:41 means a destructive wind, and      yaum ‘aqßm here a destructive day, i.e., a day bringing no good. This verse, as well as      the two following, prophesy the establishment of Truth — for that is the kingdom of      Allåh — and the discomfiture of the power of evil.\n\n      58a. The mere occurrence of the word håjar∂ (they fled) in this verse does not show      that it was not revealed at Makkah, for a flight of the faithful to Abyssinia had taken      place as early as the fifth year of the Call. Moreover, it should be noted that the Holy      Prophet, with Ab∂ Bakr and ‘Alß, were the last men to depart from Makkah on the occasion of the second flight. A true and generous leader of men, he waited to see his faithful      followers depart before he left, so that their safety might be ensured. There is no doubt      that if he had left his followers behind him, they would have encountered a very hard      fate at the hands of an exasperated enemy. The reference to some being slain after their      flight is clearly prophetical.\n\n      60a. This verse permits the Muslims, who were long persecuted and oppressed, to      punish their persecutors, but at the same time recommends pardon and forgiveness by      referring to those two attributes of the Divine Being in the concluding words of the verse.\n\n      61a. Apparently the succession of the day and the night refers here to the turn of fortune hinted at in the previous verse, because an oppressed community could not punish      its persecutors unless it gained the mastery over them. The same is indicated in the two      attributes of the Divine Being with which the verse is closed. The verses that follow contain hints to the same effect.\n\n      65a. The first part of the verse gives a promise of victory to the Muslims, while the      latter part warns the opponents that Allåh withholds the punishment from them for a      time, for He is Compassionate and Merciful to men. The withholding of the heaven      means the withholding of the punishment, which the opponents were told would come      down upon them from heaven. \n\n      67a. The principle that all people were given spiritual light is reiterated throughout      the Holy Qur’ån.\n\n      73a. The verse, while truly describing the inability of false gods to create the lowest      form of life or to exercise the least control over creation, contains a clear prophecy that      the false deities will be removed from the Sacred House, and that both the worshippers      and the worshipped will be helpless.\n\n      77a. The recitation of this verse is followed by an actual prostration; see 7:206a.\n\n      78a. The reference in before is to the revelation of Abraham, who prayed that from      among his descendants there should arise a nation of Muslims (2:128), and in this to the      Holy Qur’ån. For the meaning of Islåm and Muslim, see 2:112a and 3:19a. The rootword is salm or silm, both signifying peace (R), and a Muslim is therefore one who leads      a life of peace, peace with God, which means complete submission to His will, and      peace with man, which means that he causes no injury to any man, as a saying of the      Holy Prophet has it (B. 2:3).\n\n      78b. Compare 2:143, where similar words are used. The significance is that the Muslim      community is destined to play the role of leader to the whole of humanity; see 2:143b.      "
    }
  ]
}
