{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "تَبَارَكَ الَّذِي نَزَّلَ الْفُرْقَانَ عَلَىٰ عَبْدِهِ لِيَكُونَ لِلْعَالَمِينَ نَذِيرًا",
      "verseStringB": "Blessed is He Who sent down the DiscrimInᵃ tion upon His servant that he might be a warner to the nationsa—"
    },
    {
      "verseNumber": 2,
      "verseString": "الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَلَمْ يَتَّخِذْ وَلَدًا وَلَمْ يَكُنْ لَهُ شَرِيكٌ فِي الْمُلْكِ وَخَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهُ تَقْدِيرًا",
      "verseStringB": "He, Whose is the kingdom of the heavens and the earth, and Who did not take to Himself a son, and Who has no associate in the kingdom, and Who created everything, then ordained for it a measure.ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "وَاتَّخَذُوا مِنْ دُونِهِ آلِهَةً لَا يَخْلُقُونَ شَيْئًا وَهُمْ يُخْلَقُونَ وَلَا يَمْلِكُونَ لِأَنْفُسِهِمْ ضَرًّا وَلَا نَفْعًا وَلَا يَمْلِكُونَ مَوْتًا وَلَا حَيَاةً وَلَا نُشُورًا",
      "verseStringB": "And they take besides Him gods who create naught, while they are themselves created, and they control for themselves no harm nor profit, and they control not death, nor life, nor raising to life."
    },
    {
      "verseNumber": 4,
      "verseString": "وَقَالَ الَّذِينَ كَفَرُوا إِنْ هَٰذَا إِلَّا إِفْكٌ افْتَرَاهُ وَأَعَانَهُ عَلَيْهِ قَوْمٌ آخَرُونَ ۖ فَقَدْ جَاءُوا ظُلْمًا وَزُورًا",
      "verseStringB": "And those who disbelieve say: This is nothing but a lie, which he has forged, and other people have helped him at it. So indeed they have brought an iniquity and a falsehood."
    },
    {
      "verseNumber": 5,
      "verseString": "وَقَالُوا أَسَاطِيرُ الْأَوَّلِينَ اكْتَتَبَهَا فَهِيَ تُمْلَىٰ عَلَيْهِ بُكْرَةً وَأَصِيلًا",
      "verseStringB": "And they say: Stories of the ancients, which he has got written, so they are read out to him morning and evening!ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "قُلْ أَنْزَلَهُ الَّذِي يَعْلَمُ السِّرَّ فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ إِنَّهُ كَانَ غَفُورًا رَحِيمًا",
      "verseStringB": "Say: He has revealed it, Who knows the secret of the heavens and the earth.ᵃ Surely He is ever Forgiving, Merciful."
    },
    {
      "verseNumber": 7,
      "verseString": "وَقَالُوا مَالِ هَٰذَا الرَّسُولِ يَأْكُلُ الطَّعَامَ وَيَمْشِي فِي الْأَسْوَاقِ ۙ لَوْلَا أُنْزِلَ إِلَيْهِ مَلَكٌ فَيَكُونَ مَعَهُ نَذِيرًا",
      "verseStringB": "And they say: What a Messenger is this? He eats food and goes about in the markets. Why has not an angel been sent down to him to be a warner with him?ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "أَوْ يُلْقَىٰ إِلَيْهِ كَنْزٌ أَوْ تَكُونُ لَهُ جَنَّةٌ يَأْكُلُ مِنْهَا ۚ وَقَالَ الظَّالِمُونَ إِنْ تَتَّبِعُونَ إِلَّا رَجُلًا مَسْحُورًا",
      "verseStringB": "Or a treasure given to him, or a garden from which to eat?ᵃ And the evildoers say: You follow but a man bewitched!"
    },
    {
      "verseNumber": 9,
      "verseString": "انْظُرْ كَيْفَ ضَرَبُوا لَكَ الْأَمْثَالَ فَضَلُّوا فَلَا يَسْتَطِيعُونَ سَبِيلًا",
      "verseStringB": "See what parables they set forth for thee — they have gone astray, so they cannot find a way.ᵃ"
    },
    {
      "verseNumber": 10,
      "verseString": "تَبَارَكَ الَّذِي إِنْ شَاءَ جَعَلَ لَكَ خَيْرًا مِنْ ذَٰلِكَ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ وَيَجْعَلْ لَكَ قُصُورًا",
      "verseStringB": "Blessed is He Who, if He please, will give thee what is better than this: Gardens wherein flow rivers. And He will give thee palaces.ᵃ"
    },
    {
      "verseNumber": 11,
      "verseString": "بَلْ كَذَّبُوا بِالسَّاعَةِ ۖ وَأَعْتَدْنَا لِمَنْ كَذَّبَ بِالسَّاعَةِ سَعِيرًا",
      "verseStringB": "But they deny the Hour, and We have prepared a burning Fire for him who denies the Hour."
    },
    {
      "verseNumber": 12,
      "verseString": "إِذَا رَأَتْهُمْ مِنْ مَكَانٍ بَعِيدٍ سَمِعُوا لَهَا تَغَيُّظًا وَزَفِيرًا",
      "verseStringB": "When it sees them from a far-off place, they will hear its raging and roaring."
    },
    {
      "verseNumber": 13,
      "verseString": "وَإِذَا أُلْقُوا مِنْهَا مَكَانًا ضَيِّقًا مُقَرَّنِينَ دَعَوْا هُنَالِكَ ثُبُورًا",
      "verseStringB": "And when they are cast into a narrow place thereof in chains, they will there pray for destruction."
    },
    {
      "verseNumber": 14,
      "verseString": "لَا تَدْعُوا الْيَوْمَ ثُبُورًا وَاحِدًا وَادْعُوا ثُبُورًا كَثِيرًا",
      "verseStringB": "Pray not this day for destruction once but pray for destruction again and again."
    },
    {
      "verseNumber": 15,
      "verseString": "قُلْ أَذَٰلِكَ خَيْرٌ أَمْ جَنَّةُ الْخُلْدِ الَّتِي وُعِدَ الْمُتَّقُونَ ۚ كَانَتْ لَهُمْ جَزَاءً وَمَصِيرًا",
      "verseStringB": "Say: Is this better or the Garden of Perpetuity, which the dutiful are promised? That is a reward and a resort for them."
    },
    {
      "verseNumber": 16,
      "verseString": "لَهُمْ فِيهَا مَا يَشَاءُونَ خَالِدِينَ ۚ كَانَ عَلَىٰ رَبِّكَ وَعْدًا مَسْئُولًا",
      "verseStringB": "For them therein is what they desire, to abide. It is a promise to be prayed for from thy Lord.ᵃ"
    },
    {
      "verseNumber": 17,
      "verseString": "وَيَوْمَ يَحْشُرُهُمْ وَمَا يَعْبُدُونَ مِنْ دُونِ اللَّهِ فَيَقُولُ أَأَنْتُمْ أَضْلَلْتُمْ عِبَادِي هَٰؤُلَاءِ أَمْ هُمْ ضَلُّوا السَّبِيلَ",
      "verseStringB": "And on the day when He will gather them, and that which they serve besides Allāh, He will say: Was it you who led astray these My servants, or did they themselves stray from the path?"
    },
    {
      "verseNumber": 18,
      "verseString": "قَالُوا سُبْحَانَكَ مَا كَانَ يَنْبَغِي لَنَا أَنْ نَتَّخِذَ مِنْ دُونِكَ مِنْ أَوْلِيَاءَ وَلَٰكِنْ مَتَّعْتَهُمْ وَآبَاءَهُمْ حَتَّىٰ نَسُوا الذِّكْرَ وَكَانُوا قَوْمًا بُورًا",
      "verseStringB": "They will say: Glory be to Thee! it was not beseeming for us that we should take for protectors others besides Thee, but Thou didst make them and their fathers to enjoy until they forgot the Reminder, and they became a lost people.ᵃ"
    },
    {
      "verseNumber": 19,
      "verseString": "فَقَدْ كَذَّبُوكُمْ بِمَا تَقُولُونَ فَمَا تَسْتَطِيعُونَ صَرْفًا وَلَا نَصْرًا ۚ وَمَنْ يَظْلِمْ مِنْكُمْ نُذِقْهُ عَذَابًا كَبِيرًا",
      "verseStringB": "So they will give you the lie in what you say, then you can neither ward off (evil), nor (obtain) help. And whoever among you does wrong, We shall make him taste a great chastisement."
    },
    {
      "verseNumber": 20,
      "verseString": "وَمَا أَرْسَلْنَا قَبْلَكَ مِنَ الْمُرْسَلِينَ إِلَّا إِنَّهُمْ لَيَأْكُلُونَ الطَّعَامَ وَيَمْشُونَ فِي الْأَسْوَاقِ ۗ وَجَعَلْنَا بَعْضَكُمْ لِبَعْضٍ فِتْنَةً أَتَصْبِرُونَ ۗ وَكَانَ رَبُّكَ بَصِيرًا",
      "verseStringB": "And We did not send before thee any messengers but they surely ate food and went about in the markets. And We make some of you a trial for others. Will you bear patiently? And thy Lord is ever Seeing.ᵃ"
    },
    {
      "verseNumber": 21,
      "verseString": "وَقَالَ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا لَوْلَا أُنْزِلَ عَلَيْنَا الْمَلَائِكَةُ أَوْ نَرَىٰ رَبَّنَا ۗ لَقَدِ اسْتَكْبَرُوا فِي أَنْفُسِهِمْ وَعَتَوْا عُتُوًّا كَبِيرًا",
      "verseStringB": "And those who look not for meeting with Us, say: Why have not angels been sent down to us, or (why) do we not see our Lord? Indeed they are too proud of themselves and revolt in great revolt.ᵃ"
    },
    {
      "verseNumber": 22,
      "verseString": "يَوْمَ يَرَوْنَ الْمَلَائِكَةَ لَا بُشْرَىٰ يَوْمَئِذٍ لِلْمُجْرِمِينَ وَيَقُولُونَ حِجْرًا مَحْجُورًا",
      "verseStringB": "On the day when they will see the angels, there will be no good news for the guilty, and they will say: Let there be a strong barrier!ᵃ"
    },
    {
      "verseNumber": 23,
      "verseString": "وَقَدِمْنَا إِلَىٰ مَا عَمِلُوا مِنْ عَمَلٍ فَجَعَلْنَاهُ هَبَاءً مَنْثُورًا",
      "verseStringB": "And We shall turn to the work they have done, so We shall render it as scattered motes.ᵃ"
    },
    {
      "verseNumber": 24,
      "verseString": "أَصْحَابُ الْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُسْتَقَرًّا وَأَحْسَنُ مَقِيلًا",
      "verseStringB": "The owners of the Garden will on that day be in a better abiding-place and a fairer resting-place."
    },
    {
      "verseNumber": 25,
      "verseString": "وَيَوْمَ تَشَقَّقُ السَّمَاءُ بِالْغَمَامِ وَنُزِّلَ الْمَلَائِكَةُ تَنْزِيلًا",
      "verseStringB": "And on the day when the heaven bursts asunder with clouds, and the angels are sent down, as they are sent.ᵃ"
    },
    {
      "verseNumber": 26,
      "verseString": "الْمُلْكُ يَوْمَئِذٍ الْحَقُّ لِلرَّحْمَٰنِ ۚ وَكَانَ يَوْمًا عَلَى الْكَافِرِينَ عَسِيرًا",
      "verseStringB": "The kingdom on that day rightly belongs to the Beneficent, and it will be a hard day for the disbelievers."
    },
    {
      "verseNumber": 27,
      "verseString": "وَيَوْمَ يَعَضُّ الظَّالِمُ عَلَىٰ يَدَيْهِ يَقُولُ يَا لَيْتَنِي اتَّخَذْتُ مَعَ الرَّسُولِ سَبِيلًا",
      "verseStringB": "And on the day when the wrongdoer will bite his hands, saying: Would that I had taken a way with the Messenger!ᵃ"
    },
    {
      "verseNumber": 28,
      "verseString": "يَا وَيْلَتَىٰ لَيْتَنِي لَمْ أَتَّخِذْ فُلَانًا خَلِيلًا",
      "verseStringB": "O woe is me! would that I had not taken such a one for a friend!"
    },
    {
      "verseNumber": 29,
      "verseString": "لَقَدْ أَضَلَّنِي عَنِ الذِّكْرِ بَعْدَ إِذْ جَاءَنِي ۗ وَكَانَ الشَّيْطَانُ لِلْإِنْسَانِ خَذُولًا",
      "verseStringB": "Certainly he led me astray from the Reminder after it had come to me. And the devil ever deserts man."
    },
    {
      "verseNumber": 30,
      "verseString": "وَقَالَ الرَّسُولُ يَا رَبِّ إِنَّ قَوْمِي اتَّخَذُوا هَٰذَا الْقُرْآنَ مَهْجُورًا",
      "verseStringB": "And the Messenger will say: My Lord, surely my people treat this Qur’ān as a forsaken thing."
    },
    {
      "verseNumber": 31,
      "verseString": "وَكَذَٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا مِنَ الْمُجْرِمِينَ ۗ وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا",
      "verseStringB": "And thus have We made for every prophet an enemy from among the guilty, and sufficient is thy Lord as a Guide and a Helper."
    },
    {
      "verseNumber": 32,
      "verseString": "وَقَالَ الَّذِينَ كَفَرُوا لَوْلَا نُزِّلَ عَلَيْهِ الْقُرْآنُ جُمْلَةً وَاحِدَةً ۚ كَذَٰلِكَ لِنُثَبِّتَ بِهِ فُؤَادَكَ ۖ وَرَتَّلْنَاهُ تَرْتِيلًا",
      "verseStringB": "And those who disbelieve say: Why has not the Qur’ān been revealed to him all at once? Thus, that We may strengthen thy heart thereby and We have arranged it well in arranging.ᵃ"
    },
    {
      "verseNumber": 33,
      "verseString": "وَلَا يَأْتُونَكَ بِمَثَلٍ إِلَّا جِئْنَاكَ بِالْحَقِّ وَأَحْسَنَ تَفْسِيرًا",
      "verseStringB": "And they cannot bring thee a question, but We have brought thee the truth and the best explanation.ᵃ"
    },
    {
      "verseNumber": 34,
      "verseString": "الَّذِينَ يُحْشَرُونَ عَلَىٰ وُجُوهِهِمْ إِلَىٰ جَهَنَّمَ أُولَٰئِكَ شَرٌّ مَكَانًا وَأَضَلُّ سَبِيلًا",
      "verseStringB": "Those who will be gathered to hell on their faces — they are in an evil plight and straying farther away from the path."
    },
    {
      "verseNumber": 35,
      "verseString": "وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ وَجَعَلْنَا مَعَهُ أَخَاهُ هَارُونَ وَزِيرًا",
      "verseStringB": "And certainly We gave Moses the Book and We appointed with him his brother Aaron, an aider."
    },
    {
      "verseNumber": 36,
      "verseString": "فَقُلْنَا اذْهَبَا إِلَى الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِنَا فَدَمَّرْنَاهُمْ تَدْمِيرًا",
      "verseStringB": "Then We said: Go you both to the people who reject Our messages. So We destroyed them with utter destruction."
    },
    {
      "verseNumber": 37,
      "verseString": "وَقَوْمَ نُوحٍ لَمَّا كَذَّبُوا الرُّسُلَ أَغْرَقْنَاهُمْ وَجَعَلْنَاهُمْ لِلنَّاسِ آيَةً ۖ وَأَعْتَدْنَا لِلظَّالِمِينَ عَذَابًا أَلِيمًا",
      "verseStringB": "And the people of Noah, when they rejected the messengers, We drowned them, and made them a sign for men. And We have prepared a painful chastisement for the wrongdoers —"
    },
    {
      "verseNumber": 38,
      "verseString": "وَعَادًا وَثَمُودَ وَأَصْحَابَ الرَّسِّ وَقُرُونًا بَيْنَ ذَٰلِكَ كَثِيرًا",
      "verseStringB": "And ‘ād and Tham∂d and the dwellers of Rass and many generations in between.ᵃ"
    },
    {
      "verseNumber": 39,
      "verseString": "وَكُلًّا ضَرَبْنَا لَهُ الْأَمْثَالَ ۖ وَكُلًّا تَبَّرْنَا تَتْبِيرًا",
      "verseStringB": "And to each We gave examples and each did We destroy with utter destruction.ᵃ"
    },
    {
      "verseNumber": 40,
      "verseString": "وَلَقَدْ أَتَوْا عَلَى الْقَرْيَةِ الَّتِي أُمْطِرَتْ مَطَرَ السَّوْءِ ۚ أَفَلَمْ يَكُونُوا يَرَوْنَهَا ۚ بَلْ كَانُوا لَا يَرْجُونَ نُشُورًا",
      "verseStringB": "And indeed they pass by the town wherein was rained an evil rain.ᵃ Do they not see it? Nay, they hope not to be raised again."
    },
    {
      "verseNumber": 41,
      "verseString": "وَإِذَا رَأَوْكَ إِنْ يَتَّخِذُونَكَ إِلَّا هُزُوًا أَهَٰذَا الَّذِي بَعَثَ اللَّهُ رَسُولًا",
      "verseStringB": "And when they see thee, they take thee for naught but a jest: Is this he whom Allāh has raised to be a messenger?"
    },
    {
      "verseNumber": 42,
      "verseString": "إِنْ كَادَ لَيُضِلُّنَا عَنْ آلِهَتِنَا لَوْلَا أَنْ صَبَرْنَا عَلَيْهَا ۚ وَسَوْفَ يَعْلَمُونَ حِينَ يَرَوْنَ الْعَذَابَ مَنْ أَضَلُّ سَبِيلًا",
      "verseStringB": "He had well-nigh led us astray from our gods had we not adhered to them patiently! And they will know, when they see the chastisement, who is more astray from the path."
    },
    {
      "verseNumber": 43,
      "verseString": "أَرَأَيْتَ مَنِ اتَّخَذَ إِلَٰهَهُ هَوَاهُ أَفَأَنْتَ تَكُونُ عَلَيْهِ وَكِيلًا",
      "verseStringB": "Hast thou seen him who takes his low desires for his god? a Wilt thou be a guardian over him?"
    },
    {
      "verseNumber": 44,
      "verseString": "أَمْ تَحْسَبُ أَنَّ أَكْثَرَهُمْ يَسْمَعُونَ أَوْ يَعْقِلُونَ ۚ إِنْ هُمْ إِلَّا كَالْأَنْعَامِ ۖ بَلْ هُمْ أَضَلُّ سَبِيلًا",
      "verseStringB": "Or thinkest thou that most of them hear or understand? They are but as the cattle; nay, they are farther astray from the path."
    },
    {
      "verseNumber": 45,
      "verseString": "أَلَمْ تَرَ إِلَىٰ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ وَلَوْ شَاءَ لَجَعَلَهُ سَاكِنًا ثُمَّ جَعَلْنَا الشَّمْسَ عَلَيْهِ دَلِيلًا",
      "verseStringB": "Seest thou not how thy Lord extends the shade? And if He pleased, He would have made it stationary. Then We have made the sun an indication of it,"
    },
    {
      "verseNumber": 46,
      "verseString": "ثُمَّ قَبَضْنَاهُ إِلَيْنَا قَبْضًا يَسِيرًا",
      "verseStringB": "Then We take it to Ourselves, taking little by little.ᵃ"
    },
    {
      "verseNumber": 47,
      "verseString": "وَهُوَ الَّذِي جَعَلَ لَكُمُ اللَّيْلَ لِبَاسًا وَالنَّوْمَ سُبَاتًا وَجَعَلَ النَّهَارَ نُشُورًا",
      "verseStringB": "And He it is Who made the night a covering for you, and sleep a rest, and He made the day to rise up again."
    },
    {
      "verseNumber": 48,
      "verseString": "وَهُوَ الَّذِي أَرْسَلَ الرِّيَاحَ بُشْرًا بَيْنَ يَدَيْ رَحْمَتِهِ ۚ وَأَنْزَلْنَا مِنَ السَّمَاءِ مَاءً طَهُورًا",
      "verseStringB": "And He it is Who sends the winds as good news before His mercy; and We send down pure water from the clouds,"
    },
    {
      "verseNumber": 49,
      "verseString": "لِنُحْيِيَ بِهِ بَلْدَةً مَيْتًا وَنُسْقِيَهُ مِمَّا خَلَقْنَا أَنْعَامًا وَأَنَاسِيَّ كَثِيرًا",
      "verseStringB": "That We may give life thereby to a dead land,ᵃ and give it for drink to cattle and many people that We have created."
    },
    {
      "verseNumber": 50,
      "verseString": "وَلَقَدْ صَرَّفْنَاهُ بَيْنَهُمْ لِيَذَّكَّرُوا فَأَبَىٰ أَكْثَرُ النَّاسِ إِلَّا كُفُورًا",
      "verseStringB": "And certainly We repeat this to them that they may be mindful, but most men consent to naught but denying."
    },
    {
      "verseNumber": 51,
      "verseString": "وَلَوْ شِئْنَا لَبَعَثْنَا فِي كُلِّ قَرْيَةٍ نَذِيرًا",
      "verseStringB": "And if We pleased, We could raise a warner in every town.ᵃ"
    },
    {
      "verseNumber": 52,
      "verseString": "فَلَا تُطِعِ الْكَافِرِينَ وَجَاهِدْهُمْ بِهِ جِهَادًا كَبِيرًا",
      "verseStringB": "So obey not the disbelievers, and strive against them a mighty striving with it.ᵃ"
    },
    {
      "verseNumber": 53,
      "verseString": "وَهُوَ الَّذِي مَرَجَ الْبَحْرَيْنِ هَٰذَا عَذْبٌ فُرَاتٌ وَهَٰذَا مِلْحٌ أُجَاجٌ وَجَعَلَ بَيْنَهُمَا بَرْزَخًا وَحِجْرًا مَحْجُورًا",
      "verseStringB": "And He it is Who has made the two seas to flow freely, the one sweet, very sweet, and the other saltish, bitter. And between the two He has made a barrier and inviolable obstruction.ᵃ"
    },
    {
      "verseNumber": 54,
      "verseString": "وَهُوَ الَّذِي خَلَقَ مِنَ الْمَاءِ بَشَرًا فَجَعَلَهُ نَسَبًا وَصِهْرًا ۗ وَكَانَ رَبُّكَ قَدِيرًا",
      "verseStringB": "And He it is Who has created man from water, then He has made for him blood-relationship and mar riage-relationship.ᵃ And thy Lord is ever Powerful."
    },
    {
      "verseNumber": 55,
      "verseString": "وَيَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَا يَنْفَعُهُمْ وَلَا يَضُرُّهُمْ ۗ وَكَانَ الْكَافِرُ عَلَىٰ رَبِّهِ ظَهِيرًا",
      "verseStringB": "And they serve besides Allāh that which can neither profit them, nor harm them. And the disbeliever is ever an aider against his Lord.ᵃ"
    },
    {
      "verseNumber": 56,
      "verseString": "وَمَا أَرْسَلْنَاكَ إِلَّا مُبَشِّرًا وَنَذِيرًا",
      "verseStringB": "And We have not sent thee but as a giver of good news and as a warner."
    },
    {
      "verseNumber": 57,
      "verseString": "قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ إِلَّا مَنْ شَاءَ أَنْ يَتَّخِذَ إِلَىٰ رَبِّهِ سَبِيلًا",
      "verseStringB": "Say: I ask of you naught in return for it except that he who will may take a way to his Lord."
    },
    {
      "verseNumber": 58,
      "verseString": "وَتَوَكَّلْ عَلَى الْحَيِّ الَّذِي لَا يَمُوتُ وَسَبِّحْ بِحَمْدِهِ ۚ وَكَفَىٰ بِهِ بِذُنُوبِ عِبَادِهِ خَبِيرًا",
      "verseStringB": "And rely on the Ever-Living Who dies not, and celebrate His praise. And sufficient is He as being Aware of His servants’ sins,ᵃ"
    },
    {
      "verseNumber": 59,
      "verseString": "الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۚ الرَّحْمَٰنُ فَاسْأَلْ بِهِ خَبِيرًا",
      "verseStringB": "Who created the heavens and the earth and what is between them in six periods, and He is established on the Throne of Power, the Beneficent. So ask respecting Him one aware.ᵃ"
    },
    {
      "verseNumber": 60,
      "verseString": "وَإِذَا قِيلَ لَهُمُ اسْجُدُوا لِلرَّحْمَٰنِ قَالُوا وَمَا الرَّحْمَٰنُ أَنَسْجُدُ لِمَا تَأْمُرُنَا وَزَادَهُمْ نُفُورًا ۩",
      "verseStringB": "And when it is said to them: Make obeisance to the Beneficent, they say: And what is the Beneficent? Shall we make obeisance to what thou biddest us? And it adds to their aversion.ᵃ"
    },
    {
      "verseNumber": 61,
      "verseString": "تَبَارَكَ الَّذِي جَعَلَ فِي السَّمَاءِ بُرُوجًا وَجَعَلَ فِيهَا سِرَاجًا وَقَمَرًا مُنِيرًا",
      "verseStringB": "Blessed is He Who made the stars in the heavens and made therein a sun and a moon giving light!"
    },
    {
      "verseNumber": 62,
      "verseString": "وَهُوَ الَّذِي جَعَلَ اللَّيْلَ وَالنَّهَارَ خِلْفَةً لِمَنْ أَرَادَ أَنْ يَذَّكَّرَ أَوْ أَرَادَ شُكُورًا",
      "verseStringB": "And He it is, Who made the night and the day to follow each other, for him who desires to be mindful or desires to be thankful.ᵃ"
    },
    {
      "verseNumber": 63,
      "verseString": "وَعِبَادُ الرَّحْمَٰنِ الَّذِينَ يَمْشُونَ عَلَى الْأَرْضِ هَوْنًا وَإِذَا خَاطَبَهُمُ الْجَاهِلُونَ قَالُوا سَلَامًا",
      "verseStringB": "And the servants of the Beneficent are they who walk on the earth in humility, and when the ignorant address them, they say, Peace!ᵃ"
    },
    {
      "verseNumber": 64,
      "verseString": "وَالَّذِينَ يَبِيتُونَ لِرَبِّهِمْ سُجَّدًا وَقِيَامًا",
      "verseStringB": "And they who pass the night prostrating themselves before their Lord and standing."
    },
    {
      "verseNumber": 65,
      "verseString": "وَالَّذِينَ يَقُولُونَ رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ ۖ إِنَّ عَذَابَهَا كَانَ غَرَامًا",
      "verseStringB": "And they who say: Our Lord, avert from us the chastisement of hell; surely the chastisement thereof is a lasting evil:"
    },
    {
      "verseNumber": 66,
      "verseString": "إِنَّهَا سَاءَتْ مُسْتَقَرًّا وَمُقَامًا",
      "verseStringB": "It is surely an evil abode and resting-place!"
    },
    {
      "verseNumber": 67,
      "verseString": "وَالَّذِينَ إِذَا أَنْفَقُوا لَمْ يُسْرِفُوا وَلَمْ يَقْتُرُوا وَكَانَ بَيْنَ ذَٰلِكَ قَوَامًا",
      "verseStringB": "And they who, when they spend, are neither extravagant nor parsimonious, and the just mean is ever between these."
    },
    {
      "verseNumber": 68,
      "verseString": "وَالَّذِينَ لَا يَدْعُونَ مَعَ اللَّهِ إِلَٰهًا آخَرَ وَلَا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ وَلَا يَزْنُونَ ۚ وَمَنْ يَفْعَلْ ذَٰلِكَ يَلْقَ أَثَامًا",
      "verseStringB": "And they who call not upon another god with Allāh and slay not the soul which Allāh has forbidden, except in the cause of justice, nor commit fornication; and he who does this shall meet a requital of sin —"
    },
    {
      "verseNumber": 69,
      "verseString": "يُضَاعَفْ لَهُ الْعَذَابُ يَوْمَ الْقِيَامَةِ وَيَخْلُدْ فِيهِ مُهَانًا",
      "verseStringB": "The chastisement will be doubled to him on the day of Resurrec tion, and he will abide therein in abase - ment —"
    },
    {
      "verseNumber": 70,
      "verseString": "إِلَّا مَنْ تَابَ وَآمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَأُولَٰئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا",
      "verseStringB": "Except him who repents and believes and does good deeds; for such Allāh changes their evil deeds to good ones.ᵃ And Allāh is ever Forgiving, Merciful."
    },
    {
      "verseNumber": 71,
      "verseString": "وَمَنْ تَابَ وَعَمِلَ صَالِحًا فَإِنَّهُ يَتُوبُ إِلَى اللَّهِ مَتَابًا",
      "verseStringB": "And whoever repents and does good, he surely turns to Allāh a (goodly) turning."
    },
    {
      "verseNumber": 72,
      "verseString": "وَالَّذِينَ لَا يَشْهَدُونَ الزُّورَ وَإِذَا مَرُّوا بِاللَّغْوِ مَرُّوا كِرَامًا",
      "verseStringB": "And they who witness no falsehood, and when they pass by what is vain, they pass by nobly.ᵃ"
    },
    {
      "verseNumber": 73,
      "verseString": "وَالَّذِينَ إِذَا ذُكِّرُوا بِآيَاتِ رَبِّهِمْ لَمْ يَخِرُّوا عَلَيْهَا صُمًّا وَعُمْيَانًا",
      "verseStringB": "And they who, when reminded of the messages of their Lord, fall not down thereat deaf and blind."
    },
    {
      "verseNumber": 74,
      "verseString": "وَالَّذِينَ يَقُولُونَ رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
      "verseStringB": "And they who say, Our Lord, grant us in our wives and our offspring the joy of our eyes, and make us leaders for those who guard against evil."
    },
    {
      "verseNumber": 75,
      "verseString": "أُولَٰئِكَ يُجْزَوْنَ الْغُرْفَةَ بِمَا صَبَرُوا وَيُلَقَّوْنَ فِيهَا تَحِيَّةً وَسَلَامًا",
      "verseStringB": "These are rewarded with high places because they are patient, and are met therein with greetings and salutation,ᵃ"
    },
    {
      "verseNumber": 76,
      "verseString": "خَالِدِينَ فِيهَا ۚ حَسُنَتْ مُسْتَقَرًّا وَمُقَامًا",
      "verseStringB": "Abiding therein. Goodly the abode and the resting-place!"
    },
    {
      "verseNumber": 77,
      "verseString": "قُلْ مَا يَعْبَأُ بِكُمْ رَبِّي لَوْلَا دُعَاؤُكُمْ ۖ فَقَدْ كَذَّبْتُمْ فَسَوْفَ يَكُونُ لِزَامًا",
      "verseStringB": "Say: My Lord would not care for you, were it not for your prayer. Now indeed you have rejected, so the punishment will come"
    }
  ],
  "nameEnglish": "The Criterion",
  "nameTrans": "al-Furqan",
  "nameArabic": "الفرقان",
  "chapterNumber": 25,
  "nVerses": 77,
  "footnotes": [
    {
      "note": "1a. Furqån (Discrimination, Criterion) is one of the names of the Holy Qur’ån  because of the distinction which it brings about between truth and falsehood; see  2:185c. As this chapter deals with the mighty transformation which the Holy Qur’ån had  brought about in the lives of the people, as shown in the last section, it is mentioned here  by the name Furqån. The addition of the words that the Prophet may be a warner to the  nations is to show that the transformation which was being brought about in Arabia  would ultimately extend over the whole world and all nations would benefit.\n\n  2a. Vv. 2 and 3 speak of the different kinds of the polytheistic beliefs prevailing in  the world, which were all destined to be swept away by the doctrine of Divine Unity as  preached by Islåm.\n\n  5a. In the previous verse, their allegation is that the Qur’ån is a forgery; here they  allege that the Prophet had caused some stories of the ancients to be written down by some  people who helped him and it was these stories which were recited to him and which he  gave out as a revelation from on High. How could mere stories bring about the transformation which the Holy Qur’ån was working in the hearts of men? Attention to this is drawn  in the next verse.\n\n  6a. The secrets of the heavens and the earth which are known to God alone include  the secrets of human nature. Transformation in men’s lives has always been brought  about by means of Divine revelation, and mortal efforts have ever failed in changing the  hearts of men.\n\n  7a. The Prophet’s life was one of the utmost simplicity. He did all his work himself.  He aided his wives in their household duties, mended his clothes, tied up the goats, and  even cobbled his sandals. Nay, his kind and genial nature often led him to do other’s  work. Once a woman, unable to work for herself, asked him to lead her into a certain  street; he accompanied her there, only taking leave when her work was accomplished.  He was a mortal, and partook of the ordinary food of a simple Arab. Hence they speak  of him as eating food. The answer to this is given in v. 20, viz., that all prophets were  mortal and subject to human laws, even as the Holy Prophet.\n\n  8a. Their idea of a messenger of God was that he should be rolling in wealth. In  fact, wealth was all in all to them and they paid no consideration to the moral, the higher, values of life for which the Prophet came. They were at the same time told that,  though the Muslims had to suffer privations, they would be rewarded for their sacrifices  in this very life. Treasures were placed at the feet of the companions of the Holy  Prophet, and they were given gardens. But all this happened in accordance with Divine  law, which requires the fulfilment of prophecy to be brought about gradually, even as it  requires all growth to be gradual in the physical world.\n\n  9a. Elsewhere, the disbelievers are quoted as saying: “Why was not this Qur’ån  revealed to a man of importance in the two towns?” (43:31). Nothing except rank or  wealth had any importance in their eyes, so narrow was their outlook on life. Their very  conception of the real values of life was wrong, so they could not find a way.\n\n   10a. These words contain a clear prophecy that the Prophet and his followers will  receive the good things of this life too. The gardens of Mesopotamia, the palaces of  Persia and of the Caesars, were given to the companions of the Holy Prophet.\n\n  16a. The Garden is promised to the faithful but they should pray to their Lord for its  bestowal, because prayer to God is the means by which it can be attained.\n\n  18a. The words it was not beseeming for us that we should take for protectors  others besides Thee show that those who worshipped God alone could not ask their  followers to worship others than God. The reference is clearly to Jesus Christ.\n\n  20a. This is an injunction to the Muslims to bear the persecutions of their opponents  patiently, for these trials will distinguish the bad from the good. The concluding words  are a solace to them: Thy Lord is ever Seeing — He will punish the oppressors.\n\n  21a. The coming of the angels and the Lord signifies the coming of the threatened  punishment, and the next verse makes it clear; see 2:210a.\n\n  22a. The words √ijr-an ma√j∂r-an (“strong barrier”) may bear different interpretations according as they are taken to be spoken by the angels or by the guilty. In the former case, the meaning is that good news will be a forbidden thing to the guilty, which is  equivalent to saying that they will be punished. In the latter case, the words are a kind of  prayer for the coming of a barrier between them and their punishment.\n\n  23a. All the exertions of the Quraish were brought to naught in the battle of Badr,  and all attempts to uproot Truth are dealt with similarly.\n\n  25a. This description of the day of Badr is also given in 8:11, where the falling of  rain is clearly mentioned, and on the same occasion is also mentioned the coming of the  angels. The next verse shows that it will be a day of victory for the Muslims, the believers in the Beneficent, and a hard day for the disbelievers. In fact, the distress and hardship the Quraish experienced in the battle of Badr were not tasted by them in any of  their subsequent encounters with the Muslims.\n\n  27a. Commentators have here mentioned the names of some people who fought  with the Prophet at Badr. But the statement is general and the evildoer often regrets the  evil he did, when he suffers the consequences of the evil done.\n\n  32a. Rattala means he put together and arranged well the component parts of the  speech (LL). The Qur’ån was revealed piecemeal so that, under the varying circumstances through which the Prophet passed, the Divine revelation might be a source of  strength to his heart; and then, as it were, to refute any suggestion that the revelation  might remain a disorderly collection of fragments revealed under different circumstances, having no connection with each other, it is added that the entire arrangement  was also Divinely accomplished. The arrangement of the Qur’ån, according to this  verse, was a part of the Divine scheme, brought about in the lifetime of the Holy  Prophet, who was the recipient of the Divine revelation.\n\n  33a. Mathal (“question”) signifies a description, state, or case, and is metaphorically applied to a state or condition that is strange or wonderful (LL), or it means √ujjat,  i.e., an argument (T). The meaning is that they cannot bring any strange question (Kf)  or strange objection (JB) which has not been answered in the Holy Qur’ån with truth,  and of which the best explanation is not given therein. The verse lays down the basis of  an important principle, viz., that the Holy Qur’ån not only contains answers to all objections against it, but also adduces arguments of the truth of the assertions made. No other  religious book of the world satisfies this requirement, which circumstance alone places  the Qur’ån above all scriptures, and points to it as a unique revelation capable of satisfying the spiritual requirements of all men in all times.\n\n  38a. According to Zj, Rass was a country in which a part of the tribe of Tham∂d  resided; others say that Rass is the name of a town in Yamåmah (T). Rass also means a  well, and it is said that they were a people who threw their prophet into a well (JB).\n\n  39a. The meaning is that every one of these generations was warned of its doom by  citing examples of those who had previously perished, but, not heeding the warning, was  destroyed.  40a. This town is Sodom, which was situated on the way to Syria.\n\n  43a. This verse shows how broad is the idea of shirk or polytheism according to the  Holy Qur’ån. It is not simply worship of idols that is condemned, but blindly following  one’s desires is equally condemned. Many men who consider themselves the servants of the  One God really bow in submission before the greatest of their idols, i.e., their desire. The  monotheistic doctrine has here been brought to a perfection not to be met with elsewhere.\n\n  46a. This and the previous verse show that Allåh deals mercifully with His servants.  He would not destroy them all at once. The sun of righteousness had risen, and there were  clear indications that the shadows of darkness would disappear, but, as in physical nature,  they would not disappear suddenly, but gradually, diminishing little by little.\n\n  49a. The mercy of Allåh, which appears in the form of rain in physical nature, comes  spiritually in the form of revelation. As the pure water from the clouds gives life to a dead  land, so does the pure water of revelation from Him raise the spiritually dead to life.\n\n  51a. The companions of the Holy Prophet no doubt had this in mind when they spread  far and wide, taking his message and warning to every distant town. How few Muslims there  are today who are inspired with that zeal to prove the truth of every word of the Qur’ån!  It should, however, be noted that the verse does not contradict the statement in  35:24, and elsewhere, that a prophet was raised among every nation. The chapter opens  with the statement that the Prophet was a warner to all nations. The statement made here  shows that, if God had pleased, He would have raised a warner in every town, but the  oneness of humanity, which was a grand object following upon the Oneness of God,  could not have thus been brought about. Hence the verse that follows requires a hard  striving on the part of the Prophet and his followers for this grand achievement.\n\n  52a. This verse affords a clear proof of the significance of the word jihåd, as used in  the Holy Qur’ån. Every exertion to spread the Truth is, according to this verse, a jihåd;  nay, it is called the jihåd kabßr (“mighty striving”) or the great jihåd. Fighting in  defence of religion received the name of jihåd, because under the circumstances it  became necessary for the Truth to live and prosper; if fighting had not been permitted,  Truth would surely have been uprooted. The commentators all accept this significance  of the word here. It should be noted that the greatest jihåd which a Muslim can carry on  is one by means of the Qur’ån, to which the personal pronoun it at the end of the  verse unquestionably refers, because it must be carried on by every Muslim under all  circumstances.\n\n  53a. Apparently the reference is to the sweet-water rivers flowing on earth or underground and to the saltish sea-water. But there is a deeper reference to the two lives  which man leads on earth, a sweet life of faith and goodness, which brings satisfaction  and peace to the mind, and a bitter life of faithlessness and wickedness, which ever  increases the thirst for material gains and never brings satisfaction to the mind of man.  Both existed in the world side by side, and so they would continue\n\n  54a. The passage seems to hint at the flight to Madßnah. The Prophet was related to  the Makkans through his father, and to the Madinans through his mother. As his bloodrelations had persecuted him and were bent upon killing him, he is now reminded of his  relationship through marriage to another people. It was no doubt due to some such hint  in the Divine revelation that the Prophet was searching, on the occasion of the pilgrimage, for adherents among the people of Madßnah.\n\n  55a. The disbeliever aided the cause of untruth, as against his Lord, while the  Prophet aimed at establishing the Truth in the world.\n\n  58a. So He knows best when to punish and whom to punish.\n\n  59a. The one aware is the Prophet, who possessed true knowledge of the Divine Being.\n\n  60a. The recitation of this verse is followed by an actual prostration; see 7:206a.\n\n   62a. The night is here spoken of as being the more opportune time for being mindful, i.e., for prayers, and the day for being thankful, i.e., for work and livelihood.\n\n  63a. From here to the end of the chapter is described the great transformation which  the Prophet had already brought about. The great qualities spoken of as being met with  in the servants of the Beneficent present a striking contrast with the evils which reigned  supreme in Arabia. They were an arrogant people, who trampled the rights of their  fellow-men under their feet, but the faithful now walked in humility and led lives of  lowliness, in which they had the greatest regard for others’ rights (v. 63). In the days of  ignorance they passed their nights in drunken orgies, but now they kept awake at night  in devotion and were instead drunk with the love of God (v. 64). In the days of  ignorance they spent money extravagantly, when it was a question of pride, and they did  not care for the poor dying of hunger, but now they saved every penny they could to  spend on others (v. 67). Formerly idols were worshipped in the land of Arabia, human  blood was shed on the slightest pretext, sex-relations were loose to an extreme, but they  had now become the torch-bearers of Divine Unity, for whose sake they willingly  suffered every privation, homicide was looked upon with abhorrence, the highest value  was placed on the chastity of men and women, and righteousness was the one thing in  which men and women vied one with another (vv. 68–71). Truth and faithfulness were  the great qualities that ruled men’s minds, in the new dispensation, and a life full of  vigour and earnestness was seen in the place of ignorance, superstition and immorality,  which were the chief features of pre-Islamic Arabia (vv. 72 –74).\n\n   70a. Here we are plainly told that the transformation had already been wrought; the  vices in which the people indulged erstwhile had been changed, to good and righteous  deeds, and those who found pleasure in evil deeds now found pleasure in the doing of  good. It was the soul-force of the Prophet that had wrought this miraculous transformation.\n\n  72a. They not only shunned falsehood but were now above everything that was vain  or futile.\n\n  75a. Apparently they were being expelled from their homes but they felt as if they  were being rewarded with high places, because their outlook on life was now spiritual  and not material. In addition to the greetings and salutations of the angels they were  promised greetings and salutations in their new centre of activity, Madßnah, whither they  were fleeing, because there a similar brotherhood of the righteous was now ready to  receive these emigrants.\n\n  77a. The Truth had finally been rejected by the Makkans, so the disgrace and abasement which was promised for the opponents of Truth was now awaiting them. The righteous were finally separated from the wicked, so the punishment must come.  "
    }
  ]
}
