{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "طسم",
      "verseStringB": "Benignant, Hearing, Knowing God!ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "تِلْكَ آيَاتُ الْكِتَابِ الْمُبِينِ",
      "verseStringB": "These are the verses of the Book that makes manifest."
    },
    {
      "verseNumber": 3,
      "verseString": "نَتْلُو عَلَيْكَ مِنْ نَبَإِ مُوسَىٰ وَفِرْعَوْنَ بِالْحَقِّ لِقَوْمٍ يُؤْمِنُونَ",
      "verseStringB": "We recite to thee the story of Moses and Pharaoh with truth, for a people who believe."
    },
    {
      "verseNumber": 4,
      "verseString": "إِنَّ فِرْعَوْنَ عَلَا فِي الْأَرْضِ وَجَعَلَ أَهْلَهَا شِيَعًا يَسْتَضْعِفُ طَائِفَةً مِنْهُمْ يُذَبِّحُ أَبْنَاءَهُمْ وَيَسْتَحْيِي نِسَاءَهُمْ ۚ إِنَّهُ كَانَ مِنَ الْمُفْسِدِينَ",
      "verseStringB": "Surely Pharaoh exalted himself in the land and made its people into parties, weakening one party from among them;ᵃ he slaughtered their sons and let their women live. Surely he was one of the mischief-makers."
    },
    {
      "verseNumber": 5,
      "verseString": "وَنُرِيدُ أَنْ نَمُنَّ عَلَى الَّذِينَ اسْتُضْعِفُوا فِي الْأَرْضِ وَنَجْعَلَهُمْ أَئِمَّةً وَنَجْعَلَهُمُ الْوَارِثِينَ",
      "verseStringB": "And We desired to bestow a favour upon those who were deemed weak in the land, and to make them the leaders, and to make them the heirs,ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "وَنُمَكِّنَ لَهُمْ فِي الْأَرْضِ وَنُرِيَ فِرْعَوْنَ وَهَامَانَ وَجُنُودَهُمَا مِنْهُمْ مَا كَانُوا يَحْذَرُونَ",
      "verseStringB": "And to grant them power in the land, and to make Pharaoh and Hāmān and their hosts see from them what they feared.ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "وَأَوْحَيْنَا إِلَىٰ أُمِّ مُوسَىٰ أَنْ أَرْضِعِيهِ ۖ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلَا تَخَافِي وَلَا تَحْزَنِي ۖ إِنَّا رَادُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ",
      "verseStringB": "And We revealed to Moses’ mother, saying: Give him suck; then when thou fearest for him, cast him into the river and fear not, nor grieve; surely We shall bring him back to thee and make him one of the messengers."
    },
    {
      "verseNumber": 8,
      "verseString": "فَالْتَقَطَهُ آلُ فِرْعَوْنَ لِيَكُونَ لَهُمْ عَدُوًّا وَحَزَنًا ۗ إِنَّ فِرْعَوْنَ وَهَامَانَ وَجُنُودَهُمَا كَانُوا خَاطِئِينَ",
      "verseStringB": "So Pharaoh’s people took him up that he might be an enemy and a grief for them.ᵃ Surely Pharaoh and Hāmān and their hosts were wrongdoers."
    },
    {
      "verseNumber": 9,
      "verseString": "وَقَالَتِ امْرَأَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِي وَلَكَ ۖ لَا تَقْتُلُوهُ عَسَىٰ أَنْ يَنْفَعَنَا أَوْ نَتَّخِذَهُ وَلَدًا وَهُمْ لَا يَشْعُرُونَ",
      "verseStringB": "And Pharaoh’s wife said: A refreshment of the eye to me and to thee — slay him not; maybe he will be useful to us, or we may take him for a son. And they perceived not."
    },
    {
      "verseNumber": 10,
      "verseString": "وَأَصْبَحَ فُؤَادُ أُمِّ مُوسَىٰ فَارِغًا ۖ إِنْ كَادَتْ لَتُبْدِي بِهِ لَوْلَا أَنْ رَبَطْنَا عَلَىٰ قَلْبِهَا لِتَكُونَ مِنَ الْمُؤْمِنِينَ",
      "verseStringB": "And the heart of Moses’ mother was free (from anxiety).ᵃ She would almost have disclosed it, had We not strengthened her heart, so that she might be of the believers."
    },
    {
      "verseNumber": 11,
      "verseString": "وَقَالَتْ لِأُخْتِهِ قُصِّيهِ ۖ فَبَصُرَتْ بِهِ عَنْ جُنُبٍ وَهُمْ لَا يَشْعُرُونَ",
      "verseStringB": "And she said to his sister: Follow him up. So she watched him from a distance, while they perceived not."
    },
    {
      "verseNumber": 12,
      "verseString": "وَحَرَّمْنَا عَلَيْهِ الْمَرَاضِعَ مِنْ قَبْلُ فَقَالَتْ هَلْ أَدُلُّكُمْ عَلَىٰ أَهْلِ بَيْتٍ يَكْفُلُونَهُ لَكُمْ وَهُمْ لَهُ نَاصِحُونَ",
      "verseStringB": "And We did not allow him to suck before, so she said: Shall I point out to you the people of a house who will bring him up for you, and they will wish him well?"
    },
    {
      "verseNumber": 13,
      "verseString": "فَرَدَدْنَاهُ إِلَىٰ أُمِّهِ كَيْ تَقَرَّ عَيْنُهَا وَلَا تَحْزَنَ وَلِتَعْلَمَ أَنَّ وَعْدَ اللَّهِ حَقٌّ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
      "verseStringB": "So We gave him back to his mother that her eye might be refreshed, and that she might not grieve, and that she might know that"
    },
    {
      "verseNumber": 14,
      "verseString": "وَلَمَّا بَلَغَ أَشُدَّهُ وَاسْتَوَىٰ آتَيْنَاهُ حُكْمًا وَعِلْمًا ۚ وَكَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ",
      "verseStringB": "And when he attained his maturity and became full-grown, We granted him wisdom and knowledge. And thus do We reward those who do good (to others)."
    },
    {
      "verseNumber": 15,
      "verseString": "وَدَخَلَ الْمَدِينَةَ عَلَىٰ حِينِ غَفْلَةٍ مِنْ أَهْلِهَا فَوَجَدَ فِيهَا رَجُلَيْنِ يَقْتَتِلَانِ هَٰذَا مِنْ شِيعَتِهِ وَهَٰذَا مِنْ عَدُوِّهِ ۖ فَاسْتَغَاثَهُ الَّذِي مِنْ شِيعَتِهِ عَلَى الَّذِي مِنْ عَدُوِّهِ فَوَكَزَهُ مُوسَىٰ فَقَضَىٰ عَلَيْهِ ۖ قَالَ هَٰذَا مِنْ عَمَلِ الشَّيْطَانِ ۖ إِنَّهُ عَدُوٌّ مُضِلٌّ مُبِينٌ",
      "verseStringB": "And he went into the city at a time of carelessness on the part of its people, so he found therein two men fighting — one being of his party and the other of his foes; and he who was of his party cried out to him for help against him who was of his enemies, so Moses struck him with his fist and killed him. He said: This is on account of the devil’s doing; surely he is an enemy, openly leading astray.ᵃ"
    },
    {
      "verseNumber": 16,
      "verseString": "قَالَ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَغَفَرَ لَهُ ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ",
      "verseStringB": "He said: My Lord, surely I have done harm to myself, so do Thou protect me; so He protected him.ᵃ Surely He is the Forgiving, the Merciful."
    },
    {
      "verseNumber": 17,
      "verseString": "قَالَ رَبِّ بِمَا أَنْعَمْتَ عَلَيَّ فَلَنْ أَكُونَ ظَهِيرًا لِلْمُجْرِمِينَ",
      "verseStringB": "He said: My Lord, because Thou hast bestowed a favour on me, I shall never be a backer of the guilty."
    },
    {
      "verseNumber": 18,
      "verseString": "فَأَصْبَحَ فِي الْمَدِينَةِ خَائِفًا يَتَرَقَّبُ فَإِذَا الَّذِي اسْتَنْصَرَهُ بِالْأَمْسِ يَسْتَصْرِخُهُ ۚ قَالَ لَهُ مُوسَىٰ إِنَّكَ لَغَوِيٌّ مُبِينٌ",
      "verseStringB": "And he was in the city, fearing, awaiting, when lo, he who had asked his assistance the day before was crying out to him for help. Moses said to him: Thou art surely one erring manifestly.ᵃ"
    },
    {
      "verseNumber": 19,
      "verseString": "فَلَمَّا أَنْ أَرَادَ أَنْ يَبْطِشَ بِالَّذِي هُوَ عَدُوٌّ لَهُمَا قَالَ يَا مُوسَىٰ أَتُرِيدُ أَنْ تَقْتُلَنِي كَمَا قَتَلْتَ نَفْسًا بِالْأَمْسِ ۖ إِنْ تُرِيدُ إِلَّا أَنْ تَكُونَ جَبَّارًا فِي الْأَرْضِ وَمَا تُرِيدُ أَنْ تَكُونَ مِنَ الْمُصْلِحِينَ",
      "verseStringB": "So when he desired to seize him who was an enemy to them both, he said: O Moses, dost thou intend to kill me as thou didst kill a person yesterday? Thou only desirest to be a tyrant in the land, and thou desirest not to be of those who act aright."
    },
    {
      "verseNumber": 20,
      "verseString": "وَجَاءَ رَجُلٌ مِنْ أَقْصَى الْمَدِينَةِ يَسْعَىٰ قَالَ يَا مُوسَىٰ إِنَّ الْمَلَأَ يَأْتَمِرُونَ بِكَ لِيَقْتُلُوكَ فَاخْرُجْ إِنِّي لَكَ مِنَ النَّاصِحِينَ",
      "verseStringB": "And a man came running from the remotest part of the city. He said: O Moses, the chiefs are consulting together to slay thee, so depart (at once); surely I am of those who wish thee well."
    },
    {
      "verseNumber": 21,
      "verseString": "فَخَرَجَ مِنْهَا خَائِفًا يَتَرَقَّبُ ۖ قَالَ رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ",
      "verseStringB": "So he went forth therefrom, fearing, awaiting. He said: My Lord, deliver me from the iniquitous people."
    },
    {
      "verseNumber": 22,
      "verseString": "وَلَمَّا تَوَجَّهَ تِلْقَاءَ مَدْيَنَ قَالَ عَسَىٰ رَبِّي أَنْ يَهْدِيَنِي سَوَاءَ السَّبِيلِ",
      "verseStringB": "And when he turned his face towards Midian, he said: Maybe my Lord will guide me in the right path."
    },
    {
      "verseNumber": 23,
      "verseString": "وَلَمَّا وَرَدَ مَاءَ مَدْيَنَ وَجَدَ عَلَيْهِ أُمَّةً مِنَ النَّاسِ يَسْقُونَ وَوَجَدَ مِنْ دُونِهِمُ امْرَأَتَيْنِ تَذُودَانِ ۖ قَالَ مَا خَطْبُكُمَا ۖ قَالَتَا لَا نَسْقِي حَتَّىٰ يُصْدِرَ الرِّعَاءُ ۖ وَأَبُونَا شَيْخٌ كَبِيرٌ",
      "verseStringB": "And when he came to the water of Midian, he found there a group of men watering, and he found besides them two women keeping back (their flocks). He said: What is the matter with you? They said: We cannot water until the shepherds take away (their sheep) from the water; and our father is a very old man."
    },
    {
      "verseNumber": 24,
      "verseString": "فَسَقَىٰ لَهُمَا ثُمَّ تَوَلَّىٰ إِلَى الظِّلِّ فَقَالَ رَبِّ إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ",
      "verseStringB": "So he watered (their sheep) for them, then went back to the shade, and said: My Lord, I stand in need of whatever good Thou mayest send to me."
    },
    {
      "verseNumber": 25,
      "verseString": "فَجَاءَتْهُ إِحْدَاهُمَا تَمْشِي عَلَى اسْتِحْيَاءٍ قَالَتْ إِنَّ أَبِي يَدْعُوكَ لِيَجْزِيَكَ أَجْرَ مَا سَقَيْتَ لَنَا ۚ فَلَمَّا جَاءَهُ وَقَصَّ عَلَيْهِ الْقَصَصَ قَالَ لَا تَخَفْ ۖ نَجَوْتَ مِنَ الْقَوْمِ الظَّالِمِينَ",
      "verseStringB": "Then one of the two women came to him walking bashfully. She said: My father a invites thee that he may reward thee for having watered for us. So when he came to him and related to him the story, he said: Fear not, thou art secure from the iniquitous people."
    },
    {
      "verseNumber": 26,
      "verseString": "قَالَتْ إِحْدَاهُمَا يَا أَبَتِ اسْتَأْجِرْهُ ۖ إِنَّ خَيْرَ مَنِ اسْتَأْجَرْتَ الْقَوِيُّ الْأَمِينُ",
      "verseStringB": "One of them said: O my father, employ him; surely the best of those that thou canst employ is the strong, the faithful one."
    },
    {
      "verseNumber": 27,
      "verseString": "قَالَ إِنِّي أُرِيدُ أَنْ أُنْكِحَكَ إِحْدَى ابْنَتَيَّ هَاتَيْنِ عَلَىٰ أَنْ تَأْجُرَنِي ثَمَانِيَ حِجَجٍ ۖ فَإِنْ أَتْمَمْتَ عَشْرًا فَمِنْ عِنْدِكَ ۖ وَمَا أُرِيدُ أَنْ أَشُقَّ عَلَيْكَ ۚ سَتَجِدُنِي إِنْ شَاءَ اللَّهُ مِنَ الصَّالِحِينَ",
      "verseStringB": "He said: I desire to marry one of these two daughters of mine to thee on condition that thou serve me for eight years; but, if thou complete ten, it will be of thy own free will, and I wish not to be hard on thee. If Allāh please, thou wilt find me one of the righteous.ᵃ"
    },
    {
      "verseNumber": 28,
      "verseString": "قَالَ ذَٰلِكَ بَيْنِي وَبَيْنَكَ ۖ أَيَّمَا الْأَجَلَيْنِ قَضَيْتُ فَلَا عُدْوَانَ عَلَيَّ ۖ وَاللَّهُ عَلَىٰ مَا نَقُولُ وَكِيلٌ",
      "verseStringB": "He said: That is (agreed) between me and thee; whichever of the two terms I fulfil, there will be no injustice to me; and Allāh is surety over what we say."
    },
    {
      "verseNumber": 29,
      "verseString": "فَلَمَّا قَضَىٰ مُوسَى الْأَجَلَ وَسَارَ بِأَهْلِهِ آنَسَ مِنْ جَانِبِ الطُّورِ نَارًا قَالَ لِأَهْلِهِ امْكُثُوا إِنِّي آنَسْتُ نَارًا لَعَلِّي آتِيكُمْ مِنْهَا بِخَبَرٍ أَوْ جَذْوَةٍ مِنَ النَّارِ لَعَلَّكُمْ تَصْطَلُونَ",
      "verseStringB": "Then when Moses had completed the term, and was travelling with his family, he perceived a fire on the side of the mountain. He said to his family: Wait, I see a fire; maybe I will bring to you from it some news or a brand of fire, so that you may warm yourselves."
    },
    {
      "verseNumber": 30,
      "verseString": "فَلَمَّا أَتَاهَا نُودِيَ مِنْ شَاطِئِ الْوَادِ الْأَيْمَنِ فِي الْبُقْعَةِ الْمُبَارَكَةِ مِنَ الشَّجَرَةِ أَنْ يَا مُوسَىٰ إِنِّي أَنَا اللَّهُ رَبُّ الْعَالَمِينَ",
      "verseStringB": "And when he came to it, he was called from the right side of the valley in the blessed spot of the bush: O Moses, surely I am Allāh, the Lord of the worlds:"
    },
    {
      "verseNumber": 31,
      "verseString": "وَأَنْ أَلْقِ عَصَاكَ ۖ فَلَمَّا رَآهَا تَهْتَزُّ كَأَنَّهَا جَانٌّ وَلَّىٰ مُدْبِرًا وَلَمْ يُعَقِّبْ ۚ يَا مُوسَىٰ أَقْبِلْ وَلَا تَخَفْ ۖ إِنَّكَ مِنَ الْآمِنِينَ",
      "verseStringB": "And cast down thy rod. So when he saw it in motion as if it were a erpent, he turned away retreating, and looked not back. O Moses, come forward and fear not; surely thou art of those who are secure."
    },
    {
      "verseNumber": 32,
      "verseString": "اسْلُكْ يَدَكَ فِي جَيْبِكَ تَخْرُجْ بَيْضَاءَ مِنْ غَيْرِ سُوءٍ وَاضْمُمْ إِلَيْكَ جَنَاحَكَ مِنَ الرَّهْبِ ۖ فَذَانِكَ بُرْهَانَانِ مِنْ رَبِّكَ إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ ۚ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ",
      "verseStringB": "Insert thy hand into thy bosom, it will come forth white without evil, and remain calm in fear. These two are two arguments from thy Lord to Pharaoh and his chiefs. Surely they are a transgressing people.ᵃ"
    },
    {
      "verseNumber": 33,
      "verseString": "قَالَ رَبِّ إِنِّي قَتَلْتُ مِنْهُمْ نَفْسًا فَأَخَافُ أَنْ يَقْتُلُونِ",
      "verseStringB": "He said: My Lord, I killed one of them, so I fear lest they slay me."
    },
    {
      "verseNumber": 34,
      "verseString": "وَأَخِي هَارُونُ هُوَ أَفْصَحُ مِنِّي لِسَانًا فَأَرْسِلْهُ مَعِيَ رِدْءًا يُصَدِّقُنِي ۖ إِنِّي أَخَافُ أَنْ يُكَذِّبُونِ",
      "verseStringB": "And my brother, Aaron, he is more eloquent in speech than I, so send him with me as a helper to confirm me. Surely I fear that they would reject me."
    },
    {
      "verseNumber": 35,
      "verseString": "قَالَ سَنَشُدُّ عَضُدَكَ بِأَخِيكَ وَنَجْعَلُ لَكُمَا سُلْطَانًا فَلَا يَصِلُونَ إِلَيْكُمَا ۚ بِآيَاتِنَا أَنْتُمَا وَمَنِ اتَّبَعَكُمَا الْغَالِبُونَ",
      "verseStringB": "He said: We will strengthen thine arm with thy brother, and We will give you both an authority, so that they shall not reach you.ᵃ With Our signs, you two and those who follow you, will triumph."
    },
    {
      "verseNumber": 36,
      "verseString": "فَلَمَّا جَاءَهُمْ مُوسَىٰ بِآيَاتِنَا بَيِّنَاتٍ قَالُوا مَا هَٰذَا إِلَّا سِحْرٌ مُفْتَرًى وَمَا سَمِعْنَا بِهَٰذَا فِي آبَائِنَا الْأَوَّلِينَ",
      "verseStringB": "So when Moses came to them with Our clear signs, they said: This is nothing but forged enchantment, and we never heard of it among our fathers of old!"
    },
    {
      "verseNumber": 37,
      "verseString": "وَقَالَ مُوسَىٰ رَبِّي أَعْلَمُ بِمَنْ جَاءَ بِالْهُدَىٰ مِنْ عِنْدِهِ وَمَنْ تَكُونُ لَهُ عَاقِبَةُ الدَّارِ ۖ إِنَّهُ لَا يُفْلِحُ الظَّالِمُونَ",
      "verseStringB": "And Moses said: My Lord knows best who comes with guidance from Him, and whose shall be the good end of the abode. Surely the wrongdoers will not be successful."
    },
    {
      "verseNumber": 38,
      "verseString": "وَقَالَ فِرْعَوْنُ يَا أَيُّهَا الْمَلَأُ مَا عَلِمْتُ لَكُمْ مِنْ إِلَٰهٍ غَيْرِي فَأَوْقِدْ لِي يَا هَامَانُ عَلَى الطِّينِ فَاجْعَلْ لِي صَرْحًا لَعَلِّي أَطَّلِعُ إِلَىٰ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُ مِنَ الْكَاذِبِينَ",
      "verseStringB": "And Pharaoh said: O chiefs, I know no god for you besides myself; so kindle a fire for me, O Hāmān, on (bricks of) clay, then prepare for me a lofty building, so that I may obtain knowledge of Moses’ God, and surely I think him a liar.ᵃ"
    },
    {
      "verseNumber": 39,
      "verseString": "وَاسْتَكْبَرَ هُوَ وَجُنُودُهُ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَظَنُّوا أَنَّهُمْ إِلَيْنَا لَا يُرْجَعُونَ",
      "verseStringB": "And he was unjustly proud in the land, he and his hosts, and they deemed that they would not be brought back to Us."
    },
    {
      "verseNumber": 40,
      "verseString": "فَأَخَذْنَاهُ وَجُنُودَهُ فَنَبَذْنَاهُمْ فِي الْيَمِّ ۖ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الظَّالِمِينَ",
      "verseStringB": "So We caught hold of him and his hosts, then We cast them into the sea, and see what was the end of the iniquitous."
    },
    {
      "verseNumber": 41,
      "verseString": "وَجَعَلْنَاهُمْ أَئِمَّةً يَدْعُونَ إِلَى النَّارِ ۖ وَيَوْمَ الْقِيَامَةِ لَا يُنْصَرُونَ",
      "verseStringB": "And We made them leaders who call to the Fire, and on the day of Resurrection they will not be helped.ᵃ"
    },
    {
      "verseNumber": 42,
      "verseString": "وَأَتْبَعْنَاهُمْ فِي هَٰذِهِ الدُّنْيَا لَعْنَةً ۖ وَيَوْمَ الْقِيَامَةِ هُمْ مِنَ الْمَقْبُوحِينَ",
      "verseStringB": "And We made a curse to follow them in this world, and on the day of Resurrection they will be hideous."
    },
    {
      "verseNumber": 43,
      "verseString": "وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ مِنْ بَعْدِ مَا أَهْلَكْنَا الْقُرُونَ الْأُولَىٰ بَصَائِرَ لِلنَّاسِ وَهُدًى وَرَحْمَةً لَعَلَّهُمْ يَتَذَكَّرُونَ",
      "verseStringB": "And certainly We gave Moses the Book after We had destroyed the former generations — clear arguments for men and a guidance and a mercy, that they may be mindful."
    },
    {
      "verseNumber": 44,
      "verseString": "وَمَا كُنْتَ بِجَانِبِ الْغَرْبِيِّ إِذْ قَضَيْنَا إِلَىٰ مُوسَى الْأَمْرَ وَمَا كُنْتَ مِنَ الشَّاهِدِينَ",
      "verseStringB": "And thou wast not on the western side when We revealed to Moses the commandment, nor wast thou among those present;ᵃ"
    },
    {
      "verseNumber": 45,
      "verseString": "وَلَٰكِنَّا أَنْشَأْنَا قُرُونًا فَتَطَاوَلَ عَلَيْهِمُ الْعُمُرُ ۚ وَمَا كُنْتَ ثَاوِيًا فِي أَهْلِ مَدْيَنَ تَتْلُو عَلَيْهِمْ آيَاتِنَا وَلَٰكِنَّا كُنَّا مُرْسِلِينَ",
      "verseStringB": "But We raised up generations, then life became prolonged to them. And thou wast not dwelling among the people of Midian,ᵃ reciting to them Our messages, but We are the Sender (of messengers)."
    },
    {
      "verseNumber": 46,
      "verseString": "وَمَا كُنْتَ بِجَانِبِ الطُّورِ إِذْ نَادَيْنَا وَلَٰكِنْ رَحْمَةً مِنْ رَبِّكَ لِتُنْذِرَ قَوْمًا مَا أَتَاهُمْ مِنْ نَذِيرٍ مِنْ قَبْلِكَ لَعَلَّهُمْ يَتَذَكَّرُونَ",
      "verseStringB": "And thou wast not at the side of the mountain when We called, but a mercy from thy Lord that thou mayest warn a people to whom no warner came before thee, that they may be mindful.ᵃ"
    },
    {
      "verseNumber": 47,
      "verseString": "وَلَوْلَا أَنْ تُصِيبَهُمْ مُصِيبَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ فَيَقُولُوا رَبَّنَا لَوْلَا أَرْسَلْتَ إِلَيْنَا رَسُولًا فَنَتَّبِعَ آيَاتِكَ وَنَكُونَ مِنَ الْمُؤْمِنِينَ",
      "verseStringB": "And lest, if a disaster should befall them for what their hands have sent before, they should say: Our Lord, why didst Thou not send to us a messenger so that we might have followed Thy messages and been of the believers?"
    },
    {
      "verseNumber": 48,
      "verseString": "فَلَمَّا جَاءَهُمُ الْحَقُّ مِنْ عِنْدِنَا قَالُوا لَوْلَا أُوتِيَ مِثْلَ مَا أُوتِيَ مُوسَىٰ ۚ أَوَلَمْ يَكْفُرُوا بِمَا أُوتِيَ مُوسَىٰ مِنْ قَبْلُ ۖ قَالُوا سِحْرَانِ تَظَاهَرَا وَقَالُوا إِنَّا بِكُلٍّ كَافِرُونَ",
      "verseStringB": "But (now) when the Truth has come to them from Us, they say: Why is he not given the like of what was given to Moses? Did they not disbelieve in that which was given to Moses before? They say: Two enchantments backing up each other! And they say: Surely we are dis - believers in both.ᵃ"
    },
    {
      "verseNumber": 49,
      "verseString": "قُلْ فَأْتُوا بِكِتَابٍ مِنْ عِنْدِ اللَّهِ هُوَ أَهْدَىٰ مِنْهُمَا أَتَّبِعْهُ إِنْ كُنْتُمْ صَادِقِينَ",
      "verseStringB": "Say: Then bring some (other) Book from Allāh which is a better guide than these two, I will follow it — if you are truthful.ᵃ"
    },
    {
      "verseNumber": 50,
      "verseString": "فَإِنْ لَمْ يَسْتَجِيبُوا لَكَ فَاعْلَمْ أَنَّمَا يَتَّبِعُونَ أَهْوَاءَهُمْ ۚ وَمَنْ أَضَلُّ مِمَّنِ اتَّبَعَ هَوَاهُ بِغَيْرِ هُدًى مِنَ اللَّهِ ۚ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ",
      "verseStringB": "But if they answer thee not, know that they only follow their low desires. And who is more erring than he who follows his low desires without any guidance from Allāh? Surely Allāh guides not the iniquitous people."
    },
    {
      "verseNumber": 51,
      "verseString": "وَلَقَدْ وَصَّلْنَا لَهُمُ الْقَوْلَ لَعَلَّهُمْ يَتَذَكَّرُونَ",
      "verseStringB": "And certainly We have made the Word to have many connections for their sake, so that they may be mindful.ᵃ"
    },
    {
      "verseNumber": 52,
      "verseString": "الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ مِنْ قَبْلِهِ هُمْ بِهِ يُؤْمِنُونَ",
      "verseStringB": "Those to whom We gave the Book before it, they are believers in it.ᵃ"
    },
    {
      "verseNumber": 53,
      "verseString": "وَإِذَا يُتْلَىٰ عَلَيْهِمْ قَالُوا آمَنَّا بِهِ إِنَّهُ الْحَقُّ مِنْ رَبِّنَا إِنَّا كُنَّا مِنْ قَبْلِهِ مُسْلِمِينَ",
      "verseStringB": "And when it is recited to them they say: We believe in it; surely it is the Truth from our Lord; we were indeed before this submitting ones."
    },
    {
      "verseNumber": 54,
      "verseString": "أُولَٰئِكَ يُؤْتَوْنَ أَجْرَهُمْ مَرَّتَيْنِ بِمَا صَبَرُوا وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ",
      "verseStringB": "These will be granted their reward twice, because they are steadfast, and they repel evil with good and spend out of what We have given them.ᵃ"
    },
    {
      "verseNumber": 55,
      "verseString": "وَإِذَا سَمِعُوا اللَّغْوَ أَعْرَضُوا عَنْهُ وَقَالُوا لَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ سَلَامٌ عَلَيْكُمْ لَا نَبْتَغِي الْجَاهِلِينَ",
      "verseStringB": "And when they hear idle talk, they turn aside from it and say: For us are our deeds and for you your deeds. Peace be to you! We desire not the ignorant."
    },
    {
      "verseNumber": 56,
      "verseString": "إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَٰكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ ۚ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ",
      "verseStringB": "Surely thou canst not guide whom thou lovest, but Allāh guides whom He pleases; and He knows best those who walk aright.ᵃ"
    },
    {
      "verseNumber": 57,
      "verseString": "وَقَالُوا إِنْ نَتَّبِعِ الْهُدَىٰ مَعَكَ نُتَخَطَّفْ مِنْ أَرْضِنَا ۚ أَوَلَمْ نُمَكِّنْ لَهُمْ حَرَمًا آمِنًا يُجْبَىٰ إِلَيْهِ ثَمَرَاتُ كُلِّ شَيْءٍ رِزْقًا مِنْ لَدُنَّا وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
      "verseStringB": "And they say: If we follow the guidance with thee, we should be carried off from our country. Have We not settled them in a safe, sacred territory to which fruits of every kind are drawn? A sustenance from Us — but most of them know not.ᵃ"
    },
    {
      "verseNumber": 58,
      "verseString": "وَكَمْ أَهْلَكْنَا مِنْ قَرْيَةٍ بَطِرَتْ مَعِيشَتَهَا ۖ فَتِلْكَ مَسَاكِنُهُمْ لَمْ تُسْكَنْ مِنْ بَعْدِهِمْ إِلَّا قَلِيلًا ۖ وَكُنَّا نَحْنُ الْوَارِثِينَ",
      "verseStringB": "And how many a town have We destroyed which exulted in its means of subsistence! So those are their abodes: they have not been dwelt in after them except a little. And We are ever the Inheritors.ᵃ"
    },
    {
      "verseNumber": 59,
      "verseString": "وَمَا كَانَ رَبُّكَ مُهْلِكَ الْقُرَىٰ حَتَّىٰ يَبْعَثَ فِي أُمِّهَا رَسُولًا يَتْلُو عَلَيْهِمْ آيَاتِنَا ۚ وَمَا كُنَّا مُهْلِكِي الْقُرَىٰ إِلَّا وَأَهْلُهَا ظَالِمُونَ",
      "verseStringB": "And thy Lord never destroyed the towns, until He had raised in their metropolis a messenger, reciting to them Our messages, and We never destroyed the towns except when their people were iniquitous."
    },
    {
      "verseNumber": 60,
      "verseString": "وَمَا أُوتِيتُمْ مِنْ شَيْءٍ فَمَتَاعُ الْحَيَاةِ الدُّنْيَا وَزِينَتُهَا ۚ وَمَا عِنْدَ اللَّهِ خَيْرٌ وَأَبْقَىٰ ۚ أَفَلَا تَعْقِلُونَ",
      "verseStringB": "And whatever things you have been given are only a provision of this world’s life and its adornment, and whatever is with Allāh is better and more lasting. Do you not then understand?"
    },
    {
      "verseNumber": 61,
      "verseString": "أَفَمَنْ وَعَدْنَاهُ وَعْدًا حَسَنًا فَهُوَ لَاقِيهِ كَمَنْ مَتَّعْنَاهُ مَتَاعَ الْحَيَاةِ الدُّنْيَا ثُمَّ هُوَ يَوْمَ الْقِيَامَةِ مِنَ الْمُحْضَرِينَ",
      "verseStringB": "Is he to whom We have promised a goodly promise, which he will meet with, like him whom We have provided with the provisions of this world’s life, then on the day of Resurrection he will be of those brought up (for punishment)?ᵃ"
    },
    {
      "verseNumber": 62,
      "verseString": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ أَيْنَ شُرَكَائِيَ الَّذِينَ كُنْتُمْ تَزْعُمُونَ",
      "verseStringB": "And the day when He will call them and say: Where are those whom you deemed to be My associates?"
    },
    {
      "verseNumber": 63,
      "verseString": "قَالَ الَّذِينَ حَقَّ عَلَيْهِمُ الْقَوْلُ رَبَّنَا هَٰؤُلَاءِ الَّذِينَ أَغْوَيْنَا أَغْوَيْنَاهُمْ كَمَا غَوَيْنَا ۖ تَبَرَّأْنَا إِلَيْكَ ۖ مَا كَانُوا إِيَّانَا يَعْبُدُونَ",
      "verseStringB": "Those against whom the word has proved true will say: Our Lord, these are they whom we caused to deviate — we caused them to deviate as we ourselves deviated. We declare our innocence before Thee. Us they never worshipped.ᵃ"
    },
    {
      "verseNumber": 64,
      "verseString": "وَقِيلَ ادْعُوا شُرَكَاءَكُمْ فَدَعَوْهُمْ فَلَمْ يَسْتَجِيبُوا لَهُمْ وَرَأَوُا الْعَذَابَ ۚ لَوْ أَنَّهُمْ كَانُوا يَهْتَدُونَ",
      "verseStringB": "And it will be said: Call your associate-gods. So they will call upon them, but they will not answer them, and they will see the chastisement. Would that they had followed the right way!"
    },
    {
      "verseNumber": 65,
      "verseString": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ مَاذَا أَجَبْتُمُ الْمُرْسَلِينَ",
      "verseStringB": "And the day He will call them, then say: What was the answer you gave to the messengers?"
    },
    {
      "verseNumber": 66,
      "verseString": "فَعَمِيَتْ عَلَيْهِمُ الْأَنْبَاءُ يَوْمَئِذٍ فَهُمْ لَا يَتَسَاءَلُونَ",
      "verseStringB": "On that day excuses will become obscure to them, so they will not ask each other.ᵃ"
    },
    {
      "verseNumber": 67,
      "verseString": "فَأَمَّا مَنْ تَابَ وَآمَنَ وَعَمِلَ صَالِحًا فَعَسَىٰ أَنْ يَكُونَ مِنَ الْمُفْلِحِينَ",
      "verseStringB": "But as to him who repents and believes and does good, maybe he will be among the successful."
    },
    {
      "verseNumber": 68,
      "verseString": "وَرَبُّكَ يَخْلُقُ مَا يَشَاءُ وَيَخْتَارُ ۗ مَا كَانَ لَهُمُ الْخِيَرَةُ ۚ سُبْحَانَ اللَّهِ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ",
      "verseStringB": "And thy Lord creates and chooses whom He pleases. To choose is not theirs. Glory be to Allāh and exalted be He above what they associate (with Him)!"
    },
    {
      "verseNumber": 69,
      "verseString": "وَرَبُّكَ يَعْلَمُ مَا تُكِنُّ صُدُورُهُمْ وَمَا يُعْلِنُونَ",
      "verseStringB": "And thy Lord knows what their breasts conceal and what they proclaim."
    },
    {
      "verseNumber": 70,
      "verseString": "وَهُوَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۖ لَهُ الْحَمْدُ فِي الْأُولَىٰ وَالْآخِرَةِ ۖ وَلَهُ الْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ",
      "verseStringB": "And He is Allāh, there is no God but He! His is the praise in this (life) and the Hereafter; and His is the judgment, and to Him you will be brought back."
    },
    {
      "verseNumber": 71,
      "verseString": "قُلْ أَرَأَيْتُمْ إِنْ جَعَلَ اللَّهُ عَلَيْكُمُ اللَّيْلَ سَرْمَدًا إِلَىٰ يَوْمِ الْقِيَامَةِ مَنْ إِلَٰهٌ غَيْرُ اللَّهِ يَأْتِيكُمْ بِضِيَاءٍ ۖ أَفَلَا تَسْمَعُونَ",
      "verseStringB": "Say: Do you see if Allāh were to make the night to continue incessantly on you till the day of Resurrection, who is the god besides Allāh who could bring you light? Will you not then hear?"
    },
    {
      "verseNumber": 72,
      "verseString": "قُلْ أَرَأَيْتُمْ إِنْ جَعَلَ اللَّهُ عَلَيْكُمُ النَّهَارَ سَرْمَدًا إِلَىٰ يَوْمِ الْقِيَامَةِ مَنْ إِلَٰهٌ غَيْرُ اللَّهِ يَأْتِيكُمْ بِلَيْلٍ تَسْكُنُونَ فِيهِ ۖ أَفَلَا تُبْصِرُونَ",
      "verseStringB": "Say: Do you see if Allāh were to make the day to continue incessantly on you till the day of Resurrection, who is the god besides Allāh that could bring you the night in which you take rest? Do you not then see?"
    },
    {
      "verseNumber": 73,
      "verseString": "وَمِنْ رَحْمَتِهِ جَعَلَ لَكُمُ اللَّيْلَ وَالنَّهَارَ لِتَسْكُنُوا فِيهِ وَلِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ",
      "verseStringB": "And out of His mercy He has made for you the night and the day, that you may rest therein, and that you may seek of His grace, and that you may give thanks."
    },
    {
      "verseNumber": 74,
      "verseString": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ أَيْنَ شُرَكَائِيَ الَّذِينَ كُنْتُمْ تَزْعُمُونَ",
      "verseStringB": "And the day when He will call them and say: Where are My ssociates whom you pretended?"
    },
    {
      "verseNumber": 75,
      "verseString": "وَنَزَعْنَا مِنْ كُلِّ أُمَّةٍ شَهِيدًا فَقُلْنَا هَاتُوا بُرْهَانَكُمْ فَعَلِمُوا أَنَّ الْحَقَّ لِلَّهِ وَضَلَّ عَنْهُمْ مَا كَانُوا يَفْتَرُونَ",
      "verseStringB": "And We shall draw forth from among every nation a witness and say: Bring your proof. Then shall they know that the Truth is Allāh’s and that which they forged will fail them."
    },
    {
      "verseNumber": 76,
      "verseString": "إِنَّ قَارُونَ كَانَ مِنْ قَوْمِ مُوسَىٰ فَبَغَىٰ عَلَيْهِمْ ۖ وَآتَيْنَاهُ مِنَ الْكُنُوزِ مَا إِنَّ مَفَاتِحَهُ لَتَنُوءُ بِالْعُصْبَةِ أُولِي الْقُوَّةِ إِذْ قَالَ لَهُ قَوْمُهُ لَا تَفْرَحْ ۖ إِنَّ اللَّهَ لَا يُحِبُّ الْفَرِحِينَ",
      "verseStringB": "Korah was surely of the people of Moses, but he oppressed them, and We gave him treasures, so much so that his hoards of wealth would weigh down a body of strong men.ᵃ When his people said to him: Exult not; surely Allāh loves not the exultant."
    },
    {
      "verseNumber": 77,
      "verseString": "وَابْتَغِ فِيمَا آتَاكَ اللَّهُ الدَّارَ الْآخِرَةَ ۖ وَلَا تَنْسَ نَصِيبَكَ مِنَ الدُّنْيَا ۖ وَأَحْسِنْ كَمَا أَحْسَنَ اللَّهُ إِلَيْكَ ۖ وَلَا تَبْغِ الْفَسَادَ فِي الْأَرْضِ ۖ إِنَّ اللَّهَ لَا يُحِبُّ الْمُفْسِدِينَ",
      "verseStringB": "And seek the abode of the Hereafter by means of what Allāh has given thee, and neglect not thy portion of the world, and do good (to others) as Allāh has done good to thee, and seek not to make mischief in the land. Surely Allāh loves not the mischief-makers."
    },
    {
      "verseNumber": 78,
      "verseString": "قَالَ إِنَّمَا أُوتِيتُهُ عَلَىٰ عِلْمٍ عِنْدِي ۚ أَوَلَمْ يَعْلَمْ أَنَّ اللَّهَ قَدْ أَهْلَكَ مِنْ قَبْلِهِ مِنَ الْقُرُونِ مَنْ هُوَ أَشَدُّ مِنْهُ قُوَّةً وَأَكْثَرُ جَمْعًا ۚ وَلَا يُسْأَلُ عَنْ ذُنُوبِهِمُ الْمُجْرِمُونَ",
      "verseStringB": "He said: I have been given this only on account of the knowledge I have. Did he not know that Allāh had destroyed before him generations who were mightier in strength than he and greater in assemblage? And the guilty are not questioned about their sins.ᵃ"
    },
    {
      "verseNumber": 79,
      "verseString": "فَخَرَجَ عَلَىٰ قَوْمِهِ فِي زِينَتِهِ ۖ قَالَ الَّذِينَ يُرِيدُونَ الْحَيَاةَ الدُّنْيَا يَا لَيْتَ لَنَا مِثْلَ مَا أُوتِيَ قَارُونُ إِنَّهُ لَذُو حَظٍّ عَظِيمٍ",
      "verseStringB": "So he went forth to his people in his finery. Those who desired this world’s life said: O would that we had the like of what Korah is given! Surely he is possessed of mighty good fortune!"
    },
    {
      "verseNumber": 80,
      "verseString": "وَقَالَ الَّذِينَ أُوتُوا الْعِلْمَ وَيْلَكُمْ ثَوَابُ اللَّهِ خَيْرٌ لِمَنْ آمَنَ وَعَمِلَ صَالِحًا وَلَا يُلَقَّاهَا إِلَّا الصَّابِرُونَ",
      "verseStringB": "But those who were given the knowledge said: Woe to you! Allāh’s reward is better for him who believes and does good, and none is made to receive this except the patient."
    },
    {
      "verseNumber": 81,
      "verseString": "فَخَسَفْنَا بِهِ وَبِدَارِهِ الْأَرْضَ فَمَا كَانَ لَهُ مِنْ فِئَةٍ يَنْصُرُونَهُ مِنْ دُونِ اللَّهِ وَمَا كَانَ مِنَ الْمُنْتَصِرِينَ",
      "verseStringB": "So We made the earth to swallow him upa and his abode. He had no host to help him against Allāh, nor was he of those who can defend themselves."
    },
    {
      "verseNumber": 82,
      "verseString": "وَأَصْبَحَ الَّذِينَ تَمَنَّوْا مَكَانَهُ بِالْأَمْسِ يَقُولُونَ وَيْكَأَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ مِنْ عِبَادِهِ وَيَقْدِرُ ۖ لَوْلَا أَنْ مَنَّ اللَّهُ عَلَيْنَا لَخَسَفَ بِنَا ۖ وَيْكَأَنَّهُ لَا يُفْلِحُ الْكَافِرُونَ",
      "verseStringB": "And those who had yearned for his place the day before began to say: Ah! (know) that Allāh amplifies and straitens the means of subsistence for whom He pleases of His servants; had not Allāh been gracious to us, He would have abased us. Ah! (know) that the ungrateful are never successful."
    },
    {
      "verseNumber": 83,
      "verseString": "تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُهَا لِلَّذِينَ لَا يُرِيدُونَ عُلُوًّا فِي الْأَرْضِ وَلَا فَسَادًا ۚ وَالْعَاقِبَةُ لِلْمُتَّقِينَ",
      "verseStringB": "That abode of the Hereafter, We assign it to those who have no desire to exalt themselves in the earth nor to make mischief. And the good end is for those who keep their duty."
    },
    {
      "verseNumber": 84,
      "verseString": "مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِنْهَا ۖ وَمَنْ جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَى الَّذِينَ عَمِلُوا السَّيِّئَاتِ إِلَّا مَا كَانُوا يَعْمَلُونَ",
      "verseStringB": "Whoever brings good, he will have better than it; and whoever brings evil, those who do evil will be requited only for what they did."
    },
    {
      "verseNumber": 85,
      "verseString": "إِنَّ الَّذِي فَرَضَ عَلَيْكَ الْقُرْآنَ لَرَادُّكَ إِلَىٰ مَعَادٍ ۚ قُلْ رَبِّي أَعْلَمُ مَنْ جَاءَ بِالْهُدَىٰ وَمَنْ هُوَ فِي ضَلَالٍ مُبِينٍ",
      "verseStringB": "He Who has made the Qur’ān binding on thee will surely bring thee back to the Place of Return.ᵃ Say: My Lord knows best him who has brought the guidance and him who is in manifest error."
    },
    {
      "verseNumber": 86,
      "verseString": "وَمَا كُنْتَ تَرْجُو أَنْ يُلْقَىٰ إِلَيْكَ الْكِتَابُ إِلَّا رَحْمَةً مِنْ رَبِّكَ ۖ فَلَا تَكُونَنَّ ظَهِيرًا لِلْكَافِرِينَ",
      "verseStringB": "And thou didst not expect that the Book would be inspired to thee, but it is a mercy from thy Lord, so be not a backer up of the disbelievers."
    },
    {
      "verseNumber": 87,
      "verseString": "وَلَا يَصُدُّنَّكَ عَنْ آيَاتِ اللَّهِ بَعْدَ إِذْ أُنْزِلَتْ إِلَيْكَ ۖ وَادْعُ إِلَىٰ رَبِّكَ ۖ وَلَا تَكُونَنَّ مِنَ الْمُشْرِكِينَ",
      "verseStringB": "And let them not turn thee aside from the messages of Allāh after they have been revealed to thee, and call (men) to thy Lord and be not of the polytheists."
    },
    {
      "verseNumber": 88,
      "verseString": "وَلَا تَدْعُ مَعَ اللَّهِ إِلَٰهًا آخَرَ ۘ لَا إِلَٰهَ إِلَّا هُوَ ۚ كُلُّ شَيْءٍ هَالِكٌ إِلَّا وَجْهَهُ ۚ لَهُ الْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ",
      "verseStringB": "And call not with Allāh any other god. There is no God but He. Everything will perish but He. His is the judgment, and to Him you will be brought bac"
    }
  ],
  "nameEnglish": "History",
  "nameTrans": "al-Qasas",
  "nameArabic": "القصص",
  "chapterNumber": 28,
  "nVerses": 88,
  "footnotes": [
    {
      "note": "1a. See 26:1a.\n\n      4a. The two parties were the Israelites and the Egyptians, the latter being made the  taskmasters of the former. This refers no doubt to the persecutions of the Muslims. The  Quraish, the stronger party, wanted to crush the weaker party of the Muslims.\n\n       5a. By making them heirs is not meant that they would be made heirs to Pharaoh’s  possession, but heirs to a kingdom in the promised land of Canaan. And this refers also  to the establishment of the kingdom of Islåm and the vanquishment of its persecutors.\n\n      6a. Håmån seems to have been a minister of Pharaoh. He is spoken of again in v. 8 and  v. 38, and also in 29:39 and 40:24, 36. The Håmån spoken of in Esther 3:1 is a different  person. Pharaoh and his counsellors feared that the Israelites, who were aliens in the land of  Egypt, might one day become powerful and supreme in the land. Hence they oppressed and  persecuted them in various ways. Yet the Divine intention was to bring about what Pharaoh  feared. Even such was the Divine intention with regard to the persecuted Muslims.\n\n       8a. It was not the object of Pharaoh’s people that the child should be their enemy,  but this ultimately happened. Låm (“that”) used in this sense is called låm al-‘åqibah.\n\n       10a. Her heart became free from anxiety on account of the assurance which she had  received through Divine revelation; the words that follow show that her heart had been  strengthened with patience, so it cannot be said to have become devoid of patience. In  fact, f årigh often, used elliptically, signiﬁes free from care or anxiety or disquietude (LL).\n\n     13a. The reference is clearly to the opponents of the Holy Prophet, who did not  know that the promise of Allåh, as given to the faithful, would prove true.\n\n       15a. The word “this”, in Moses’ statement, refers to the punishment which he had  given to the Egyptian, the meaning being that it was on account of his devilish deed that the  Egyptian had been so punished. The Rabbinical explanation of Exod. 2:12, which mentions  Moses’ slaying the Egyptian, is that the Egyptian merited death “because he had forced an  Israelitish woman to commit adultery with him” (Jewish En., vol. ix, p. 48). The Qur’ån  does not name the offence, but there is no doubt that it calls his offence a devilish deed. For  the meaning of ghafr, see 2:286a. V. 17 shows clearly that Moses did not consider himself  as one who had done an unjust deed or helped a guilty person. See also 26:14a.\n\n      16a. Moses’ prayer is not evidence of his being guilty, for the words ˚alamtu nafsß  mean I have caused detriment to myself, the primary signiﬁcance of ˚ulm being naq© (T),  or making to suffer loss or detriment (LL), and this is the meaning adopted in 7:160 and  18:33. Òalama-h∂ also signiﬁes he imposed upon him a burden that was above his power  or ability. The meaning here is that he had risked his own life in giving help to another.\n\n     18a. Moses had helped the man on the ﬁrst occasion because he was oppressed, but  now this very man was oppressing another. Therefore he refused to help him.\n\n       25a. According to Exod. 2:18, the old man was Reuel, but in Exod. 3:1 he is called  Jethro and he is said to have had seven daughters. The Qur’ån does not state how many  daughters the man had; it only speaks of two of them being in charge of their father’s  ﬂock. Hence the alleged confusion of this story with that of Laban’s two daughters is  itself due to a confusion. The commentators say this man was Shu‘aib, and Shu‘aib is  mentioned by the name of Jethro in the Bible.\n\n       27a. Christian critical opinion discovers here another confusion. Because Jacob had  made an agreement with Laban to serve him for seven years as a condition of marrying  one of his daughters (Gen. 29:18), it is alleged that this fact must have been present in the  Prophet’s mind in a confused state, giving rise to the story relating to Moses’ serving  Jethro for eight or ten years. According to Rabbinical accounts, Moses lived with Jethro  for ten years, which corroborates the Quranic story in substance (see Jewish En.), and  there is nothing improbable in the circumstance that he may have served him during that  period and married one of his daughters. But what is stated here has really a deeper sig-  niﬁcance beneath it. In Moses’ stay at Midian for ten years, there is a prophetical refer-  ence to the ten years of the Prophet’s life at Madßnah. The mention of eight years has  another underlying signiﬁcance, for it was after eight years that the Prophet came back to  Makkah as a conqueror, a clear reference to which is contained further on in v. 85: He  Who has made the Qur’ån binding on thee will surely bring thee back to the Place of  Return. This occurred exactly eight years after his Flight. That such is the real signiﬁ-  cance of relating this narrative is made clear by the Qur’ån itself further on in v. 45,  where the Prophet is thus addressed: And thou wast not dwelling among the people of  Midian, reciting to them Our messages. It is, as it were, to say that it was Moses that  lived among the people of Midian, but his episode really conveys the news of what will  happen to thee.      It may be added here that Moses was paid his wages, and the condition of his stay-  ing in Midian for eight or ten years was as much in his own interest as in the interest of  Jethro, for as the Bible narrative shows, Pharaoh had died by the time that Moses’ stay  in Midian had come to an end.\n\n      32a. See 7:108a, 20:20a, 22a.\n\n      35a. The meaning is, so that they will not be able to injure you.\n\n      38a. Pharaoh mocks at the idea of the Lord of the heavens and the earth, and  derisively commands one of his ministers to prepare bricks — such being the signiﬁ-  cance of kindling a ﬁre on clay — and to erect a lofty building so that he may have a  peep into the heavens to discover the Lord of the heavens and the earth.\n\n    41a. Pharaoh is thus made a prototype of evil, and the opponents of the Holy  Prophet are warned that by walking in Pharaoh’s footsteps they will meet a similar fate.\n\n      44a. Moses’ prophecy about the advent of the Prophet — of a prophet like him from  among the Ishmaelites, the brethren of the Israelites — was so clear that one would  think that the Prophet was there at the side of the mountain and Moses saw him with his  own eyes. Hence the words, thou wast not on the western side (of the mountain), nor  wast thou among those present. The opening words of the next verse show that a very  long time had elapsed between these two prophets. The clear prophecy of Moses of the  appearance of a prophet like unto him was fulﬁlled after about two thousand years, and  yet none of the prophets who followed Moses one after another had ever claimed to be a  prophet like Moses, not even Jesus Christ, the last of the line of the Israelite prophets.\n\n  45a. Why is Midian mentioned in particular, though Moses stayed there for a short  time; see 27a. Moses lived in Midian for ten years, just as the Prophet passed ten years  of his life at Madßnah, yet what a transformation was wrought in the course of these ten  years! This very fact was a clear proof of his truth.\n\n       46a. This verse throws light on the signiﬁcance of the foregoing verses: Thou wast  not there, but it was Divine mercy that put a prophecy into the mouth of Moses regarding  thee. This is made clear by the words a mercy from thy Lord that thou mayest warn....  The people to whom no warner had come before were the Arabs. Compare 32:3; 36:6.\n\n      48a. The disbelievers did not adopt any one ﬁrm position against the Holy Prophet,  and whenever one objection was shown to be erroneous, they took refuge in another.  At the advent of the Prophet they said that he should have received a revelation like the  revelation of Moses, but when the likeness was pointed out to them, and they were told  that their fate would be like the fate of the opponents of Moses, they said that both  Moses and Mu√ammad were deceivers who enchanted people by their eloquence, the  one helping the other, and therefore they believed neither in the one nor in the other.\n\n     49a. The meaning is that, if you do not admit the truth of either revelation, you should  show some other revelation existing in the world, which should offer better guidance. This  statement only draws attention to the fact that the revelation granted to Moses and that grant-  ed to the Holy Prophet both occupy a higher position than any other revelation. And this is in  fact true, for among all the sacred books of the world the Bible occupies a position second  only to the Holy Qur’ån. The words, however, do not signify that the Bible occupies a posi-  tion equal to the Holy Qur’ån. For their comparative merits see 5:44a, 48a. See also 2:106a.\n\n       51a. Wa©©ala signiﬁes he joined or connected much or he made (a string) to have  many joinings (T, LL). What is implied here is that the word of Allåh, as contained in  the Qur’ån, is made to have many points of connection with previous revelation, so that  it may be the easier for them to be reminded of its truth. Even if they did not believe in  previous revelation, the broad points of likeness in the principles of two different  prophets appearing at such a distance of time from each other, among entirely different  nations, and under totally different circumstances, and the fulﬁlment of the prophecies  uttered by one in the other, afforded conclusive evidence of the truth of them both. That  the reference is to the connection with the previous revelation is also shown by the verse  that follows, where those who have been given the Book are clearly spoken of.\n\n       52a. It is not meant that all those who have previously been given the Scriptures  believe in the Qur’ån. The verse only draws attention to the fact that all believe in the  truth of revelation from Allåh, and they cannot deny the points of connection between  the two revelations, the truth of the fundamental principles and the fulﬁlment of prophe-  cies. But only those would believe who have submitted themselves already to Allåh, as  the verse that follows shows.\n\n   54a. The reason for a double reward — which only means a greater reward — is  given in the words that follow: Because they are steadfast and they repel evil with good  and spend out of what We have given them. They had to suffer persecution, and not only  did they remain steadfast in these great trials, but they repelled the evil of their persecu-  tors with good, and in addition to all this made great sacriﬁces in the cause of Truth. See  also 33:31a, 57:28a.\n\n      56a. It is related that when Ab∂ Ôålib was on his deathbed, the Holy Prophet asked  him to believe in Divine Unity. Ab∂ Jahl, being by him at the time, dissuaded him from  doing so, saying that he should not desert the religion of his fathers. Ab∂ Ôålib died an  unbeliever, and the words thou canst not guide whom thou lovest were a comfort to the  Prophet (B. 65:xxviii, 1). But the words are true in a general sense as well. The Prophet  wished that all people should accept the Truth and better their lives. But all this was to  be brought about gradually.\n\n       57a. The verse speaks ﬁrst of the unfounded fears of those who thought that the weak-  ness of the Muslims would result in the seizure, death, or expulsion of those who accepted  the faith of Islåm. In reply they are told that the prophecies which declare Makkah to be a  safe and sacred territory, to which people will ﬂock in all ages, must come to fulﬁlment, and  Makkah will ultimately be theirs for whose sake these prophecies were uttered.\n\n   58a. That is, even now the Divine kingdom will be established, and the true believ-  ers in God will be made masters of the country.\n\n      61a. There are two parties spoken of here: the Prophet and his followers, who have  received a goodly promise from Allåh, though weak and oppressed at the time, and the  powerful enemy, who has all the provisions of life in his possession, but who will one  day be called upon to receive judgment.\n\n  63a. All commentators agree that by those against whom the word has proved true  are meant the leaders in unbelief (JB, Kf). Their saying Us they never worshipped shows  that these very leaders are spoken of as the gods whom their followers worship.\n\n      66a. They will not be able to offer an excuse, for the vanity of the false excuses,  which satisﬁed them here, would then become manifest to them. Nor will they ask each  other, for each will know the falsity of the excuses of the others.\n\n   76a. The story of Korah, or Qår∂n, his revolt against the leadership of Moses and  Aaron, and his being swallowed up by the earth, is given in Num. 16. The only addition  of any importance to the story as given in the Qur’ån is the mention of his wealth, a fact  noticed in Rabbinical literature (Jewish En.), according to which the fabulous renown of  his wealth was so great that the keys of his treasures formed a load for three hundred  mules. The word mafa–ti√ as occurring in the Qur’ån is plural of mafta√, which means a  hoard, or treasure, or buried property (LL). It is also plural of miftå√, meaning a key, but  kun∂z (meaning treasures, sing., kanz) being in the plural, the personal pronoun in  maf åti√a-h∂ does not refer to kun∂z but to Korah; accordingly mafåti√ denotes treasures.       There may be a reference in the mention of Korah’s wealth to the modern material-  istic tendency of making the accumulation of wealth the great object of life to the utter  neglect of the Truth. The hankering after wealth and the amassing of gold leads  undoubtedly to ruin, as it is leading the world today.\n\n      78a. They will not be asked to give any explanation for their sins, as Allåh is All-Knowing.\n\n    81a. The meaning conveyed is that he perished. Khasf also signiﬁes abasing,  humbling, or lowering another, and the verb is khasafa in this case (T, Q, LL). I adopt  this signiﬁcance of khasafa bi-nå (“abased us”) in the next verse.\n\n      85a. The word ma‘åd means the ultimate place of one’s returning (from ‘åda,  meaning he returned) (LL). The word ma‘åd here has been taken to mean Makkah  according to an interpretation given by I‘Ab, and T accepts this interpretation, because  the conquest of it was promised to the Prophet, so that it was the place to which he  would return. But Makkah is really called ma‘åd, or Place of Return, because the  pilgrims return to it (LL). According to some this verse was revealed on the Prophet’s  departure from Makkah, i.e., on his way to Madßnah. It contains a clear promise of the  Prophet being brought back to the city from which he was now being expelled.\n\n        "
    }
  ]
}
