{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "الم",
      "verseStringB": "I, Allāh, am the best Knower.ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "أَحَسِبَ النَّاسُ أَنْ يُتْرَكُوا أَنْ يَقُولُوا آمَنَّا وَهُمْ لَا يُفْتَنُونَ",
      "verseStringB": "Do men think that they will be left alone on saying, We believe, and will not be tried?ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "وَلَقَدْ فَتَنَّا الَّذِينَ مِنْ قَبْلِهِمْ ۖ فَلَيَعْلَمَنَّ اللَّهُ الَّذِينَ صَدَقُوا وَلَيَعْلَمَنَّ الْكَاذِبِينَ",
      "verseStringB": "And indeed We tried those before them, so Allāh will certainly know those who are true and He will know the liars.ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "أَمْ حَسِبَ الَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ أَنْ يَسْبِقُونَا ۚ سَاءَ مَا يَحْكُمُونَ",
      "verseStringB": "Or do they who work evil think that they will escape Us? Evil is it that they judge!"
    },
    {
      "verseNumber": 5,
      "verseString": "مَنْ كَانَ يَرْجُو لِقَاءَ اللَّهِ فَإِنَّ أَجَلَ اللَّهِ لَآتٍ ۚ وَهُوَ السَّمِيعُ الْعَلِيمُ",
      "verseStringB": "Whoever hopes to meet with Allāh, the term of Allāh is then surely coming. And He is the Hearing, the Knowing."
    },
    {
      "verseNumber": 6,
      "verseString": "وَمَنْ جَاهَدَ فَإِنَّمَا يُجَاهِدُ لِنَفْسِهِ ۚ إِنَّ اللَّهَ لَغَنِيٌّ عَنِ الْعَالَمِينَ",
      "verseStringB": "And whoever strives hard, strives for himself. Surely Allāh is Self-sufficient, above (need of) (His) creatures.ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَنُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ وَلَنَجْزِيَنَّهُمْ أَحْسَنَ الَّذِي كَانُوا يَعْمَلُونَ",
      "verseStringB": "And those who believe and do good, We shall certainly do away with their afflictions and reward them for the best of what they did.ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "وَوَصَّيْنَا الْإِنْسَانَ بِوَالِدَيْهِ حُسْنًا ۖ وَإِنْ جَاهَدَاكَ لِتُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا ۚ إِلَيَّ مَرْجِعُكُمْ فَأُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ",
      "verseStringB": "And We have enjoined on man goodness to his parents. But if they contend with thee to associate (others) with Me, of which thou hast no knowledge, obey them not. To Me is your return, so I will inform you of what you did.ᵃ"
    },
    {
      "verseNumber": 9,
      "verseString": "وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَنُدْخِلَنَّهُمْ فِي الصَّالِحِينَ",
      "verseStringB": "And those who believe and do good, We shall surely make them enter among the righteous."
    },
    {
      "verseNumber": 10,
      "verseString": "وَمِنَ النَّاسِ مَنْ يَقُولُ آمَنَّا بِاللَّهِ فَإِذَا أُوذِيَ فِي اللَّهِ جَعَلَ فِتْنَةَ النَّاسِ كَعَذَابِ اللَّهِ وَلَئِنْ جَاءَ نَصْرٌ مِنْ رَبِّكَ لَيَقُولُنَّ إِنَّا كُنَّا مَعَكُمْ ۚ أَوَلَيْسَ اللَّهُ بِأَعْلَمَ بِمَا فِي صُدُورِ الْعَالَمِينَ",
      "verseStringB": "And among men is he who says: We believe in Allāh; but when he is persecuted for the sake of Allāh, he thinks the persecution of men to be as the chastisement of Allāh.ᵃ And if there comes help from thy Lord, they will say: Surely we were with you. Is not Allāh the Best Knower of what is in the hearts of mankind?"
    },
    {
      "verseNumber": 11,
      "verseString": "وَلَيَعْلَمَنَّ اللَّهُ الَّذِينَ آمَنُوا وَلَيَعْلَمَنَّ الْمُنَافِقِينَ",
      "verseStringB": "And certainly Allāh will know those who believe, and He will know the hypocrites."
    },
    {
      "verseNumber": 12,
      "verseString": "وَقَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا اتَّبِعُوا سَبِيلَنَا وَلْنَحْمِلْ خَطَايَاكُمْ وَمَا هُمْ بِحَامِلِينَ مِنْ خَطَايَاهُمْ مِنْ شَيْءٍ ۖ إِنَّهُمْ لَكَاذِبُونَ",
      "verseStringB": "And those who disbelieve say to those who believe: Follow our path and we will bear your wrongs. And they can never bear aught of their wrongs. Surely they are liars."
    },
    {
      "verseNumber": 13,
      "verseString": "وَلَيَحْمِلُنَّ أَثْقَالَهُمْ وَأَثْقَالًا مَعَ أَثْقَالِهِمْ ۖ وَلَيُسْأَلُنَّ يَوْمَ الْقِيَامَةِ عَمَّا كَانُوا يَفْتَرُونَ",
      "verseStringB": "And they will certainly bear their own burdens, and other burdens besides their own burdens; and they will certainly be questioned on the day of Resurrection as to what they forged.ᵃ"
    },
    {
      "verseNumber": 14,
      "verseString": "وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَامًا فَأَخَذَهُمُ الطُّوفَانُ وَهُمْ ظَالِمُونَ",
      "verseStringB": "And We indeed sent Noah to his people, so he remained among them a thousand years save fifty years.ᵃ And the deluge overtook them, and they were wrongdoers."
    },
    {
      "verseNumber": 15,
      "verseString": "فَأَنْجَيْنَاهُ وَأَصْحَابَ السَّفِينَةِ وَجَعَلْنَاهَا آيَةً لِلْعَالَمِينَ",
      "verseStringB": "So We delivered him and the inmates of the ark, and made it a sign to the nations."
    },
    {
      "verseNumber": 16,
      "verseString": "وَإِبْرَاهِيمَ إِذْ قَالَ لِقَوْمِهِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ ۖ ذَٰلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ",
      "verseStringB": "And (We sent) Abraham, when he said to his people: Serve Allāh and keep your duty to Him. That is better for you, if you did but know."
    },
    {
      "verseNumber": 17,
      "verseString": "إِنَّمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ أَوْثَانًا وَتَخْلُقُونَ إِفْكًا ۚ إِنَّ الَّذِينَ تَعْبُدُونَ مِنْ دُونِ اللَّهِ لَا يَمْلِكُونَ لَكُمْ رِزْقًا فَابْتَغُوا عِنْدَ اللَّهِ الرِّزْقَ وَاعْبُدُوهُ وَاشْكُرُوا لَهُ ۖ إِلَيْهِ تُرْجَعُونَ",
      "verseStringB": "You only worship idols besides Allāh and you invent a lie. Surely they whom you serve besides Allāh control no sustenance for you; so seek sustenance from Allāh and serve Him and be grateful to Him. To Him you will be brought back."
    },
    {
      "verseNumber": 18,
      "verseString": "وَإِنْ تُكَذِّبُوا فَقَدْ كَذَّبَ أُمَمٌ مِنْ قَبْلِكُمْ ۖ وَمَا عَلَى الرَّسُولِ إِلَّا الْبَلَاغُ الْمُبِينُ",
      "verseStringB": "And if you reject, nations before you did indeed reject (the Truth). And the duty of the Messenger is only to deliver (the message) plainly."
    },
    {
      "verseNumber": 19,
      "verseString": "أَوَلَمْ يَرَوْا كَيْفَ يُبْدِئُ اللَّهُ الْخَلْقَ ثُمَّ يُعِيدُهُ ۚ إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ",
      "verseStringB": "See they not how Allāh origInᵃ tes the creation, then reproduces it? Surely that is easy to Allāh.ᵃ"
    },
    {
      "verseNumber": 20,
      "verseString": "قُلْ سِيرُوا فِي الْأَرْضِ فَانْظُرُوا كَيْفَ بَدَأَ الْخَلْقَ ۚ ثُمَّ اللَّهُ يُنْشِئُ النَّشْأَةَ الْآخِرَةَ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "Say: Travel in the earth then see how He makes the first creation, then Allāh creates the latter creation. Surely Allāh is Possessor of power over all things.ᵃ"
    },
    {
      "verseNumber": 21,
      "verseString": "يُعَذِّبُ مَنْ يَشَاءُ وَيَرْحَمُ مَنْ يَشَاءُ ۖ وَإِلَيْهِ تُقْلَبُونَ",
      "verseStringB": "He chastises whom He pleases and has mercy on whom He pleases, and to Him you will be turned back."
    },
    {
      "verseNumber": 22,
      "verseString": "وَمَا أَنْتُمْ بِمُعْجِزِينَ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ ۖ وَمَا لَكُمْ مِنْ دُونِ اللَّهِ مِنْ وَلِيٍّ وَلَا نَصِيرٍ",
      "verseStringB": "And you cannot escape in the earth nor in the heaven, and you have no protector or helper besides Allāh."
    },
    {
      "verseNumber": 23,
      "verseString": "وَالَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ وَلِقَائِهِ أُولَٰئِكَ يَئِسُوا مِنْ رَحْمَتِي وَأُولَٰئِكَ لَهُمْ عَذَابٌ أَلِيمٌ",
      "verseStringB": "And those who disbelieve in the messages of Allāh and the meeting with Him, they despair of My mercy, and for them is a painful chastisement."
    },
    {
      "verseNumber": 24,
      "verseString": "فَمَا كَانَ جَوَابَ قَوْمِهِ إِلَّا أَنْ قَالُوا اقْتُلُوهُ أَوْ حَرِّقُوهُ فَأَنْجَاهُ اللَّهُ مِنَ النَّارِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يُؤْمِنُونَ",
      "verseStringB": "So naught was the answer of his people except that they said: Slay him or burn him! But Allāh delivered him from the fire. Surely therein are signs for a people who believe.ᵃ"
    },
    {
      "verseNumber": 25,
      "verseString": "وَقَالَ إِنَّمَا اتَّخَذْتُمْ مِنْ دُونِ اللَّهِ أَوْثَانًا مَوَدَّةَ بَيْنِكُمْ فِي الْحَيَاةِ الدُّنْيَا ۖ ثُمَّ يَوْمَ الْقِيَامَةِ يَكْفُرُ بَعْضُكُمْ بِبَعْضٍ وَيَلْعَنُ بَعْضُكُمْ بَعْضًا وَمَأْوَاكُمُ النَّارُ وَمَا لَكُمْ مِنْ نَاصِرِينَ",
      "verseStringB": "And he said: You have only taken idols besides Allāh by way of friendship between you in this world’s life, then on the day of Resurrection some of you will deny others, and some of you will curse others; and your abode is the Fire, and you will have no helpers."
    },
    {
      "verseNumber": 26,
      "verseString": "فَآمَنَ لَهُ لُوطٌ ۘ وَقَالَ إِنِّي مُهَاجِرٌ إِلَىٰ رَبِّي ۖ إِنَّهُ هُوَ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "So Lot believed in him. And he said: I am fleeing to my Lord. Surely He is the Mighty, the Wise.ᵃ"
    },
    {
      "verseNumber": 27,
      "verseString": "وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ وَجَعَلْنَا فِي ذُرِّيَّتِهِ النُّبُوَّةَ وَالْكِتَابَ وَآتَيْنَاهُ أَجْرَهُ فِي الدُّنْيَا ۖ وَإِنَّهُ فِي الْآخِرَةِ لَمِنَ الصَّالِحِينَ",
      "verseStringB": "And We granted him Isaac and Jacob, and ordained prophethood and the Book among his seed. And We gave him his reward in this world, and in the Hereafter he will surely be among the righteous."
    },
    {
      "verseNumber": 28,
      "verseString": "وَلُوطًا إِذْ قَالَ لِقَوْمِهِ إِنَّكُمْ لَتَأْتُونَ الْفَاحِشَةَ مَا سَبَقَكُمْ بِهَا مِنْ أَحَدٍ مِنَ الْعَالَمِينَ",
      "verseStringB": "And (We sent) Lot, when he said to his people: Surely you are guilty of an abomInᵃ tion which none of the nations has done before you."
    },
    {
      "verseNumber": 29,
      "verseString": "أَئِنَّكُمْ لَتَأْتُونَ الرِّجَالَ وَتَقْطَعُونَ السَّبِيلَ وَتَأْتُونَ فِي نَادِيكُمُ الْمُنْكَرَ ۖ فَمَا كَانَ جَوَابَ قَوْمِهِ إِلَّا أَنْ قَالُوا ائْتِنَا بِعَذَابِ اللَّهِ إِنْ كُنْتَ مِنَ الصَّادِقِينَ",
      "verseStringB": "Do you come to males and commit robbery on the highway, and commit evil deeds in your assemblies?ᵃ But the answer of his people was only that they said: Bring on us Allāh’s chastisement, if thou art truthful."
    },
    {
      "verseNumber": 30,
      "verseString": "قَالَ رَبِّ انْصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ",
      "verseStringB": "He said: My Lord, help me against the mischievous people."
    },
    {
      "verseNumber": 31,
      "verseString": "وَلَمَّا جَاءَتْ رُسُلُنَا إِبْرَاهِيمَ بِالْبُشْرَىٰ قَالُوا إِنَّا مُهْلِكُو أَهْلِ هَٰذِهِ الْقَرْيَةِ ۖ إِنَّ أَهْلَهَا كَانُوا ظَالِمِينَ",
      "verseStringB": "And when Our messengers came to Abraham with good news, they said: We are going to destroy the people of this town, for its people are iniquitous."
    },
    {
      "verseNumber": 32,
      "verseString": "قَالَ إِنَّ فِيهَا لُوطًا ۚ قَالُوا نَحْنُ أَعْلَمُ بِمَنْ فِيهَا ۖ لَنُنَجِّيَنَّهُ وَأَهْلَهُ إِلَّا امْرَأَتَهُ كَانَتْ مِنَ الْغَابِرِينَ",
      "verseStringB": "He said: Surely in it is Lot. They said: We know well who is in it; we shall certainly deliver him and his followers, except his wife; she is of those who remain behind."
    },
    {
      "verseNumber": 33,
      "verseString": "وَلَمَّا أَنْ جَاءَتْ رُسُلُنَا لُوطًا سِيءَ بِهِمْ وَضَاقَ بِهِمْ ذَرْعًا وَقَالُوا لَا تَخَفْ وَلَا تَحْزَنْ ۖ إِنَّا مُنَجُّوكَ وَأَهْلَكَ إِلَّا امْرَأَتَكَ كَانَتْ مِنَ الْغَابِرِينَ",
      "verseStringB": "And when Our messengers came to Lot, he was grieved on account of them, and he lacked strength to protect them.ᵃ And they said: Fear not, nor grieve; surely we will deliver thee and thy followers, except thy wife — she is of those who remain behind."
    },
    {
      "verseNumber": 34,
      "verseString": "إِنَّا مُنْزِلُونَ عَلَىٰ أَهْلِ هَٰذِهِ الْقَرْيَةِ رِجْزًا مِنَ السَّمَاءِ بِمَا كَانُوا يَفْسُقُونَ",
      "verseStringB": "Surely We are going to bring down upon the people of this town a punishment from heaven, because they transgressed."
    },
    {
      "verseNumber": 35,
      "verseString": "وَلَقَدْ تَرَكْنَا مِنْهَا آيَةً بَيِّنَةً لِقَوْمٍ يَعْقِلُونَ",
      "verseStringB": "And certainly We have left a clear sign of it for a people who understand.ᵃ"
    },
    {
      "verseNumber": 36,
      "verseString": "وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا فَقَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ وَارْجُوا الْيَوْمَ الْآخِرَ وَلَا تَعْثَوْا فِي الْأَرْضِ مُفْسِدِينَ",
      "verseStringB": "And to Midian (We sent) their brother Shu‘aib, so he said: O my people, serve Allāh and fear the Latter day, and act not corruptly, making mischief, in the land."
    },
    {
      "verseNumber": 37,
      "verseString": "فَكَذَّبُوهُ فَأَخَذَتْهُمُ الرَّجْفَةُ فَأَصْبَحُوا فِي دَارِهِمْ جَاثِمِينَ",
      "verseStringB": "But they rejected him, so a severe earthquake overtook them and they lay prostrate in their abodes."
    },
    {
      "verseNumber": 38,
      "verseString": "وَعَادًا وَثَمُودَ وَقَدْ تَبَيَّنَ لَكُمْ مِنْ مَسَاكِنِهِمْ ۖ وَزَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيلِ وَكَانُوا مُسْتَبْصِرِينَ",
      "verseStringB": "And ‘ād and Tham∂d! And some of their dwellings are indeed apparent to you. And the devil made their deeds fairseeming to them, so he kept them back from the path, and they could see clearly."
    },
    {
      "verseNumber": 39,
      "verseString": "وَقَارُونَ وَفِرْعَوْنَ وَهَامَانَ ۖ وَلَقَدْ جَاءَهُمْ مُوسَىٰ بِالْبَيِّنَاتِ فَاسْتَكْبَرُوا فِي الْأَرْضِ وَمَا كَانُوا سَابِقِينَ",
      "verseStringB": "And Korah and Pharaoh and Hāmān! And certainly Moses came to them with clear arguments, but they behaved haughtily in the land; and they could not outstrip (Us)."
    },
    {
      "verseNumber": 40,
      "verseString": "فَكُلًّا أَخَذْنَا بِذَنْبِهِ ۖ فَمِنْهُمْ مَنْ أَرْسَلْنَا عَلَيْهِ حَاصِبًا وَمِنْهُمْ مَنْ أَخَذَتْهُ الصَّيْحَةُ وَمِنْهُمْ مَنْ خَسَفْنَا بِهِ الْأَرْضَ وَمِنْهُمْ مَنْ أَغْرَقْنَا ۚ وَمَا كَانَ اللَّهُ لِيَظْلِمَهُمْ وَلَٰكِنْ كَانُوا أَنْفُسَهُمْ يَظْلِمُونَ",
      "verseStringB": "So each one We punished for his sin. Of them was he on whom We sent a violent storm, and of them was he whom the rumbling overtook, and of them was he whom We caused the earth to swallow, and of them was he whom We drowned.ᵃ And it was not Allāh, Who wronged them, but they wronged themselves."
    },
    {
      "verseNumber": 41,
      "verseString": "مَثَلُ الَّذِينَ اتَّخَذُوا مِنْ دُونِ اللَّهِ أَوْلِيَاءَ كَمَثَلِ الْعَنْكَبُوتِ اتَّخَذَتْ بَيْتًا ۖ وَإِنَّ أَوْهَنَ الْبُيُوتِ لَبَيْتُ الْعَنْكَبُوتِ ۖ لَوْ كَانُوا يَعْلَمُونَ",
      "verseStringB": "The parable of those who take guardians besides Allāh is as the parable of the spider that makes for itself a house; and surely the frailest of the houses is the spider’s house — if they but knew!ᵃ"
    },
    {
      "verseNumber": 42,
      "verseString": "إِنَّ اللَّهَ يَعْلَمُ مَا يَدْعُونَ مِنْ دُونِهِ مِنْ شَيْءٍ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "Surely Allāh knows whatever they call upon besides Him. And He is the Mighty, the Wise."
    },
    {
      "verseNumber": 43,
      "verseString": "وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ ۖ وَمَا يَعْقِلُهَا إِلَّا الْعَالِمُونَ",
      "verseStringB": "And these parables, We set them forth for men, and none understand them but the learned."
    },
    {
      "verseNumber": 44,
      "verseString": "خَلَقَ اللَّهُ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۚ إِنَّ فِي ذَٰلِكَ لَآيَةً لِلْمُؤْمِنِينَ",
      "verseStringB": "Allāh created the heavens and the earth with truth. Surely there is a sign in this for the believers."
    },
    {
      "verseNumber": 45,
      "verseString": "اتْلُ مَا أُوحِيَ إِلَيْكَ مِنَ الْكِتَابِ وَأَقِمِ الصَّلَاةَ ۖ إِنَّ الصَّلَاةَ تَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنْكَرِ ۗ وَلَذِكْرُ اللَّهِ أَكْبَرُ ۗ وَاللَّهُ يَعْلَمُ مَا تَصْنَعُونَ",
      "verseStringB": "Recite that which has been revealed to thee of the Book and keep up prayer. Surely prayer keeps (one) away from indecency and evil; and certainly the remembrance of Allāh is the greatest (force). And Allāh knows what you do.ᵃ"
    },
    {
      "verseNumber": 46,
      "verseString": "وَلَا تُجَادِلُوا أَهْلَ الْكِتَابِ إِلَّا بِالَّتِي هِيَ أَحْسَنُ إِلَّا الَّذِينَ ظَلَمُوا مِنْهُمْ ۖ وَقُولُوا آمَنَّا بِالَّذِي أُنْزِلَ إِلَيْنَا وَأُنْزِلَ إِلَيْكُمْ وَإِلَٰهُنَا وَإِلَٰهُكُمْ وَاحِدٌ وَنَحْنُ لَهُ مُسْلِمُونَ",
      "verseStringB": "And argue not with the People of the Book except by what is best,ᵃ save such of them as act unjustly.ᵇ But say: We believe in that which has been revealed to us and revealed to you, and our God and your God is One, and to Him we submit."
    },
    {
      "verseNumber": 47,
      "verseString": "وَكَذَٰلِكَ أَنْزَلْنَا إِلَيْكَ الْكِتَابَ ۚ فَالَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يُؤْمِنُونَ بِهِ ۖ وَمِنْ هَٰؤُلَاءِ مَنْ يُؤْمِنُ بِهِ ۚ وَمَا يَجْحَدُ بِآيَاتِنَا إِلَّا الْكَافِرُونَ",
      "verseStringB": "And thus have We revealed the Book to thee.ᵃ So those whom We have given the Book believe in it, and of these b there are those who believe in it; and none deny Our messages except the disbelievers."
    },
    {
      "verseNumber": 48,
      "verseString": "وَمَا كُنْتَ تَتْلُو مِنْ قَبْلِهِ مِنْ كِتَابٍ وَلَا تَخُطُّهُ بِيَمِينِكَ ۖ إِذًا لَارْتَابَ الْمُبْطِلُونَ",
      "verseStringB": "And thou didst not recite before it any book, nor didst thou transcribe one with thy right hand, for then could the liars have doubted.ᵃ"
    },
    {
      "verseNumber": 49,
      "verseString": "بَلْ هُوَ آيَاتٌ بَيِّنَاتٌ فِي صُدُورِ الَّذِينَ أُوتُوا الْعِلْمَ ۚ وَمَا يَجْحَدُ بِآيَاتِنَا إِلَّا الظَّالِمُونَ",
      "verseStringB": "Nay, it is clear messages in the hearts of those who are granted knowledge.ᵃ And none deny Our messages except the iniquitous."
    },
    {
      "verseNumber": 50,
      "verseString": "وَقَالُوا لَوْلَا أُنْزِلَ عَلَيْهِ آيَاتٌ مِنْ رَبِّهِ ۖ قُلْ إِنَّمَا الْآيَاتُ عِنْدَ اللَّهِ وَإِنَّمَا أَنَا نَذِيرٌ مُبِينٌ",
      "verseStringB": "And they say: Why are not signs sent down upon him from his Lord? Say: Signs are with Allāh only, and I am only a plain warner.ᵃ"
    },
    {
      "verseNumber": 51,
      "verseString": "أَوَلَمْ يَكْفِهِمْ أَنَّا أَنْزَلْنَا عَلَيْكَ الْكِتَابَ يُتْلَىٰ عَلَيْهِمْ ۚ إِنَّ فِي ذَٰلِكَ لَرَحْمَةً وَذِكْرَىٰ لِقَوْمٍ يُؤْمِنُونَ",
      "verseStringB": "Is it not enough for them that We have revealed to thee the Book which is recited to them? Surely there is mercy in this and a reminder for a people who believe.ᵃ"
    },
    {
      "verseNumber": 52,
      "verseString": "قُلْ كَفَىٰ بِاللَّهِ بَيْنِي وَبَيْنَكُمْ شَهِيدًا ۖ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۗ وَالَّذِينَ آمَنُوا بِالْبَاطِلِ وَكَفَرُوا بِاللَّهِ أُولَٰئِكَ هُمُ الْخَاسِرُونَ",
      "verseStringB": "Say: Allāh is sufficient as a witness between me and you — He knows what is in the heavens and the earth. And those who believe in falsehood and disbelieve in Allāh, these it is that are the losers."
    },
    {
      "verseNumber": 53,
      "verseString": "وَيَسْتَعْجِلُونَكَ بِالْعَذَابِ ۚ وَلَوْلَا أَجَلٌ مُسَمًّى لَجَاءَهُمُ الْعَذَابُ وَلَيَأْتِيَنَّهُمْ بَغْتَةً وَهُمْ لَا يَشْعُرُونَ",
      "verseStringB": "And they ask thee to hasten on the chastisement. And had not a term been appointed, the chastisement would certainly have come to them. And certainly it will come to them all of a sudden, while they perceive not."
    },
    {
      "verseNumber": 54,
      "verseString": "يَسْتَعْجِلُونَكَ بِالْعَذَابِ وَإِنَّ جَهَنَّمَ لَمُحِيطَةٌ بِالْكَافِرِينَ",
      "verseStringB": "They ask thee to hasten on the chastisement, and surely hell ncompasses the disbelieversa—"
    },
    {
      "verseNumber": 55,
      "verseString": "يَوْمَ يَغْشَاهُمُ الْعَذَابُ مِنْ فَوْقِهِمْ وَمِنْ تَحْتِ أَرْجُلِهِمْ وَيَقُولُ ذُوقُوا مَا كُنْتُمْ تَعْمَلُونَ",
      "verseStringB": "The day when the chastisement will cover them from above them, and from beneath their feet!ᵃ And He will say: Taste what you did."
    },
    {
      "verseNumber": 56,
      "verseString": "يَا عِبَادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي وَاسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ",
      "verseStringB": "O My servants who believe, surely My earth is vast, so serve Me only.ᵃ"
    },
    {
      "verseNumber": 57,
      "verseString": "كُلُّ نَفْسٍ ذَائِقَةُ الْمَوْتِ ۖ ثُمَّ إِلَيْنَا تُرْجَعُونَ",
      "verseStringB": "Every soul must taste of death; then to Us you will be returned."
    },
    {
      "verseNumber": 58,
      "verseString": "وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَنُبَوِّئَنَّهُمْ مِنَ الْجَنَّةِ غُرَفًا تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ نِعْمَ أَجْرُ الْعَامِلِينَ",
      "verseStringB": "And those who believe and do good, We shall certainly give them an abode in high places in the Garden wherein flow rivers, abiding therein. Excellent the reward of the workers,"
    },
    {
      "verseNumber": 59,
      "verseString": "الَّذِينَ صَبَرُوا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ",
      "verseStringB": "Who are patient, and on their Lord they rely!"
    },
    {
      "verseNumber": 60,
      "verseString": "وَكَأَيِّنْ مِنْ دَابَّةٍ لَا تَحْمِلُ رِزْقَهَا اللَّهُ يَرْزُقُهَا وَإِيَّاكُمْ ۚ وَهُوَ السَّمِيعُ الْعَلِيمُ",
      "verseStringB": "And how many a living creature carries not its sustenance! Allāh sustains it and yourselves. And He is the Hearing, the Knowing.ᵃ"
    },
    {
      "verseNumber": 61,
      "verseString": "وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ لَيَقُولُنَّ اللَّهُ ۖ فَأَنَّىٰ يُؤْفَكُونَ",
      "verseStringB": "And if thou ask them, Who created the heavens and the earth and made the sun and the moon subservient? they would say, Allāh. Whence are they then turned away?"
    },
    {
      "verseNumber": 62,
      "verseString": "اللَّهُ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ مِنْ عِبَادِهِ وَيَقْدِرُ لَهُ ۚ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ",
      "verseStringB": "Allāh makes abundant the means of subsistence for whom He pleases of His servants, or straitens (them) for him. Surely Allāh is Knower of all things."
    },
    {
      "verseNumber": 63,
      "verseString": "وَلَئِنْ سَأَلْتَهُمْ مَنْ نَزَّلَ مِنَ السَّمَاءِ مَاءً فَأَحْيَا بِهِ الْأَرْضَ مِنْ بَعْدِ مَوْتِهَا لَيَقُولُنَّ اللَّهُ ۚ قُلِ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْقِلُونَ",
      "verseStringB": "And if thou ask them, Who is it that sends down water from the clouds, then gives life to the earth with it after its death? they will say, Allāh. Say: Praise be to Allāh! Nay, most of them understand not.ᵃ"
    },
    {
      "verseNumber": 64,
      "verseString": "وَمَا هَٰذِهِ الْحَيَاةُ الدُّنْيَا إِلَّا لَهْوٌ وَلَعِبٌ ۚ وَإِنَّ الدَّارَ الْآخِرَةَ لَهِيَ الْحَيَوَانُ ۚ لَوْ كَانُوا يَعْلَمُونَ",
      "verseStringB": "And the life of this world is but a sport and a play. And the home of the Hereafter, that surely is the Life, did they but know!"
    },
    {
      "verseNumber": 65,
      "verseString": "فَإِذَا رَكِبُوا فِي الْفُلْكِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ إِذَا هُمْ يُشْرِكُونَ",
      "verseStringB": "So when they ride in the ships, they call upon Allāh, being sincerely obedient to Him; but when He brings them safe to the land, lo! they associate others (with Him),"
    },
    {
      "verseNumber": 66,
      "verseString": "لِيَكْفُرُوا بِمَا آتَيْنَاهُمْ وَلِيَتَمَتَّعُوا ۖ فَسَوْفَ يَعْلَمُونَ",
      "verseStringB": "That they may be ungrateful for what We have given them, and that they may enjoy. But they shall soon know."
    },
    {
      "verseNumber": 67,
      "verseString": "أَوَلَمْ يَرَوْا أَنَّا جَعَلْنَا حَرَمًا آمِنًا وَيُتَخَطَّفُ النَّاسُ مِنْ حَوْلِهِمْ ۚ أَفَبِالْبَاطِلِ يُؤْمِنُونَ وَبِنِعْمَةِ اللَّهِ يَكْفُرُونَ",
      "verseStringB": "See they not that We have made a sacred territory secure, while men are carried off by force from around them?ᵃ Will they still believe in the falsehood and disbelieve in the favour of Allāh?"
    },
    {
      "verseNumber": 68,
      "verseString": "وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا أَوْ كَذَّبَ بِالْحَقِّ لَمَّا جَاءَهُ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِلْكَافِرِينَ",
      "verseStringB": "And who is more iniquitous than one who forges a lie against Allāh, or gives the lie to the Truth, when it has come to him? Is there not an abode in hell for the disbelievers?"
    },
    {
      "verseNumber": 69,
      "verseString": "وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا ۚ وَإِنَّ اللَّهَ لَمَعَ الْمُحْسِنِينَ",
      "verseStringB": "And those who strive hard for Us, We shall certainly guide them in Our ways. And Allāh is surely with the doers of goo"
    }
  ],
  "nameEnglish": "The Spider",
  "nameTrans": "al-'Ankabut",
  "nameArabic": "العنكبوت",
  "chapterNumber": 29,
  "nVerses": 69,
  "footnotes": [
    {
      "note": "1a. See 2:1a.\n\n      2a. By the trials spoken of in these verses are meant the persecutions of the believ-  ers by the disbelievers. This is made clear in v. 10. A misconception as to the nature of  these trials has led some critics to think that the ﬁrst ten verses must have been revealed  at Madßnah.\n\n      3a. The knowing in this case relates to a knowledge of the event when it takes place,  when reward or punishment is meted out to a man for what he does. Allåh knows what a  man will do but does not reward or punish, until He knows that the man has done a  deed.\n\n       6a. As shown in 25:52a, the word jihåd occurs in Makkan revelation frequently,  and carries its proper signiﬁcance of striving hard in Allåh’s way. The suffering of per-  secutions and tortures at the hands of their enemies for the sake of their faith was no less  a jihåd for the Muslims at Makkah than their ﬁghting in defence of Islåm at Madßnah.\n\n      7a, see next page.\n\n       7a. Kafara, as also kaffara, means originally he covered or concealed, and kaffara-  l-sayyi’at, he did away with the evil or effaced it (LL). Sayyi’ah has a double signiﬁ-  cance, it means an evil deed or a sin, as also an evil accident, a trial or an afﬂiction  (LL). Hence the words la-nukafﬁranna ‘an-hum sayyi’åti-him may signify either the  doing away with their afﬂictions or trials, or the doing away with their evil deeds. I pre-  fer the ﬁrst because it is of the trials and afﬂictions of the believers that these verses  speak. If the second signiﬁcance is adopted, it would mean that the evil deeds which the  believers did before they accepted the Truth would be effaced, because the course of  their lives was now changed.\n\n      8a. This verse, while signifying the importance of obedience to parents, warns  against attaching over-importance even to ﬁlial duty. It shows that when an important  duty clashes with a still higher one, the former is to be sacriﬁced for the latter. It is relat-  ed that when Sa‘d ibn Abß Waqqås became a convert to Islåm, his mother swore that she  would neither eat nor drink, until he reverted to disbelief, and that this verse was  revealed on that occasion. It is a further proof that these verses were revealed at  Makkah, because Sa‘d was one of the early converts. In fact, it was at Makkah that chil-  dren had to leave their parents on account of their conversion to Islåm, the parents not  allowing them to forsake their old religion.\n\n      10a. The meaning is that those who are weak in faith consider the persecution by the  disbelievers, which was necessary to strengthen and purify their faith, as if it were a pun-  ishment from Allåh for their change of faith. The latter part of the verse is a prophecy as  to what the weak in faith will say when they see the help of Allåh coming to the Muslims.\n\n  13a. It should be noted that the Qur’ån does not anywhere say that the burden of one  shall be taken away by another. Each one is responsible for what he does. The “other bur-  dens” are really their own burdens in misleading others, and thus the two burdens spoken  of here are the burden of one’s own wrongdoing and the burden of misleading others.\n\n       14a. The Bible gives 950 years to be the age of Noah. It is not improbable that the  span of man’s life may have been greater in his earlier history than at present, and Noah  may have attained an extraordinary age among his compatriots. But there are indications  that the reference here is to the abiding for 950 years of the law preached by Noah, his  place then being taken by Abraham, and the reference may be to these 950 years, as the  mention of Abraham immediately afterwards shows.\n\n   19a. The law of creation and destruction of things, which is constantly working in  nature, ﬁnds an expression in the lives of nations: a nation is brought into existence, then  it is swept away and a new nation raised in its stead. It is to this law that the verse refers  as a warning to the idolatrous Makkans that the time had now come when their place  would be taken by another nation. This is made clear in the verses that follow.        It should be noted that vv. 18 – 23 are parenthetical, being an address to the  opponents of the Holy Prophet. The Qur’ån frequently adopts this method of warning in  the middle of another narration, for its object is not to relate a story, but to warn those  who opposed the spread of Truth as revealed to the Holy Prophet.\n\n      20a. Elsewhere, the words travel in the earth are always followed by then see what  was the end of the rejectors, instead of which we have here how He makes the ﬁrst cre-  ation, then Allåh creates the latter creation. The apparent identity of the signiﬁcance of  these two statements is thus made clearer by the comparison, which shows that what is  meant is the disappearance of one nation to give place to another.\n\n  24a. As in 21:69, so here, it is not stated that Abraham was actually cast into the  ﬁre. On the other hand, the plan was either to slay or to burn him, and therefore the ﬁre  may only stand for the opposition which these plans involved.\n\n      26a. The words I am ﬂeeing to my Lord indicate his ﬂight to another country whith-  er he was commanded to ﬂee by his Lord. This is more clearly stated in 19:48: “And I  withdraw from you,” being followed by the statement made in 19:49: “So when he  withdrew from them”. This makes it further clear that his deliverance from the ﬁre was  brought about by his ﬂight to another country.      29a, see next page.\n\n      29a. Three evils are ascribed to Lot’s people — unnatural crime, highway robbery,  and openly committing evil deeds in their assemblies. Therefore it is a mistake to  explain all incidents in connection with Lot’s story only with reference to unnatural  crime as the sole evil of which they were guilty. QaΔ‘ al-sabßl is, according to Kf, “the  work of robbers, killing men and seizing their property”. JB adds after the words  taqΔa‘∂n al-sabßl by way of explaining them, “for they used to murder the passers-by  and rob them of their property”. Other commentators give similar explanations.\n\n      33a. Dhar‘ signiﬁes literally the stretching forth of the arm, and thus stands for  power or ability or extent of power; and ˙åqa bi-l-amri dhar‘-an means he was unable  to accomplish the affair, or he lacked strength to accomplish the affair (LL).\n\n     35a. Sodom and Gomorrah, the cities destroyed, are in the neighbourhood of the  Dead Sea, on the road from Arabia: “And it is on a road that still abides” (15:76).\n\n       40a. See 7:72a for the storm; 7:78a, 84a for the rumbling; 28:81a for the swallow-  ing; 2:50a, 7:64a for the drowning.\n\n   41a. A trust in false deities, which really stands for all false beliefs, is here com-  pared with a spider’s web to express the nature of its extreme frailty. It may prosper for  a time, but no sooner is the light of criticism and research brought to bear upon it than it  vanishes and leaves no trace behind.       There is also a reference here to the plans of the Holy Prophet’s opponents, which  were destined to be brought to naught by reason of their inability to withstand the over-  whelming advance of Truth.\n\n       45a. This verse invites the followers of all religions to accept the Qur’ån on account  of its purifying effect upon life, as the previous scriptures had ceased to effect deliverance  from the bondage of sin, which is the real object of revelation. The verse also lays down  the right principle for getting rid of the bondage of sin in the words the remembrance of  Allåh is the greatest, i.e., the most powerful and effective restraint upon sin. It is a living  belief in the Divine power, knowledge, and goodness that restrains man from walking in  the ways of His displeasure. A sure and certain knowledge that every evil action leads to  an evil consequence, that there is a Supreme Being, Who knows what is hid from human  eyes and Whose moral law is effective where the moral force of society fails, that He is  the source of all goodness and it is through goodness that man can have communion with  Him, are the only effective restraints upon evil.       It should also be noted that the recitation of the Book, the keeping up of prayer, and  the remembrance of Allåh are really identical; for the Qur’ån is recited in prayers, and  the Qur’ån is the best means of the remembrance of Allåh. Every line of it brings before  the mind of the reader the goodness, power, and knowledge of the Divine Being, while  there is no other Book which fulﬁls this requirement. The Qur’ån is neither a book of  law, though it contains the principles of the laws necessary for the guidance of man, nor  a book of sacred history, though it contains the necessary sacred history, but it is pre-  eminently a Book that manifests the glory, greatness, grandeur, goodness, love, purity,  power, and knowledge of the Supreme Being.       While, as generally understood, by the remembrance of Allåh is meant His gloriﬁca-  tion and praise in prayer, I‘Ab is reported to have said that by the dhikr (remembrance)  of Allåh is here meant Allåh’s remembrance of man or His raising him to a place of emi-  nence (IJ). Thus the signiﬁcance would be that through prayer to God, not only is man  freed from the bondage of sin, but (which is greater than this) he is raised to a place of  higher eminence.\n\n       46a. It should be noted that this passage deals only with the mode of controversy to  be adopted in inviting those who already had scriptures in their hands — which the  Arabs had not — to the truth of Islåm and the revelation of the Qur’ån. The Qur’ån  makes its own meaning clear when it explains that it is the broad principles of religion  that should demand paramount consideration. The fundamental principle of religion is  that God exists and that He reveals Himself to man, and it is common to all revealed  religions. The only difference is that a Muslim’s is a purer monotheism, a conception of  the Divine Being which gives the most perfect attributes to Him while declaring Him to  be free from all imperfections and weaknesses, a conception which cannot reasonably be  criticized by anyone who admits a belief in a Supreme Being. A Muslim’s conception of  Divine revelation is wider than that of the follower of any other religion, recognizing, as  it does, that Divine revelation is granted in all ages and to all nations. A Muslim, there-  fore, admits the truth of all the prophets and revelations, and the follower of any other  religion has nothing to lose but everything to gain by accepting Islåm.\n\n      46b. The signiﬁcance of the words save such of them as act unjustly is not that  controversy is to be carried on with these in a different manner, but that the unjust  would not accept this reasonable interpretation of the principles of religion. This is made  clear in the verse that follows.\n\n      47a. And thus have We revealed the Book; that is, by conﬁrming the truth of all previ-  ous revelation.\n\n  47b. The reference in these is to the Arabs, who possessed no sacred scriptures.\n\n       48a. The broad principles of religion and the beautiful moral and spiritual truths which  ﬁnd expression in the Qur’ån could not have been collected, if such a collection by human  exertion were possible, except by one who had knowledge of all the previous scriptures; but  the Holy Prophet had not read even a single book. He could neither read nor write. What  might have been said against a prophet like Jesus, that he had read the previous scriptures  and collected some beautiful truths from them, could not be said against the Holy Prophet,  for the latter could neither read nor write, and his inability to do either is thus a conﬁrmation  of his truth. Leaving aside all the principles and truths, if we consider the broad principles  that Islåm taught with regard to the truth of Divine revelation in all ages and to all nations, a  truth never taught or recognized by any religion or by any man before the Holy Prophet, it  is remarkable that such a broad truth should have been preached by one who had never read  the scriptures of any religion and who lived in a country which was almost cut off from all  communication with other countries. See also 7:157a.\n\n      49a. The Qur’ån contains not only truths which are met with in previous scriptures,  but also others which are not to be found in any scripture, and which are only in the  breasts of the learned ones, or those that may ever be conceived by the learned ones.  What the most progressive religious thought of today considers desirable for the basis of  a common religion of humanity is met with in Islåm.\n\n      50a. The Prophet is a warner, and gives warning in due time that the signs are with  Allåh, Whose power to send these signs they deny. Read also in this connection vv. 53–  55, which uphold the coming of the punishment, leaving no doubt as to the meaning of  signs being with Allåh.\n\n    51a. This is another reply to those who demanded signs. The Qur’ån is a mercy, if  they would only accept it. They could see how the believers had beneﬁted by it; how a  wonderful transformation had been wrought in their lives. Was it not a sufﬁcient sign for  them? Indeed, this was direct evidence of the truth of the Holy Word, for to effect a pure  transformation in the lives of those who would follow it was its avowed object, while  the overthrow of its enemies was only an indirect testimony.\n\n      54a. Here the punishment of this life, which the disbelievers would hasten, is called  a hell. If this verse is taken as indicating the punishment of the life after death, it is a  transition from the punishment of this life to the punishment after death.\n\n      55a. The expression used is simply to indicate the all-encompassing nature of the  punishment, which will not leave them a way to escape. Compare 6:65, and see 6:65a.     56a. This is to comfort the Muslims against the severe persecutions by their  enemies. If they are persecuted at Makkah, they will ﬁnd a refuge elsewhere.\n\n      60a. This is a consolation to the Muslims that the giving up of their concerns and  business at Makkah will not lead to their ruin.\n\n      63a. Most of them did not understand that the dead earth was now about to be raised to life.\n\n        67a. The √aram (“sacred territory”) includes the city of Makkah and several miles  of territory around it. War is forbidden within these limits. The reference in men are  carried off by force is to the great insecurity of life and property in Arabia, while no one  dared violate the sacredness of Makkah.\n\n      "
    }
  ]
}
