{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "الم",
      "verseStringB": "I, Allāh, am the Best Knower.ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "غُلِبَتِ الرُّومُ",
      "verseStringB": "The Romans are vanquisheda"
    },
    {
      "verseNumber": 3,
      "verseString": "فِي أَدْنَى الْأَرْضِ وَهُمْ مِنْ بَعْدِ غَلَبِهِمْ سَيَغْلِبُونَ",
      "verseStringB": "In a near land, and they, after their defeat, will gain victorya"
    },
    {
      "verseNumber": 4,
      "verseString": "فِي بِضْعِ سِنِينَ ۗ لِلَّهِ الْأَمْرُ مِنْ قَبْلُ وَمِنْ بَعْدُ ۚ وَيَوْمَئِذٍ يَفْرَحُ الْمُؤْمِنُونَ",
      "verseStringB": "Within nine years. Allāh’s is the command before and after. And on that day the believers will rejoice"
    },
    {
      "verseNumber": 5,
      "verseString": "بِنَصْرِ اللَّهِ ۚ يَنْصُرُ مَنْ يَشَاءُ ۖ وَهُوَ الْعَزِيزُ الرَّحِيمُ",
      "verseStringB": "In Allāh’s help.ᵃ He helps whom He pleases, and He is the Mighty, the Merciful —"
    },
    {
      "verseNumber": 6,
      "verseString": "وَعْدَ اللَّهِ ۖ لَا يُخْلِفُ اللَّهُ وَعْدَهُ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ",
      "verseStringB": "(It is) Allāh’s promise! Allāh will not fail in His promise, but most people know not."
    },
    {
      "verseNumber": 7,
      "verseString": "يَعْلَمُونَ ظَاهِرًا مِنَ الْحَيَاةِ الدُّنْيَا وَهُمْ عَنِ الْآخِرَةِ هُمْ غَافِلُونَ",
      "verseStringB": "They know the outward of this world’s life, but of the Hereafter they are heedless."
    },
    {
      "verseNumber": 8,
      "verseString": "أَوَلَمْ يَتَفَكَّرُوا فِي أَنْفُسِهِمْ ۗ مَا خَلَقَ اللَّهُ السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ وَأَجَلٍ مُسَمًّى ۗ وَإِنَّ كَثِيرًا مِنَ النَّاسِ بِلِقَاءِ رَبِّهِمْ لَكَافِرُونَ",
      "verseStringB": "Do they not reflect within themselves? Allāh did not create the heavens and the earth and what is between them but with truth, and (for) an appointed term. And surely most of the people are deniers of the meeting with their Lord."
    },
    {
      "verseNumber": 9,
      "verseString": "أَوَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِنْ قَبْلِهِمْ ۚ كَانُوا أَشَدَّ مِنْهُمْ قُوَّةً وَأَثَارُوا الْأَرْضَ وَعَمَرُوهَا أَكْثَرَ مِمَّا عَمَرُوهَا وَجَاءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ ۖ فَمَا كَانَ اللَّهُ لِيَظْلِمَهُمْ وَلَٰكِنْ كَانُوا أَنْفُسَهُمْ يَظْلِمُونَ",
      "verseStringB": "Have they not travelled in the earth and seen what was the end of those before them? They were stronger than these in prowess, and dug up the earth,ᵃ and built on it more than these have built. And their messengers came to them with clear arguments. So it was not Allāh, Who wronged them, but they wronged themselves."
    },
    {
      "verseNumber": 10,
      "verseString": "ثُمَّ كَانَ عَاقِبَةَ الَّذِينَ أَسَاءُوا السُّوأَىٰ أَنْ كَذَّبُوا بِآيَاتِ اللَّهِ وَكَانُوا بِهَا يَسْتَهْزِئُونَ",
      "verseStringB": "Then evil was the end of those who did evil, because they rejected the messages of Allāh and mocked at them."
    },
    {
      "verseNumber": 11,
      "verseString": "اللَّهُ يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ ثُمَّ إِلَيْهِ تُرْجَعُونَ",
      "verseStringB": "Allāh origInᵃ tes the creation, then reproduces it, then to Him you will be returned."
    },
    {
      "verseNumber": 12,
      "verseString": "وَيَوْمَ تَقُومُ السَّاعَةُ يُبْلِسُ الْمُجْرِمُونَ",
      "verseStringB": "And the day when the Hour comes, the guilty will despair."
    },
    {
      "verseNumber": 13,
      "verseString": "وَلَمْ يَكُنْ لَهُمْ مِنْ شُرَكَائِهِمْ شُفَعَاءُ وَكَانُوا بِشُرَكَائِهِمْ كَافِرِينَ",
      "verseStringB": "And they will have no intercessors from among their associate-gods, and they will deny their associate-gods."
    },
    {
      "verseNumber": 14,
      "verseString": "وَيَوْمَ تَقُومُ السَّاعَةُ يَوْمَئِذٍ يَتَفَرَّقُونَ",
      "verseStringB": "And the day when the Hour comes, that day they will be separated one from the other."
    },
    {
      "verseNumber": 15,
      "verseString": "فَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَهُمْ فِي رَوْضَةٍ يُحْبَرُونَ",
      "verseStringB": "Then as to those who believed and did good, they will be made happy in a garden."
    },
    {
      "verseNumber": 16,
      "verseString": "وَأَمَّا الَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا وَلِقَاءِ الْآخِرَةِ فَأُولَٰئِكَ فِي الْعَذَابِ مُحْضَرُونَ",
      "verseStringB": "And as for those who disbelieved and rejected Our messages and the meeting of the Hereafter, they will be brought to chastisement."
    },
    {
      "verseNumber": 17,
      "verseString": "فَسُبْحَانَ اللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ",
      "verseStringB": "So glory be to Allāh when you enter the evening and when you enter the morning."
    },
    {
      "verseNumber": 18,
      "verseString": "وَلَهُ الْحَمْدُ فِي السَّمَاوَاتِ وَالْأَرْضِ وَعَشِيًّا وَحِينَ تُظْهِرُونَ",
      "verseStringB": "And to Him be praise in the heavens and the earth, and in the afternoon, and when the sun declines.ᵃ"
    },
    {
      "verseNumber": 19,
      "verseString": "يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَيُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَيُحْيِي الْأَرْضَ بَعْدَ مَوْتِهَا ۚ وَكَذَٰلِكَ تُخْرَجُونَ",
      "verseStringB": "He brings forth the living from the dead and brings forth the dead from the living, and gives life to the earth after its death. And thus will you be brought forth.ᵃ"
    },
    {
      "verseNumber": 20,
      "verseString": "وَمِنْ آيَاتِهِ أَنْ خَلَقَكُمْ مِنْ تُرَابٍ ثُمَّ إِذَا أَنْتُمْ بَشَرٌ تَنْتَشِرُونَ",
      "verseStringB": "And of His signs is this, that He created you from dust, then lo! you are mortals (who) scatter."
    },
    {
      "verseNumber": 21,
      "verseString": "وَمِنْ آيَاتِهِ أَنْ خَلَقَ لَكُمْ مِنْ أَنْفُسِكُمْ أَزْوَاجًا لِتَسْكُنُوا إِلَيْهَا وَجَعَلَ بَيْنَكُمْ مَوَدَّةً وَرَحْمَةً ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ",
      "verseStringB": "And of His signs is this, that He created mates for you from yourselves that you might find quiet of mind in them, and He put between you love and compassion.ᵃ Surely there are signs in this for a people who reflect."
    },
    {
      "verseNumber": 22,
      "verseString": "وَمِنْ آيَاتِهِ خَلْقُ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافُ أَلْسِنَتِكُمْ وَأَلْوَانِكُمْ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِلْعَالِمِينَ",
      "verseStringB": "And of His signs is the creation of the heavens and the earth and the diversity of your tongues and colours. Surely there are signs in this for the learned."
    },
    {
      "verseNumber": 23,
      "verseString": "وَمِنْ آيَاتِهِ مَنَامُكُمْ بِاللَّيْلِ وَالنَّهَارِ وَابْتِغَاؤُكُمْ مِنْ فَضْلِهِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَسْمَعُونَ",
      "verseStringB": "And of His signs is your sleep by night and by day and your seeking of His bounty. Surely there are signs in this for a people who would hear."
    },
    {
      "verseNumber": 24,
      "verseString": "وَمِنْ آيَاتِهِ يُرِيكُمُ الْبَرْقَ خَوْفًا وَطَمَعًا وَيُنَزِّلُ مِنَ السَّمَاءِ مَاءً فَيُحْيِي بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَعْقِلُونَ",
      "verseStringB": "And of His signs is this, that He shows you the lightning for fear and for hope, and sends down water from the cloud, then gives life therewith to the earth after its death. Surely there are signs in this for a people who understand."
    },
    {
      "verseNumber": 25,
      "verseString": "وَمِنْ آيَاتِهِ أَنْ تَقُومَ السَّمَاءُ وَالْأَرْضُ بِأَمْرِهِ ۚ ثُمَّ إِذَا دَعَاكُمْ دَعْوَةً مِنَ الْأَرْضِ إِذَا أَنْتُمْ تَخْرُجُونَ",
      "verseStringB": "And of His signs is this, that the heaven and the earth subsist by His command. Then when He calls you — from the earth — lo! you come forth."
    },
    {
      "verseNumber": 26,
      "verseString": "وَلَهُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ كُلٌّ لَهُ قَانِتُونَ",
      "verseStringB": "And His is whosoever is in the heavens and the earth. All are obedient to Him."
    },
    {
      "verseNumber": 27,
      "verseString": "وَهُوَ الَّذِي يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْهِ ۚ وَلَهُ الْمَثَلُ الْأَعْلَىٰ فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "And He it is, Who origInᵃ tes the creation, then reproduces it, and it is very easy to Him. And His is the most exalted state in the heavens and the earth; and He is the Mighty, the Wise.ᵃ"
    },
    {
      "verseNumber": 28,
      "verseString": "ضَرَبَ لَكُمْ مَثَلًا مِنْ أَنْفُسِكُمْ ۖ هَلْ لَكُمْ مِنْ مَا مَلَكَتْ أَيْمَانُكُمْ مِنْ شُرَكَاءَ فِي مَا رَزَقْنَاكُمْ فَأَنْتُمْ فِيهِ سَوَاءٌ تَخَافُونَهُمْ كَخِيفَتِكُمْ أَنْفُسَكُمْ ۚ كَذَٰلِكَ نُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَعْقِلُونَ",
      "verseStringB": "He sets forth to you a parable relating to yourselves.ᵃ Have you among those whom your right hands possess partners in that which We have provided you with, so that with respect to it you are alike — you fear them as you fear each other? Thus do We make the messages clear for a people who understand."
    },
    {
      "verseNumber": 29,
      "verseString": "بَلِ اتَّبَعَ الَّذِينَ ظَلَمُوا أَهْوَاءَهُمْ بِغَيْرِ عِلْمٍ ۖ فَمَنْ يَهْدِي مَنْ أَضَلَّ اللَّهُ ۖ وَمَا لَهُمْ مِنْ نَاصِرِينَ",
      "verseStringB": "Nay, those who are unjust follow their low desires without any knowledge; so who can guide him whom Allāh leaves in error? And they shall have no helpers."
    },
    {
      "verseNumber": 30,
      "verseString": "فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًا ۚ فِطْرَتَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا ۚ لَا تَبْدِيلَ لِخَلْقِ اللَّهِ ۚ ذَٰلِكَ الدِّينُ الْقَيِّمُ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ",
      "verseStringB": "So set thy face for religion, being upright, the nature made by Allāh in which He has created men. There is no altering Allāh’s creation. That is the right religion — but most people know nota—"
    },
    {
      "verseNumber": 31,
      "verseString": "مُنِيبِينَ إِلَيْهِ وَاتَّقُوهُ وَأَقِيمُوا الصَّلَاةَ وَلَا تَكُونُوا مِنَ الْمُشْرِكِينَ",
      "verseStringB": "Turning to Him; and keep your duty to Him, and keep up prayer and be not of the polytheists,"
    },
    {
      "verseNumber": 32,
      "verseString": "مِنَ الَّذِينَ فَرَّقُوا دِينَهُمْ وَكَانُوا شِيَعًا ۖ كُلُّ حِزْبٍ بِمَا لَدَيْهِمْ فَرِحُونَ",
      "verseStringB": "Of those who split up their religion and become parties; every sect rejoicing in that which is with it."
    },
    {
      "verseNumber": 33,
      "verseString": "وَإِذَا مَسَّ النَّاسَ ضُرٌّ دَعَوْا رَبَّهُمْ مُنِيبِينَ إِلَيْهِ ثُمَّ إِذَا أَذَاقَهُمْ مِنْهُ رَحْمَةً إِذَا فَرِيقٌ مِنْهُمْ بِرَبِّهِمْ يُشْرِكُونَ",
      "verseStringB": "And when harm afflicts men, they call upon their Lord, turning to Him, then when He makes them taste of mercy from Him, lo! some of them begin to associate (others) with their Lord,"
    },
    {
      "verseNumber": 34,
      "verseString": "لِيَكْفُرُوا بِمَا آتَيْنَاهُمْ ۚ فَتَمَتَّعُوا فَسَوْفَ تَعْلَمُونَ",
      "verseStringB": "So as to be ungrateful for that which We have given them. So enjoy yourselves a while — you will soon come to know."
    },
    {
      "verseNumber": 35,
      "verseString": "أَمْ أَنْزَلْنَا عَلَيْهِمْ سُلْطَانًا فَهُوَ يَتَكَلَّمُ بِمَا كَانُوا بِهِ يُشْرِكُونَ",
      "verseStringB": "Or, have We sent to them an authority so that it speaks of that which they associate with Him?ᵃ"
    },
    {
      "verseNumber": 36,
      "verseString": "وَإِذَا أَذَقْنَا النَّاسَ رَحْمَةً فَرِحُوا بِهَا ۖ وَإِنْ تُصِبْهُمْ سَيِّئَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ إِذَا هُمْ يَقْنَطُونَ",
      "verseStringB": "And when We make people taste of mercy they rejoice in it, and if an evil befall them for what their hands have already wrought, lo! they despair."
    },
    {
      "verseNumber": 37,
      "verseString": "أَوَلَمْ يَرَوْا أَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِرُ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يُؤْمِنُونَ",
      "verseStringB": "See they not that Allāh enlarges provision and straitens (it) for whom He pleases? Certainly there are signs in this for a people who believe."
    },
    {
      "verseNumber": 38,
      "verseString": "فَآتِ ذَا الْقُرْبَىٰ حَقَّهُ وَالْمِسْكِينَ وَابْنَ السَّبِيلِ ۚ ذَٰلِكَ خَيْرٌ لِلَّذِينَ يُرِيدُونَ وَجْهَ اللَّهِ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
      "verseStringB": "So give to the near of kin his due, and to the needy and the wayfarer. This is best for those who desire Allāh’s pleasure, and these it is who are successful.ᵃ"
    },
    {
      "verseNumber": 39,
      "verseString": "وَمَا آتَيْتُمْ مِنْ رِبًا لِيَرْبُوَ فِي أَمْوَالِ النَّاسِ فَلَا يَرْبُو عِنْدَ اللَّهِ ۖ وَمَا آتَيْتُمْ مِنْ زَكَاةٍ تُرِيدُونَ وَجْهَ اللَّهِ فَأُولَٰئِكَ هُمُ الْمُضْعِفُونَ",
      "verseStringB": "And whatever you lay out at usury, so that it may increase in the property of men, it increases not with Allāh; and whatever you give in charity, desiring Allāh’s pleasure — these will get manifold.ᵃ"
    },
    {
      "verseNumber": 40,
      "verseString": "اللَّهُ الَّذِي خَلَقَكُمْ ثُمَّ رَزَقَكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ۖ هَلْ مِنْ شُرَكَائِكُمْ مَنْ يَفْعَلُ مِنْ ذَٰلِكُمْ مِنْ شَيْءٍ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ",
      "verseStringB": "Allāh is He Who created you, then He sustains you, then He causes you to die, then brings you to life. Is there any of your associate-gods who does aught of it? Glory be to Him, and exalted be He above what they associate (with Him)!"
    },
    {
      "verseNumber": 41,
      "verseString": "ظَهَرَ الْفَسَادُ فِي الْبَرِّ وَالْبَحْرِ بِمَا كَسَبَتْ أَيْدِي النَّاسِ لِيُذِيقَهُمْ بَعْضَ الَّذِي عَمِلُوا لَعَلَّهُمْ يَرْجِعُونَ",
      "verseStringB": "Corruption has appeared in the land and the sea on account of that which men’s hands have wrought, that He may make them taste a part of that which they have done, so that they may return.ᵃ"
    },
    {
      "verseNumber": 42,
      "verseString": "قُلْ سِيرُوا فِي الْأَرْضِ فَانْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِنْ قَبْلُ ۚ كَانَ أَكْثَرُهُمْ مُشْرِكِينَ",
      "verseStringB": "Say: Travel in the land, then see what was the end of those before! Most of them were polytheists.ᵃ"
    },
    {
      "verseNumber": 43,
      "verseString": "فَأَقِمْ وَجْهَكَ لِلدِّينِ الْقَيِّمِ مِنْ قَبْلِ أَنْ يَأْتِيَ يَوْمٌ لَا مَرَدَّ لَهُ مِنَ اللَّهِ ۖ يَوْمَئِذٍ يَصَّدَّعُونَ",
      "verseStringB": "Then set thyself, being upright, to the right religion before there come from Allāh the day which cannot be averted: on that day they will be separated."
    },
    {
      "verseNumber": 44,
      "verseString": "مَنْ كَفَرَ فَعَلَيْهِ كُفْرُهُ ۖ وَمَنْ عَمِلَ صَالِحًا فَلِأَنْفُسِهِمْ يَمْهَدُونَ",
      "verseStringB": "Whoever disbelieves will be responsible for his disbelief; and whoever does good, such prepare (good) for their own souls,"
    },
    {
      "verseNumber": 45,
      "verseString": "لِيَجْزِيَ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ مِنْ فَضْلِهِ ۚ إِنَّهُ لَا يُحِبُّ الْكَافِرِينَ",
      "verseStringB": "That He may reward out of His grace those who believe and do good. Surely He loves not the disbelievers."
    },
    {
      "verseNumber": 46,
      "verseString": "وَمِنْ آيَاتِهِ أَنْ يُرْسِلَ الرِّيَاحَ مُبَشِّرَاتٍ وَلِيُذِيقَكُمْ مِنْ رَحْمَتِهِ وَلِتَجْرِيَ الْفُلْكُ بِأَمْرِهِ وَلِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ",
      "verseStringB": "And of His signs is this, that He sends forth the winds bearing good news, and that He may make you taste of His mercy, and that the ships may glide by His command, and that you may seek of His grace, and that you may be grateful.ᵃ"
    },
    {
      "verseNumber": 47,
      "verseString": "وَلَقَدْ أَرْسَلْنَا مِنْ قَبْلِكَ رُسُلًا إِلَىٰ قَوْمِهِمْ فَجَاءُوهُمْ بِالْبَيِّنَاتِ فَانْتَقَمْنَا مِنَ الَّذِينَ أَجْرَمُوا ۖ وَكَانَ حَقًّا عَلَيْنَا نَصْرُ الْمُؤْمِنِينَ",
      "verseStringB": "And certainly We sent before thee messengers to their people, so they came to them with clear arguments, then We punished those who were guilty. And to help believers is ever incumbent on Us."
    },
    {
      "verseNumber": 48,
      "verseString": "اللَّهُ الَّذِي يُرْسِلُ الرِّيَاحَ فَتُثِيرُ سَحَابًا فَيَبْسُطُهُ فِي السَّمَاءِ كَيْفَ يَشَاءُ وَيَجْعَلُهُ كِسَفًا فَتَرَى الْوَدْقَ يَخْرُجُ مِنْ خِلَالِهِ ۖ فَإِذَا أَصَابَ بِهِ مَنْ يَشَاءُ مِنْ عِبَادِهِ إِذَا هُمْ يَسْتَبْشِرُونَ",
      "verseStringB": "Allāh is He Who sends forth the winds, so they raise a cloud, then He spreads it forth in the sky as He pleases, and He breaks it, so that you see the rain coming forth from inside it; then when He causes it to fall upon whom He pleases of His servants, lo! they rejoice —"
    },
    {
      "verseNumber": 49,
      "verseString": "وَإِنْ كَانُوا مِنْ قَبْلِ أَنْ يُنَزَّلَ عَلَيْهِمْ مِنْ قَبْلِهِ لَمُبْلِسِينَ",
      "verseStringB": "Though they were before this, before it was sent down upon them, in sure despair."
    },
    {
      "verseNumber": 50,
      "verseString": "فَانْظُرْ إِلَىٰ آثَارِ رَحْمَتِ اللَّهِ كَيْفَ يُحْيِي الْأَرْضَ بَعْدَ مَوْتِهَا ۚ إِنَّ ذَٰلِكَ لَمُحْيِي الْمَوْتَىٰ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "Look then at the signs of Allāh’s mercy, how He gives life to the earth after its death. Surely He is the Quickener of the dead; and He is Possessor of power over all things."
    },
    {
      "verseNumber": 51,
      "verseString": "وَلَئِنْ أَرْسَلْنَا رِيحًا فَرَأَوْهُ مُصْفَرًّا لَظَلُّوا مِنْ بَعْدِهِ يَكْفُرُونَ",
      "verseStringB": "And if We send a wind and they see it yellow, they would after that certainly continue to disbelieve.ᵃ"
    },
    {
      "verseNumber": 52,
      "verseString": "فَإِنَّكَ لَا تُسْمِعُ الْمَوْتَىٰ وَلَا تُسْمِعُ الصُّمَّ الدُّعَاءَ إِذَا وَلَّوْا مُدْبِرِينَ",
      "verseStringB": "So surely thou canst not make the dead to hear, nor canst thou make the deaf to hear the call, when they turn back retreating."
    },
    {
      "verseNumber": 53,
      "verseString": "وَمَا أَنْتَ بِهَادِ الْعُمْيِ عَنْ ضَلَالَتِهِمْ ۖ إِنْ تُسْمِعُ إِلَّا مَنْ يُؤْمِنُ بِآيَاتِنَا فَهُمْ مُسْلِمُونَ",
      "verseStringB": "Nor canst thou guide the blind out of their error. Thou canst make none to hear but those who believe in Our messages, so they submit."
    },
    {
      "verseNumber": 54,
      "verseString": "اللَّهُ الَّذِي خَلَقَكُمْ مِنْ ضَعْفٍ ثُمَّ جَعَلَ مِنْ بَعْدِ ضَعْفٍ قُوَّةً ثُمَّ جَعَلَ مِنْ بَعْدِ قُوَّةٍ ضَعْفًا وَشَيْبَةً ۚ يَخْلُقُ مَا يَشَاءُ ۖ وَهُوَ الْعَلِيمُ الْقَدِيرُ",
      "verseStringB": "Allāh is He Who created you from a state of weakness, then He gave strength after weakness, then ordained weakness and hoary hair after strength.ᵃ He creates what He pleases, and He is the Knowing, the Powerful."
    },
    {
      "verseNumber": 55,
      "verseString": "وَيَوْمَ تَقُومُ السَّاعَةُ يُقْسِمُ الْمُجْرِمُونَ مَا لَبِثُوا غَيْرَ سَاعَةٍ ۚ كَذَٰلِكَ كَانُوا يُؤْفَكُونَ",
      "verseStringB": "And the day when the Hour comes, the guilty will swear: They did not tarry but an hour. Thus are they ever turned away."
    },
    {
      "verseNumber": 56,
      "verseString": "وَقَالَ الَّذِينَ أُوتُوا الْعِلْمَ وَالْإِيمَانَ لَقَدْ لَبِثْتُمْ فِي كِتَابِ اللَّهِ إِلَىٰ يَوْمِ الْبَعْثِ ۖ فَهَٰذَا يَوْمُ الْبَعْثِ وَلَٰكِنَّكُمْ كُنْتُمْ لَا تَعْلَمُونَ",
      "verseStringB": "And those who are given knowledge and faith will say: Certainly you tarried according to the ordInᵃ nce of Allāh till the day of Resurrection — so this is the day of Resurrection — but you did not know."
    },
    {
      "verseNumber": 57,
      "verseString": "فَيَوْمَئِذٍ لَا يَنْفَعُ الَّذِينَ ظَلَمُوا مَعْذِرَتُهُمْ وَلَا هُمْ يُسْتَعْتَبُونَ",
      "verseStringB": "So that day their excuse will not profit those who were unjust, nor will they be granted goodwill."
    },
    {
      "verseNumber": 58,
      "verseString": "وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِي هَٰذَا الْقُرْآنِ مِنْ كُلِّ مَثَلٍ ۚ وَلَئِنْ جِئْتَهُمْ بِآيَةٍ لَيَقُولَنَّ الَّذِينَ كَفَرُوا إِنْ أَنْتُمْ إِلَّا مُبْطِلُونَ",
      "verseStringB": "And certainly We have set forth for men in this Qur’ān every kind of parable. And if thou bring them a sign, those who disbelieve would certainly say: You are naught but deceivers."
    },
    {
      "verseNumber": 59,
      "verseString": "كَذَٰلِكَ يَطْبَعُ اللَّهُ عَلَىٰ قُلُوبِ الَّذِينَ لَا يَعْلَمُونَ",
      "verseStringB": "Thus does Allāh seal the hearts of those who know not.ᵃ"
    },
    {
      "verseNumber": 60,
      "verseString": "فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ ۖ وَلَا يَسْتَخِفَّنَّكَ الَّذِينَ لَا يُوقِنُونَ",
      "verseStringB": "So be patient; surely the promise of Allāh is true; and let not those disquiet thee who have no certainty"
    }
  ],
  "nameEnglish": "The Romans",
  "nameTrans": "ar-Rum",
  "nameArabic": "الروم",
  "chapterNumber": 30,
  "nVerses": 60,
  "footnotes": [
    {
      "note": "1a. See 2:1a.\n\n 2a. The people of the empire called themselves Romans, and to them Greek, which   was synonymous with heathen, was a term of reproach (Butler’s Arab Conquest of   Egypt, footnote, p. 141).\n\n        3a. The struggle between Persia and the Roman Empire had existed for a long time.   The great struggle, in which Persia was victorious, began in 602 of the Christian era,   when Chosroes II of Persia began war with Rome to avenge the death of Maurice, who   was murdered by Phocas. “His armies plundered Syria and Asia Minor, and in 608   advanced to Chalcedon. In 613 and 614 Damascus and Jerusalem were taken by the   General Shahabaraz, and the Holy Cross was carried away in triumph. Soon after, even   Egypt was conquered. The Romans could offer but little resistance, as they were torn by   internal dissensions and pressed by the Avars and Slavs” (En. Br., Art. “Chosroes II”).   When the news of this conquest reached Makkah, the Quraish were jubilant, as their sym-   pathies were with the ﬁre-worshipping Persians more than with the Christians, who,   being the followers of the scriptures, were classed by them with the Muslims. It was in   the year 615 or 616 that this revelation came to the Prophet, containing two different   prophecies, one about the vanquishment of the victorious Persians, who had reached the   very gates of Constantinople, by the Romans, who were by this time quite exhausted, and   the other about the vanquishment of the powerful Makkans by the handful of persecuted   Muslims.        It is noteworthy that a time limit was also announced along with these two prophecies,   during which they would be brought to fulﬁlment. The word bi˙‘ occurring in the begin-   ning of the next verse means from three to nine years, both inclusive, according to the best   authorities (LL). It was exactly within nine years, in the year 624 of the Christian era, that   the tables were turned against the powerful Persian Empire, the same being the year in   which the mighty Quraish suffered a defeat at the hands of the helpless Muslims at Badr.        “In 624 he (Heraclius) advanced into northern Media, where he destroyed the great   ﬁre-temple of Goudzak” (En. Br., Art. “Chosroes II”). In the same year, 313 Muslims,   many of whom were raw, inexperienced youths without any arms, routed a strong force   of about a thousand of the Quraish warriors, killing all the leaders and dealing a death-   blow to the power of the enemy. The successes of the Muslim army, on the one hand,   and of the Romans, on the other, continued until the Quraish were utterly crushed by the   conquest of Makkah in 630, while “the Persian Empire, from the apparent greatness   which it had reached ten years ago, sank into hopeless anarchy” (En. Br.).        Rodwell tries to mitigate the force of the prophecy by saying that the vowel-points   were given later, and therefore the prophecy could be read either way, i.e., either   as translated above, “And they, after their defeat, will gain victory”, or reading   sa-yughlab∂n, “And they, after their defeat, will be defeated”. In fact, thus read the   statement is quite meaningless, because there is no sense at all in saying that they will be   defeated after their defeat. The addition, however, of the words on that day the believers   will rejoice makes it quite certain that the word is yaghlib∂n — they will gain victory —   as it was the victory of the Romans which could make the believers rejoice. There is no   doubt that actual ignorance of the manner in which the revelation of the Qur’ån was   propagated is the only excuse one can offer for such an absurd suggestion. Every portion   revealed was committed to memory by large numbers and was repeated over and over in   prayers in congregation, and the vowel-points could not be left undecided. Moreover,   there is clear evidence that when this verse was revealed, Ab∂ Bakr asserted in a public   assembly that the Romans would defeat their enemies within three years, and Ubayy ibn   Khalf, an unbeliever, denied this, and ten camels were betted on the issue. This coming   to the Holy Prophet’s knowledge, he told Ab∂ Bakr that the time-limit of three years   was not correct, for bi˙‘ signified from three to nine years. The time-limit was accordingly extended and the bet raised to a hundred camels (IJ). This further shows how sure   were the companions and the Holy Prophet himself of the fulfilment of the prophecy.   Betting, of course, was disallowed long afterwards in Madßnah.\n\n   5a. The help of Allåh is the help that was over and over again promised to the   believers against the idolatrous Makkans. Thus we have here a clear prophecy of the victory of the Muslims over the Makkans within nine years from the pronouncement of the   prophecy. It was fulfilled in the battle of Badr.\n\n   9a. The digging of the earth includes its ploughing for cultivation, its digging for   minerals and the making of aqueducts, as also the laying of the foundations of buildings.\n\n    18a. The five times of prayer are clearly indicated in this and the previous verse, the   evening prayer comprising both the prayer at sunset and the later evening prayer. The five   times of prayer were observed at Makkah, and places at which the Muslims gathered for   prayers are mentioned in reports relating to very early days of the Prophet’s mission.\n\n   19a. This clearly points to the rising of a great nation from the Arabs, who were   spiritually as well as intellectually dead.\n\n   21a. The close relation between the male and the female (i.e., husband and wife) is   expressed in words which indicate the closeness of the union to such an extent as to   have misled many to suppose that the act of the physical creation of the female from the   male is implied. But the Qur’ån explains itself when it refers to the ties of love and compassion, and to the quietness of mind which a married person finds in his mate. The   verse gives us the Islamic ideal of marriage which serves the purpose not only of the   increase of the human race but also that of the spiritual advancement of both the man   and the woman by referring to the quietness of mind which they find in each other.\n\n   27a. Mathal, the word translated as state here, means really ©ifat, i.e., description,   condition, state or case; and it is then used as meaning a description by way of comparison or a similitude (LL).\n\n   28a. If the master and the slave are not equal, how can inanimate objects, such as   stones, from among His creatures be equal to the Creator, Who is the Intelligent Cause   and Controller of all?\n\n   30a. Islåm according to this verse is the natural religion of man, or a religion to the   truth of which human nature bears testimony. Its fundamental principles, the Unity and   all-comprehensive providence of Allåh, the universality of Divine revelation, and the   accountability for all actions in a life after death, are recognized by all religions and all   nations, and their universal acceptance is a clear evidence that it is the very nature of   man that bears testimony to their truth. Islåm removes all limitations upon these three   fundamental doctrines of the religion of humanity, and gives them as wide a significance   as humanity itself. No other religion in the world has claimed to be the natural religion   of man. There is a saying of the Holy Prophet to the same effect: “Every child that is   born conforms to the true religion (literally, human nature), then his parents make him a   Jew or a Christian or a Magian, as a beast is born entire in all its limbs (or without a   defect); do you see one born maimed and mutilated?” Then he repeated (i.e., in support   of what he said): “The nature made by Allåh in which He has created men; there is no   altering Allåh’s creation. That is the right religion” (B. 23:93). For the meaning of   fiΔrah, see 35:1a. The other fundamental principle of the natural religion of man is   referred to further on in vv. 38, 39.\n\n   35a, see next page.\n\n   35a. No prophet can be shown to have received a revelation setting up creatures on   an equal or co-operative plane with the Creator. Every such doctrine, besides being   against the testimony of human nature and reason, stands condemned because of the   absence of any revelation in its support.\n\n   38a. Charity to man is the practical outcome of the doctrine of the brotherhood of   man, which is one of the two principles of the natural religion of man. As Islåm has   made the doctrine of the brotherhood of man a practical doctrine, it is always referred to   in the Qur’ån in words enjoining charity on man for his brother-man.\n\n   39a. This verse lays stress upon the doctrine of charity to one’s fellow-man. It says   that some men there are who seek to increase their wealth by means of getting interest   on money, i.e., they seek an increase of their wealth at the expense of other men’s property; but that a Muslim should seek an increase of his wealth by giving it, for the sake of   Allåh, to help his brother-man\n\n   41a. History bears evidence to the truth of these words. Before the advent of the   Holy Prophet corruption prevailed in all countries of the world. The sea may here signify the islands. Darkness prevailed in all countries of the world, affecting the beliefs of   men as well as their deeds. Judaism, Hinduism, Buddhism, Confucianism, and   Zoroastrianism had long ceased to have any healthy effect on the lives of their votaries,   and the followers of these religions had not only ceased to practise virtue, but, worst of   all, they had begun to look upon vice as virtue, and many of them attributed indecent   and immoral practices to their sages and their gods. Christianity, which was then the   youngest of the religions of the world, had also lost its purity. “The Christianity of the   seventh century was itself decrepit and corrupt,” is Muir’s verdict. Such widespread corruption had never previously existed in the world’s history. A recent writer, J.H.   Denison, writes in Emotion as the Basis of Civilization: “In the fifth and sixth centuries,   the civilized world stood on the verge of chaos. The old emotional cultures that had   made civilization possible, since they had given to men a sense of unity and of reverence   for their rulers, had broken down, and nothing had been found adequate to take their   place.... It seemed then that the great civilization which it had taken four thousand years   to construct was on the verge of disintegration, and that mankind was likely to return to   that condition of barbarism where every tribe and sect was against the next and law and   order were unknown.... Civilization like a gigantic tree whose foliage had over-reached   the world ... stood tottering ... rotting to the core” (pp. 265 –268). And then adds, speaking of Arabia: “It was among these people that the man was born who was to unite the   whole known world of the east and south” (p. 269).   With the light of Islåm, and through the torch of knowledge and civilization lit in   Arabia, a new era dawned not only over Arabia, but also over other countries. Europe   remained the longest in darkness, and it was only after the torch of knowledge had been   lighted in Spain by the Muslims that both the Renaissance and the Reformation came.\n\n   42a. The doctrine of Unity had been forgotten by all nations; even the Jews submitted to the decisions of their learned men with a submission which was only due to God.   That Christianity had long before forsaken the doctrine of Unity goes without saying.\n\n    46a. The verse calls attention to the change that was already coming over the peninsula; this was a clear indication of the mighty transformation that was ultimately to be   brought about. \n\n   51a. It, in this verse, refers to the seed-produce, which is meant by the expression   “gives life to the earth” in the previous verse; the meaning is, the seed-produce may be   rendered yellow or caused to wither away by a blast of the wind. The allusion is to the   disasters which would strike a blow at the disbelievers’ plans. It also refers to their   persistence in disbelief, in spite of the afflictions which they experience.\n\n   54a. There is a deeper reference here to the law of the rise, growth and decay of nations.\n\n   59a. Allåh’s sealing the hearts thus really means their own persistence in disbelief   and wickedness, as the preceding verse shows.\n\n      "
    }
  ]
}
