{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "الم",
      "verseStringB": "I, Allāh, am the Best Knower."
    },
    {
      "verseNumber": 2,
      "verseString": "تَنْزِيلُ الْكِتَابِ لَا رَيْبَ فِيهِ مِنْ رَبِّ الْعَالَمِينَ",
      "verseStringB": "The revelation of the Book, there is no doubt in it, is from the Lord of the worlds."
    },
    {
      "verseNumber": 3,
      "verseString": "أَمْ يَقُولُونَ افْتَرَاهُ ۚ بَلْ هُوَ الْحَقُّ مِنْ رَبِّكَ لِتُنْذِرَ قَوْمًا مَا أَتَاهُمْ مِنْ نَذِيرٍ مِنْ قَبْلِكَ لَعَلَّهُمْ يَهْتَدُونَ",
      "verseStringB": "Or do they say: He has forged it? Nay, it is the Truth from thy Lord that thou mayest warn a people to whom no warner has come before thee that they may walk aright.ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "اللَّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۖ مَا لَكُمْ مِنْ دُونِهِ مِنْ وَلِيٍّ وَلَا شَفِيعٍ ۚ أَفَلَا تَتَذَكَّرُونَ",
      "verseStringB": "Allāh is He Who created the heavens and the earth and what is between them in six periods, and He is established on the Throne of Power. You have not besides Him a guardian or an intercessor. Will you not then mind?"
    },
    {
      "verseNumber": 5,
      "verseString": "يُدَبِّرُ الْأَمْرَ مِنَ السَّمَاءِ إِلَى الْأَرْضِ ثُمَّ يَعْرُجُ إِلَيْهِ فِي يَوْمٍ كَانَ مِقْدَارُهُ أَلْفَ سَنَةٍ مِمَّا تَعُدُّونَ",
      "verseStringB": "He orders the Affair from the heaven to the earth; then it will ascend to Him in a day the measure of which is a thousand years as you count.ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "ذَٰلِكَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْعَزِيزُ الرَّحِيمُ",
      "verseStringB": "Such is the Knower of the unseen and the seen, the Mighty, the Merciful,"
    },
    {
      "verseNumber": 7,
      "verseString": "الَّذِي أَحْسَنَ كُلَّ شَيْءٍ خَلَقَهُ ۖ وَبَدَأَ خَلْقَ الْإِنْسَانِ مِنْ طِينٍ",
      "verseStringB": "Who made beautiful everything that He created, and He began the creation of man from dust.ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "ثُمَّ جَعَلَ نَسْلَهُ مِنْ سُلَالَةٍ مِنْ مَاءٍ مَهِينٍ",
      "verseStringB": "Then He made his progeny of an extract, of worthless water."
    },
    {
      "verseNumber": 9,
      "verseString": "ثُمَّ سَوَّاهُ وَنَفَخَ فِيهِ مِنْ رُوحِهِ ۖ وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ ۚ قَلِيلًا مَا تَشْكُرُونَ",
      "verseStringB": "Then He made him complete and breathed into him of His spirit,ᵃ and gave you ears and eyes and hearts; little it is that you give thanks!"
    },
    {
      "verseNumber": 10,
      "verseString": "وَقَالُوا أَإِذَا ضَلَلْنَا فِي الْأَرْضِ أَإِنَّا لَفِي خَلْقٍ جَدِيدٍ ۚ بَلْ هُمْ بِلِقَاءِ رَبِّهِمْ كَافِرُونَ",
      "verseStringB": "And they say: When we are lost in the earth, shall we then be in a new creation? Nay, they are disbelievers in the meeting with their Lord."
    },
    {
      "verseNumber": 11,
      "verseString": "قُلْ يَتَوَفَّاكُمْ مَلَكُ الْمَوْتِ الَّذِي وُكِّلَ بِكُمْ ثُمَّ إِلَىٰ رَبِّكُمْ تُرْجَعُونَ",
      "verseStringB": "Say: The angel of death, who is given charge of you, will cause you to die, then to your Lord you will be returned."
    },
    {
      "verseNumber": 12,
      "verseString": "وَلَوْ تَرَىٰ إِذِ الْمُجْرِمُونَ نَاكِسُو رُءُوسِهِمْ عِنْدَ رَبِّهِمْ رَبَّنَا أَبْصَرْنَا وَسَمِعْنَا فَارْجِعْنَا نَعْمَلْ صَالِحًا إِنَّا مُوقِنُونَ",
      "verseStringB": "And couldst thou but see when the guilty hang their heads before their Lord: Our Lord, we have seen and heard, so send us back, we will do good; we are (now) certain."
    },
    {
      "verseNumber": 13,
      "verseString": "وَلَوْ شِئْنَا لَآتَيْنَا كُلَّ نَفْسٍ هُدَاهَا وَلَٰكِنْ حَقَّ الْقَوْلُ مِنِّي لَأَمْلَأَنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَالنَّاسِ أَجْمَعِينَ",
      "verseStringB": "And if We had pleased, We could have given every soul its guidance, but the word from Me was just: I will certainly fill hell with the jinn and men together.ᵃ"
    },
    {
      "verseNumber": 14,
      "verseString": "فَذُوقُوا بِمَا نَسِيتُمْ لِقَاءَ يَوْمِكُمْ هَٰذَا إِنَّا نَسِينَاكُمْ ۖ وَذُوقُوا عَذَابَ الْخُلْدِ بِمَا كُنْتُمْ تَعْمَلُونَ",
      "verseStringB": "So taste, because you forgot the meeting of this Day of yours; surely We forsake you; and taste the abiding chastisement for what you did."
    },
    {
      "verseNumber": 15,
      "verseString": "إِنَّمَا يُؤْمِنُ بِآيَاتِنَا الَّذِينَ إِذَا ذُكِّرُوا بِهَا خَرُّوا سُجَّدًا وَسَبَّحُوا بِحَمْدِ رَبِّهِمْ وَهُمْ لَا يَسْتَكْبِرُونَ ۩",
      "verseStringB": "Only they believe in Our messages who, when they are reminded of them, fall down prostrate and celebrate the praise of their Lord, and they are not proud.ᵃ"
    },
    {
      "verseNumber": 16,
      "verseString": "تَتَجَافَىٰ جُنُوبُهُمْ عَنِ الْمَضَاجِعِ يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ",
      "verseStringB": "They forsake (their) beds, calling upon their Lord in fear and in hope, and spend out of what We have given them.ᵃ"
    },
    {
      "verseNumber": 17,
      "verseString": "فَلَا تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ جَزَاءً بِمَا كَانُوا يَعْمَلُونَ",
      "verseStringB": "So no soul knows what refreshment of the eyes is hidden for them: a reward for what they did.ᵃ"
    },
    {
      "verseNumber": 18,
      "verseString": "أَفَمَنْ كَانَ مُؤْمِنًا كَمَنْ كَانَ فَاسِقًا ۚ لَا يَسْتَوُونَ",
      "verseStringB": "Is he then, who is a believer, like him who is a transgressor? They are not equal."
    },
    {
      "verseNumber": 19,
      "verseString": "أَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَلَهُمْ جَنَّاتُ الْمَأْوَىٰ نُزُلًا بِمَا كَانُوا يَعْمَلُونَ",
      "verseStringB": "As for those who believe and do good deeds, for them are Gardens, a refuge — an entertainment for what they did."
    },
    {
      "verseNumber": 20,
      "verseString": "وَأَمَّا الَّذِينَ فَسَقُوا فَمَأْوَاهُمُ النَّارُ ۖ كُلَّمَا أَرَادُوا أَنْ يَخْرُجُوا مِنْهَا أُعِيدُوا فِيهَا وَقِيلَ لَهُمْ ذُوقُوا عَذَابَ النَّارِ الَّذِي كُنْتُمْ بِهِ تُكَذِّبُونَ",
      "verseStringB": "And as for those who transgress, their refuge is the Fire. Whenever they desire to go forth from it, they are brought back into it, and it is said to them: Taste the chastisement of the Fire, which you called a lie."
    },
    {
      "verseNumber": 21,
      "verseString": "وَلَنُذِيقَنَّهُمْ مِنَ الْعَذَابِ الْأَدْنَىٰ دُونَ الْعَذَابِ الْأَكْبَرِ لَعَلَّهُمْ يَرْجِعُونَ",
      "verseStringB": "And certainly We will make them taste the nearer punishment before the greater chastisement, that haply they may turn.ᵃ"
    },
    {
      "verseNumber": 22,
      "verseString": "وَمَنْ أَظْلَمُ مِمَّنْ ذُكِّرَ بِآيَاتِ رَبِّهِ ثُمَّ أَعْرَضَ عَنْهَا ۚ إِنَّا مِنَ الْمُجْرِمِينَ مُنْتَقِمُونَ",
      "verseStringB": "And who is more iniquitous than he who is reminded of the messages of his Lord, then he turns away from them? Surely We exact retribution from the guilty."
    },
    {
      "verseNumber": 23,
      "verseString": "وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ فَلَا تَكُنْ فِي مِرْيَةٍ مِنْ لِقَائِهِ ۖ وَجَعَلْنَاهُ هُدًى لِبَنِي إِسْرَائِيلَ",
      "verseStringB": "And We indeed gave Moses the Book — so doubt not the meeting with Him — and We made it a guide for the Children of Israel.ᵃ"
    },
    {
      "verseNumber": 24,
      "verseString": "وَجَعَلْنَا مِنْهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا لَمَّا صَبَرُوا ۖ وَكَانُوا بِآيَاتِنَا يُوقِنُونَ",
      "verseStringB": "And We made from among them leaders to guide by Our command when they were patient. And they were certain of Our messages."
    },
    {
      "verseNumber": 25,
      "verseString": "إِنَّ رَبَّكَ هُوَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيَامَةِ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ",
      "verseStringB": "Surely thy Lord will judge between them on the day of Resurrection concerning that wherein they differed."
    },
    {
      "verseNumber": 26,
      "verseString": "أَوَلَمْ يَهْدِ لَهُمْ كَمْ أَهْلَكْنَا مِنْ قَبْلِهِمْ مِنَ الْقُرُونِ يَمْشُونَ فِي مَسَاكِنِهِمْ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ ۖ أَفَلَا يَسْمَعُونَ",
      "verseStringB": "Is it not clear to them, how many of the generations, in whose abodes they go about, We destroyed before them? Surely there are signs in this. Will they not then hear?"
    },
    {
      "verseNumber": 27,
      "verseString": "أَوَلَمْ يَرَوْا أَنَّا نَسُوقُ الْمَاءَ إِلَى الْأَرْضِ الْجُرُزِ فَنُخْرِجُ بِهِ زَرْعًا تَأْكُلُ مِنْهُ أَنْعَامُهُمْ وَأَنْفُسُهُمْ ۖ أَفَلَا يُبْصِرُونَ",
      "verseStringB": "See they not that We drive the water to a land having no herbage, then We bring forth thereby seedproduce, of which their cattle and they themselves eat. Will they not then see?"
    },
    {
      "verseNumber": 28,
      "verseString": "وَيَقُولُونَ مَتَىٰ هَٰذَا الْفَتْحُ إِنْ كُنْتُمْ صَادِقِينَ",
      "verseStringB": "And they say: When will this victory come, if you are truthful?ᵃ"
    },
    {
      "verseNumber": 29,
      "verseString": "قُلْ يَوْمَ الْفَتْحِ لَا يَنْفَعُ الَّذِينَ كَفَرُوا إِيمَانُهُمْ وَلَا هُمْ يُنْظَرُونَ",
      "verseStringB": "Say: On the day of victory the faith of those who (now) disbelieve will not profit them, nor will they be respited."
    },
    {
      "verseNumber": 30,
      "verseString": "فَأَعْرِضْ عَنْهُمْ وَانْتَظِرْ إِنَّهُمْ مُنْتَظِرُونَ",
      "verseStringB": "So turn away from them and wait, surely they too are waitin"
    }
  ],
  "nameEnglish": "Prostration",
  "nameTrans": "as-Sajdah",
  "nameArabic": "السجدة",
  "chapterNumber": 32,
  "nVerses": 30,
  "footnotes": [
    {
      "note": "3a. Makkah had not seen a prophet before the advent of the Holy Prophet Mu√ammad, who was the only Prophet raised among the descendants of Ishmael. \n\n 5a. Al-Amr or the Affair is the Affair of Islåm, and its ordering or regulation from heaven to earth means that it comes from heaven and will be established firmly on earth. Then we are told that it will ascend to God in a day, the measure of which is a thousand years according to human reckoning, which means that it will receive a set-back for a thousand years. As regards the period of its firmness, we are told in a √adßth that it will retain its purity for three centuries: “The best of the generations is my generation, then those who follow them, then those who follow them, then after them will come people who will pride themselves in abundance of wealth and love plumpness” (Tr. 31:39). According to another √adßth: “There will come a people in which there is no good” (KU. VI, 2068). The words of another are: “A crooked way — they are not of me nor am I of them” (KU. VI, 2073). That there is a prophecy here is shown by the next verse, which says, Such is the Knower of the unseen and the seen. Thus we have here a prophecy relating to the future of Islåm. This prophecy was made known at a time when there was not the least indication that Islåm would be established in the earth; it was the middle of the Makkan period, when the cause of Islåm was utterly hopeless. At that time the Prophet was told that Islåm would be firmly established at first. That the cause would go on advancing for three centuries is made clear by the Prophet’s saying. After that the cause of Islåm would be chequered and it would have its set-backs, which would continue for a thousand years. The limitation of the period of chequering shows clearly that, after that, the advancement of Islåm will again be as unhampered as it was in its early stages in the time of the Prophet and after him.\n\n 7a. See 23:12– 14, where the various stages through which man passes in his creation are spoken of in detail, and 23:12a. The wonderful beauty of creation from the atom to the most brilliant star in the realm of matter, and from the smallest ant to the most developed form of life in man, could not have been known to an unlearned Arabian 1,300 years ago, yet he sees, as stated here, that everything that was created was beautiful. This beauty in creation undoubtedly emanated from the same Source, from the Great Creator Who, according to the Holy Qur’ån, has the “most beautiful names” (17:110; 20:8; 59:24).\n\n 9a. This verse shows that the spirit of God is breathed into every man. This points to a mystical relation between human nature and Divine nature. The word r∂√ does not here mean the animal soul, because the animal soul is common to man and the animal kingdom. It is something which distinguishes man from the animal world. It is due to this spirit Divine that he rules the creation and it is due to the same Divine spirit in him that he receives a new life after death — a life in which he lives in God and with God — the meeting with God or liqå Allåh, as it is called in v. 10. \n\n 13a. God’s word, as repeated so often in the Holy Qur’ån, is that the right way has been pointed out to man but he is given the choice to accept or reject it, and that those who rejected that word and did not forsake evil ways would go to hell. The reference in if We had pleased is to the fact that man is not compelled to submit to the Divine law. His superiority lies in the fact that he has been given a choice. If he exercises that choice rightly, he attains to eminence; if he exercises it wrongly, he must taste of the evil consequences of his deeds. \n\n 15a. The recitation of this verse is followed by an actual prostration; see 7:206a. \n\n 16a. The literal significance of the original words for they forsake is their sides draw away from, showing that they are restless in their beds. These are the foundations of the culture of Islåm, passing part of the night in remembering Allåh, and passing the day in earning wealth to spend in the way of Allåh for the benefit of humanity. \n\n 17a. This is a true description of what the blessings of paradise are: No soul knows what refreshment of the eyes is hidden for them. These blessings are hidden from the physical eye of man, and therefore their description in words which convey to the mind an idea of the blessings of this life is metaphorical. Words cannot reveal to us the real nature of those blessings. The Holy Prophet’s own comment on these words shows the truth of this statement, for he is reported to have said: “Allåh says, I have prepared for My righteous servants that which no eye has seen and no ear has heard, and which the heart of man cannot conceive” (B. 59:8). \n\n 21a. By the nearer chastisement is meant the earthly punishment, which might serve as a warning against the greater punishment of the Hereafter. The opponents of Truth are thus told that they must taste a punishment in this life, too, and the description of it given in the previous verse — whenever they desire to go forth from it, they are brought back into it — manifestly applies to modern world conditions, when materialism has taken hold of the minds of men. The wars at present raging in the world are the fire of this life, and, however much the warring nations may desire to get out of them, they are brought back into them. \n\n 23a. To bring about the meeting with God — to make men live in God — is the real aim of religion, and here it is pointed out that to make men attain this object a Book was given to Moses for the Israelites, as a Book is now given for the whole world. This object will be attained notwithstanding opposition, which will be brought to naught, as made clear in v. 26. \n\n 28a. The question makes it clear that the above verses speak of the triumph of Islåm over all opposition, then and now, in metaphorical language; hence they ask, when will the victory come? The driving of the water to a dead land, a land having no herbage, is a clear hint that the dead earth will receive life."
    }
  ]
}
