{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "تَنْزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ",
      "verseStringB": "The revelation of the Book is from Allāh, the Mighty, the Wise."
    },
    {
      "verseNumber": 2,
      "verseString": "إِنَّا أَنْزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ فَاعْبُدِ اللَّهَ مُخْلِصًا لَهُ الدِّينَ",
      "verseStringB": "Surely We have revealed to thee the Book with truth, so serve Allāh, being sincere to Him in obedience."
    },
    {
      "verseNumber": 3,
      "verseString": "أَلَا لِلَّهِ الدِّينُ الْخَالِصُ ۚ وَالَّذِينَ اتَّخَذُوا مِنْ دُونِهِ أَوْلِيَاءَ مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَىٰ إِنَّ اللَّهَ يَحْكُمُ بَيْنَهُمْ فِي مَا هُمْ فِيهِ يَخْتَلِفُونَ ۗ إِنَّ اللَّهَ لَا يَهْدِي مَنْ هُوَ كَاذِبٌ كَفَّارٌ",
      "verseStringB": "Now surely sincere obedience is due to Allāh (alone). And those who choose protectors besides Him (say): We serve them only that they may bring us nearer to Allāh.ᵃ Surely Allāh will judge between them in that in which they differ. Surely Allāh guides not him who is a liar, ungrateful."
    },
    {
      "verseNumber": 4,
      "verseString": "لَوْ أَرَادَ اللَّهُ أَنْ يَتَّخِذَ وَلَدًا لَاصْطَفَىٰ مِمَّا يَخْلُقُ مَا يَشَاءُ ۚ سُبْحَانَهُ ۖ هُوَ اللَّهُ الْوَاحِدُ الْقَهَّارُ",
      "verseStringB": "If Allāh desired to take a son to Himself, He could have chosen those He pleased out of those whom He has createda — Glory be to Him! He is Allāh, the One, the Subduer (of all)."
    },
    {
      "verseNumber": 5,
      "verseString": "خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۖ يُكَوِّرُ اللَّيْلَ عَلَى النَّهَارِ وَيُكَوِّرُ النَّهَارَ عَلَى اللَّيْلِ ۖ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ ۖ كُلٌّ يَجْرِي لِأَجَلٍ مُسَمًّى ۗ أَلَا هُوَ الْعَزِيزُ الْغَفَّارُ",
      "verseStringB": "He has created the heavens and the earth with truth; He makes the night cover the day and makes the day overtake the night, and He has made the sun and the moon subservient; each one moves on to an assigned term. Now surely He is the Mighty, the Forgiver."
    },
    {
      "verseNumber": 6,
      "verseString": "خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ ثُمَّ جَعَلَ مِنْهَا زَوْجَهَا وَأَنْزَلَ لَكُمْ مِنَ الْأَنْعَامِ ثَمَانِيَةَ أَزْوَاجٍ ۚ يَخْلُقُكُمْ فِي بُطُونِ أُمَّهَاتِكُمْ خَلْقًا مِنْ بَعْدِ خَلْقٍ فِي ظُلُمَاتٍ ثَلَاثٍ ۚ ذَٰلِكُمُ اللَّهُ رَبُّكُمْ لَهُ الْمُلْكُ ۖ لَا إِلَٰهَ إِلَّا هُوَ ۖ فَأَنَّىٰ تُصْرَفُونَ",
      "verseStringB": "He created you from a single being, then made its mate of the same (kind). And He sent down for you eight of the cattle in pairs.ᵃ He creates you in the wombs of your mothers — creation after creation — in triple darkness. That is Allāh, your Lord; His is the kingdom. There is no God but He. How are you then turned away?"
    },
    {
      "verseNumber": 7,
      "verseString": "إِنْ تَكْفُرُوا فَإِنَّ اللَّهَ غَنِيٌّ عَنْكُمْ ۖ وَلَا يَرْضَىٰ لِعِبَادِهِ الْكُفْرَ ۖ وَإِنْ تَشْكُرُوا يَرْضَهُ لَكُمْ ۗ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۗ ثُمَّ إِلَىٰ رَبِّكُمْ مَرْجِعُكُمْ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ ۚ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ",
      "verseStringB": "If you are ungrateful, then surely Allāh is above need of you. And He likes not ungratefulness in His servants. And if you are grateful, He likes it for you. And no bearer of a burden will bear another’s burden. Then to your Lord is your return, then will He inform you of what you did. Surely He is Knower of what is in the breasts."
    },
    {
      "verseNumber": 8,
      "verseString": "وَإِذَا مَسَّ الْإِنْسَانَ ضُرٌّ دَعَا رَبَّهُ مُنِيبًا إِلَيْهِ ثُمَّ إِذَا خَوَّلَهُ نِعْمَةً مِنْهُ نَسِيَ مَا كَانَ يَدْعُو إِلَيْهِ مِنْ قَبْلُ وَجَعَلَ لِلَّهِ أَنْدَادًا لِيُضِلَّ عَنْ سَبِيلِهِ ۚ قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِيلًا ۖ إِنَّكَ مِنْ أَصْحَابِ النَّارِ",
      "verseStringB": "And when distress afflicts a man he calls upon his Lord, turning to Him; then when He grants him a favour from Him, he forgets that for which he called upon Him before, and sets up rivals to Allāh that he may cause (men) to stray from His path. Say: Enjoy thine ungratefulness for a little, surely thou art of the companions of the Fire."
    },
    {
      "verseNumber": 9,
      "verseString": "أَمَّنْ هُوَ قَانِتٌ آنَاءَ اللَّيْلِ سَاجِدًا وَقَائِمًا يَحْذَرُ الْآخِرَةَ وَيَرْجُو رَحْمَةَ رَبِّهِ ۗ قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ ۗ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ",
      "verseStringB": "Is he who is obedient during hours of the night, prostrating himself and standing, taking care of the Hereafter and hoping for the mercy of his Lord—? Say: Are those who know and those who know not alike? Only men of understanding mind."
    },
    {
      "verseNumber": 10,
      "verseString": "قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ ۚ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۗ وَأَرْضُ اللَّهِ وَاسِعَةٌ ۗ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ",
      "verseStringB": "Say: O My servants who believe, keep your duty to your Lord. For those who do good in this world is good, and Allāh’s earth is spacious.ᵃ Truly the steadfast will be paid their reward without measure."
    },
    {
      "verseNumber": 11,
      "verseString": "قُلْ إِنِّي أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ مُخْلِصًا لَهُ الدِّينَ",
      "verseStringB": "Say: I am commanded to serve Allāh, being sincere to Him in obedience,"
    },
    {
      "verseNumber": 12,
      "verseString": "وَأُمِرْتُ لِأَنْ أَكُونَ أَوَّلَ الْمُسْلِمِينَ",
      "verseStringB": "And I am commanded to be the first of those who submit."
    },
    {
      "verseNumber": 13,
      "verseString": "قُلْ إِنِّي أَخَافُ إِنْ عَصَيْتُ رَبِّي عَذَابَ يَوْمٍ عَظِيمٍ",
      "verseStringB": "Say: I fear, if I disobey my Lord, the chastisement of a grievous day."
    },
    {
      "verseNumber": 14,
      "verseString": "قُلِ اللَّهَ أَعْبُدُ مُخْلِصًا لَهُ دِينِي",
      "verseStringB": "Say: Allāh I serve, being sincere to Him in my obedience."
    },
    {
      "verseNumber": 15,
      "verseString": "فَاعْبُدُوا مَا شِئْتُمْ مِنْ دُونِهِ ۗ قُلْ إِنَّ الْخَاسِرِينَ الَّذِينَ خَسِرُوا أَنْفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ الْقِيَامَةِ ۗ أَلَا ذَٰلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ",
      "verseStringB": "Serve then what you will besides Him. Say: The losers surely are those who lose themselves and their people on the day of Resurrection. Now surely that is the manifest loss!"
    },
    {
      "verseNumber": 16,
      "verseString": "لَهُمْ مِنْ فَوْقِهِمْ ظُلَلٌ مِنَ النَّارِ وَمِنْ تَحْتِهِمْ ظُلَلٌ ۚ ذَٰلِكَ يُخَوِّفُ اللَّهُ بِهِ عِبَادَهُ ۚ يَا عِبَادِ فَاتَّقُونِ",
      "verseStringB": "They shall have coverings of fire above them and coverings beneath them. With that Allāh makes His servants to fear; so keep your duty to Me, O My servants."
    },
    {
      "verseNumber": 17,
      "verseString": "وَالَّذِينَ اجْتَنَبُوا الطَّاغُوتَ أَنْ يَعْبُدُوهَا وَأَنَابُوا إِلَى اللَّهِ لَهُمُ الْبُشْرَىٰ ۚ فَبَشِّرْ عِبَادِ",
      "verseStringB": "And those who eschew the worship of the idols and turn to Allāh, for them is good news. So give good news to My servants,"
    },
    {
      "verseNumber": 18,
      "verseString": "الَّذِينَ يَسْتَمِعُونَ الْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ ۚ أُولَٰئِكَ الَّذِينَ هَدَاهُمُ اللَّهُ ۖ وَأُولَٰئِكَ هُمْ أُولُو الْأَلْبَابِ",
      "verseStringB": "Who listen to the Word, then follow the best of it. Such are they whom Allāh has guided, and such are the men of understanding."
    },
    {
      "verseNumber": 19,
      "verseString": "أَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذَابِ أَفَأَنْتَ تُنْقِذُ مَنْ فِي النَّارِ",
      "verseStringB": "He against whom the sentence of chastisement is due — canst thou save him who is in the Fire?"
    },
    {
      "verseNumber": 20,
      "verseString": "لَٰكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ غُرَفٌ مِنْ فَوْقِهَا غُرَفٌ مَبْنِيَّةٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۖ وَعْدَ اللَّهِ ۖ لَا يُخْلِفُ اللَّهُ الْمِيعَادَ",
      "verseStringB": "But those who keep their duty to their Lord, for them are high places, above them higher places,ᵃ built (for them), wherein rivers flow. (It is) the promise of Allāh. Allāh fails not in (His) promise."
    },
    {
      "verseNumber": 21,
      "verseString": "أَلَمْ تَرَ أَنَّ اللَّهَ أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَسَلَكَهُ يَنَابِيعَ فِي الْأَرْضِ ثُمَّ يُخْرِجُ بِهِ زَرْعًا مُخْتَلِفًا أَلْوَانُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرًّا ثُمَّ يَجْعَلُهُ حُطَامًا ۚ إِنَّ فِي ذَٰلِكَ لَذِكْرَىٰ لِأُولِي الْأَلْبَابِ",
      "verseStringB": "Seest thou not that Allāh sends down water from the clouds, then makes it go down into the earth in springs, then brings forth therewith herbage of various hues; then it withers so that thou seest it turn yellow, then He makes it chaff? a Surely there is a reminder in this for men of understanding."
    },
    {
      "verseNumber": 22,
      "verseString": "أَفَمَنْ شَرَحَ اللَّهُ صَدْرَهُ لِلْإِسْلَامِ فَهُوَ عَلَىٰ نُورٍ مِنْ رَبِّهِ ۚ فَوَيْلٌ لِلْقَاسِيَةِ قُلُوبُهُمْ مِنْ ذِكْرِ اللَّهِ ۚ أُولَٰئِكَ فِي ضَلَالٍ مُبِينٍ",
      "verseStringB": "Is he whose breast Allāh has opened to Islām so that he follows a light from his Lord—? So woe to those whose hearts are hardened against the remembrance of Allāh! Such are in clear error."
    },
    {
      "verseNumber": 23,
      "verseString": "اللَّهُ نَزَّلَ أَحْسَنَ الْحَدِيثِ كِتَابًا مُتَشَابِهًا مَثَانِيَ تَقْشَعِرُّ مِنْهُ جُلُودُ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ ثُمَّ تَلِينُ جُلُودُهُمْ وَقُلُوبُهُمْ إِلَىٰ ذِكْرِ اللَّهِ ۚ ذَٰلِكَ هُدَى اللَّهِ يَهْدِي بِهِ مَنْ يَشَاءُ ۚ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ",
      "verseStringB": "Allāh has revealed the best announcement, a Book consistent, repeating (its injunctions),ᵃ whereat do shudder the skins of those who fear their Lord, then their skins and their hearts soften to Allāh’s remembrance. This is Allāh’s guidance — He guides with it whom He pleases. And he whom Allāh leaves in error, there is no guide for him."
    },
    {
      "verseNumber": 24,
      "verseString": "أَفَمَنْ يَتَّقِي بِوَجْهِهِ سُوءَ الْعَذَابِ يَوْمَ الْقِيَامَةِ ۚ وَقِيلَ لِلظَّالِمِينَ ذُوقُوا مَا كُنْتُمْ تَكْسِبُونَ",
      "verseStringB": "Is then he who has to guard himself with his own person against the evil chastisement of the Resurrection day—? And it will be said to the iniquitous: Taste what you earned."
    },
    {
      "verseNumber": 25,
      "verseString": "كَذَّبَ الَّذِينَ مِنْ قَبْلِهِمْ فَأَتَاهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ",
      "verseStringB": "Those before them denied, so the chastisement came to them from whence they perceived not."
    },
    {
      "verseNumber": 26,
      "verseString": "فَأَذَاقَهُمُ اللَّهُ الْخِزْيَ فِي الْحَيَاةِ الدُّنْيَا ۖ وَلَعَذَابُ الْآخِرَةِ أَكْبَرُ ۚ لَوْ كَانُوا يَعْلَمُونَ",
      "verseStringB": "So Allāh made them taste disgrace in this world’s life, and certainly the chastisement of the Hereafter is greater. Did they but know!"
    },
    {
      "verseNumber": 27,
      "verseString": "وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِي هَٰذَا الْقُرْآنِ مِنْ كُلِّ مَثَلٍ لَعَلَّهُمْ يَتَذَكَّرُونَ",
      "verseStringB": "And certainly We have set forth for men in this Qur’ān similitudes of every sort that they may mind.ᵃ"
    },
    {
      "verseNumber": 28,
      "verseString": "قُرْآنًا عَرَبِيًّا غَيْرَ ذِي عِوَجٍ لَعَلَّهُمْ يَتَّقُونَ",
      "verseStringB": "An Arabic Qur’ān without any crookedness, that they may guard against evil."
    },
    {
      "verseNumber": 29,
      "verseString": "ضَرَبَ اللَّهُ مَثَلًا رَجُلًا فِيهِ شُرَكَاءُ مُتَشَاكِسُونَ وَرَجُلًا سَلَمًا لِرَجُلٍ هَلْ يَسْتَوِيَانِ مَثَلًا ۚ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ",
      "verseStringB": "Allāh sets forth a parable: A man belonging to partners differing with one another, and a man (devoted) wholly to one man. Are the two alike in condition? Praise be to Allāh! Nay, most of them know not."
    },
    {
      "verseNumber": 30,
      "verseString": "إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَيِّتُونَ",
      "verseStringB": "Surely thou wilt die and they (too) will die;"
    },
    {
      "verseNumber": 31,
      "verseString": "ثُمَّ إِنَّكُمْ يَوْمَ الْقِيَامَةِ عِنْدَ رَبِّكُمْ تَخْتَصِمُونَ",
      "verseStringB": "Then surely on the day of Resurrection you will contend one with another before your Lord."
    },
    {
      "verseNumber": 32,
      "verseString": "فَمَنْ أَظْلَمُ مِمَّنْ كَذَبَ عَلَى اللَّهِ وَكَذَّبَ بِالصِّدْقِ إِذْ جَاءَهُ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِلْكَافِرِينَ",
      "verseStringB": "Who is then more unjust than he who utters a lie against Allāh and denies the truth, when it comes to him? Is there not in hell an abode for the disbelievers?"
    },
    {
      "verseNumber": 33,
      "verseString": "وَالَّذِي جَاءَ بِالصِّدْقِ وَصَدَّقَ بِهِ ۙ أُولَٰئِكَ هُمُ الْمُتَّقُونَ",
      "verseStringB": "And he who brings the truth and accepts the truth — such are the dutiful."
    },
    {
      "verseNumber": 34,
      "verseString": "لَهُمْ مَا يَشَاءُونَ عِنْدَ رَبِّهِمْ ۚ ذَٰلِكَ جَزَاءُ الْمُحْسِنِينَ",
      "verseStringB": "They shall have with their Lord what they please. Such is the reward of the doers of good —"
    },
    {
      "verseNumber": 35,
      "verseString": "لِيُكَفِّرَ اللَّهُ عَنْهُمْ أَسْوَأَ الَّذِي عَمِلُوا وَيَجْزِيَهُمْ أَجْرَهُمْ بِأَحْسَنِ الَّذِي كَانُوا يَعْمَلُونَ",
      "verseStringB": "That Allāh may ward off from them the worst of what they did, and give them their reward for the best of what they did.ᵃ"
    },
    {
      "verseNumber": 36,
      "verseString": "أَلَيْسَ اللَّهُ بِكَافٍ عَبْدَهُ ۖ وَيُخَوِّفُونَكَ بِالَّذِينَ مِنْ دُونِهِ ۚ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ",
      "verseStringB": "Is not Allāh sufficient for His servant? And they seek to frighten thee with those besides Him.ᵃ And whomsoever Allāh leaves in error, there is no guide for him."
    },
    {
      "verseNumber": 37,
      "verseString": "وَمَنْ يَهْدِ اللَّهُ فَمَا لَهُ مِنْ مُضِلٍّ ۗ أَلَيْسَ اللَّهُ بِعَزِيزٍ ذِي انْتِقَامٍ",
      "verseStringB": "And whom Allāh guides, there is none that can lead him astray. Is not Allāh Mighty, the Lord of retribution?"
    },
    {
      "verseNumber": 38,
      "verseString": "وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ ۚ قُلْ أَفَرَأَيْتُمْ مَا تَدْعُونَ مِنْ دُونِ اللَّهِ إِنْ أَرَادَنِيَ اللَّهُ بِضُرٍّ هَلْ هُنَّ كَاشِفَاتُ ضُرِّهِ أَوْ أَرَادَنِي بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكَاتُ رَحْمَتِهِ ۚ قُلْ حَسْبِيَ اللَّهُ ۖ عَلَيْهِ يَتَوَكَّلُ الْمُتَوَكِّلُونَ",
      "verseStringB": "And if thou ask them, Who created the heavens and the earth? They will say: Allāh. Say: See you then that those you call upon besides Allāh, would they, if Allāh desire to afflict me with harm, remove His harm? Or if He desire to show me mercy, could they withhold His mercy? Say: Allāh is sufficient for me. On Him do the reliant rely."
    },
    {
      "verseNumber": 39,
      "verseString": "قُلْ يَا قَوْمِ اعْمَلُوا عَلَىٰ مَكَانَتِكُمْ إِنِّي عَامِلٌ ۖ فَسَوْفَ تَعْلَمُونَ",
      "verseStringB": "Say: O my people, work in your place. Surely I am a worker, so you will come to know,"
    },
    {
      "verseNumber": 40,
      "verseString": "مَنْ يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُقِيمٌ",
      "verseStringB": "Who it is to whom there comes a chastisement abasing him, and on whom falls a lasting chastisement.ᵃ"
    },
    {
      "verseNumber": 41,
      "verseString": "إِنَّا أَنْزَلْنَا عَلَيْكَ الْكِتَابَ لِلنَّاسِ بِالْحَقِّ ۖ فَمَنِ اهْتَدَىٰ فَلِنَفْسِهِ ۖ وَمَنْ ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا ۖ وَمَا أَنْتَ عَلَيْهِمْ بِوَكِيلٍ",
      "verseStringB": "Surely We have revealed to thee the Book with truth for (the good of) men. So whoever follows the right way, it is for his own soul, and whoever errs, he errs only to its detriment. And thou art not a custodian over them."
    },
    {
      "verseNumber": 42,
      "verseString": "اللَّهُ يَتَوَفَّى الْأَنْفُسَ حِينَ مَوْتِهَا وَالَّتِي لَمْ تَمُتْ فِي مَنَامِهَا ۖ فَيُمْسِكُ الَّتِي قَضَىٰ عَلَيْهَا الْمَوْتَ وَيُرْسِلُ الْأُخْرَىٰ إِلَىٰ أَجَلٍ مُسَمًّى ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ",
      "verseStringB": "Allāh takes (men’s) souls at the time of their death, and those that die not, during their sleep. Then He withholds those on whom He has passed the decree of death a and sends the others back till an appointed term. Surely there are signs in this for a people who reflect."
    },
    {
      "verseNumber": 43,
      "verseString": "أَمِ اتَّخَذُوا مِنْ دُونِ اللَّهِ شُفَعَاءَ ۚ قُلْ أَوَلَوْ كَانُوا لَا يَمْلِكُونَ شَيْئًا وَلَا يَعْقِلُونَ",
      "verseStringB": "Or, take they intercessors besides Allāh? Say: What! Even though they control naught, nor do they understand."
    },
    {
      "verseNumber": 44,
      "verseString": "قُلْ لِلَّهِ الشَّفَاعَةُ جَمِيعًا ۖ لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۖ ثُمَّ إِلَيْهِ تُرْجَعُونَ",
      "verseStringB": "Say: Allāh’s is the intercession altogether. His is the kingdom of the heavens and the earth. Then to Him you will be returned."
    },
    {
      "verseNumber": 45,
      "verseString": "وَإِذَا ذُكِرَ اللَّهُ وَحْدَهُ اشْمَأَزَّتْ قُلُوبُ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ ۖ وَإِذَا ذُكِرَ الَّذِينَ مِنْ دُونِهِ إِذَا هُمْ يَسْتَبْشِرُونَ",
      "verseStringB": "And when Allāh alone is mentioned, the hearts of those who believe not in the Hereafter shrink, and when those besides Him are mentioned, lo! they are joyful.ᵃ"
    },
    {
      "verseNumber": 46,
      "verseString": "قُلِ اللَّهُمَّ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِي مَا كَانُوا فِيهِ يَخْتَلِفُونَ",
      "verseStringB": "Say: O Allāh, OrigInᵃ tor of the heavens and the earth, Knower of the unseen and the seen, Thou judgest between Thy servants as to that wherein they differ."
    },
    {
      "verseNumber": 47,
      "verseString": "وَلَوْ أَنَّ لِلَّذِينَ ظَلَمُوا مَا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لَافْتَدَوْا بِهِ مِنْ سُوءِ الْعَذَابِ يَوْمَ الْقِيَامَةِ ۚ وَبَدَا لَهُمْ مِنَ اللَّهِ مَا لَمْ يَكُونُوا يَحْتَسِبُونَ",
      "verseStringB": "And had those who do wrong all that is in the earth and the like of it with it, they would certainly offer it as ransom from the evil of the chastisement on the day of Resurrection. And what they never thought of shall become plain to them from Allāh.ᵃ"
    },
    {
      "verseNumber": 48,
      "verseString": "وَبَدَا لَهُمْ سَيِّئَاتُ مَا كَسَبُوا وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ",
      "verseStringB": "And the evil of what they wrought will become plain to them,ᵃ and that which they mocked at will beset them."
    },
    {
      "verseNumber": 49,
      "verseString": "فَإِذَا مَسَّ الْإِنْسَانَ ضُرٌّ دَعَانَا ثُمَّ إِذَا خَوَّلْنَاهُ نِعْمَةً مِنَّا قَالَ إِنَّمَا أُوتِيتُهُ عَلَىٰ عِلْمٍ ۚ بَلْ هِيَ فِتْنَةٌ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
      "verseStringB": "So when harm afflicts a man he calls upon Us; then, when We give him a boon from Us, he says: I have been given it only by means of knowledge. Nay, it is a trial, but most of them know not."
    },
    {
      "verseNumber": 50,
      "verseString": "قَدْ قَالَهَا الَّذِينَ مِنْ قَبْلِهِمْ فَمَا أَغْنَىٰ عَنْهُمْ مَا كَانُوا يَكْسِبُونَ",
      "verseStringB": "Those before them did say it indeed, but what they earned availed them not."
    },
    {
      "verseNumber": 51,
      "verseString": "فَأَصَابَهُمْ سَيِّئَاتُ مَا كَسَبُوا ۚ وَالَّذِينَ ظَلَمُوا مِنْ هَٰؤُلَاءِ سَيُصِيبُهُمْ سَيِّئَاتُ مَا كَسَبُوا وَمَا هُمْ بِمُعْجِزِينَ",
      "verseStringB": "So there befell them the evil which they had earned. And those who are unjust from among these, there shall befall them the evil which they earn, and they shall not escape.ᵃ"
    },
    {
      "verseNumber": 52,
      "verseString": "أَوَلَمْ يَعْلَمُوا أَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِرُ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يُؤْمِنُونَ",
      "verseStringB": "Know they not that Allāh gives ample subsistence to whom He pleases, and He straitens; surely there are signs in this for a people who believe."
    },
    {
      "verseNumber": 53,
      "verseString": "قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ",
      "verseStringB": "Say: O My servants who have been prodigal regarding their souls, despair not of the mercy of Allāh; surely Allāh forgives sins altogether. He is indeed the Forgiving, the Merciful.ᵃ"
    },
    {
      "verseNumber": 54,
      "verseString": "وَأَنِيبُوا إِلَىٰ رَبِّكُمْ وَأَسْلِمُوا لَهُ مِنْ قَبْلِ أَنْ يَأْتِيَكُمُ الْعَذَابُ ثُمَّ لَا تُنْصَرُونَ",
      "verseStringB": "And turn to your Lord and submit to Him before chastisement comes to you, then you will not be helped."
    },
    {
      "verseNumber": 55,
      "verseString": "وَاتَّبِعُوا أَحْسَنَ مَا أُنْزِلَ إِلَيْكُمْ مِنْ رَبِّكُمْ مِنْ قَبْلِ أَنْ يَأْتِيَكُمُ الْعَذَابُ بَغْتَةً وَأَنْتُمْ لَا تَشْعُرُونَ",
      "verseStringB": "And follow the best a that has been revealed to you from your Lord before chastisement comes to you all of a sudden, while you perceive not—"
    },
    {
      "verseNumber": 56,
      "verseString": "أَنْ تَقُولَ نَفْسٌ يَا حَسْرَتَا عَلَىٰ مَا فَرَّطْتُ فِي جَنْبِ اللَّهِ وَإِنْ كُنْتُ لَمِنَ السَّاخِرِينَ",
      "verseStringB": "Lest a soul should say: O woe is me, that I fell short of my duty to Allāh! and surely I was of those who laughed to scorn;"
    },
    {
      "verseNumber": 57,
      "verseString": "أَوْ تَقُولَ لَوْ أَنَّ اللَّهَ هَدَانِي لَكُنْتُ مِنَ الْمُتَّقِينَ",
      "verseStringB": "Or it should say: Had Allāh guided me, I should have been dutiful."
    },
    {
      "verseNumber": 58,
      "verseString": "أَوْ تَقُولَ حِينَ تَرَى الْعَذَابَ لَوْ أَنَّ لِي كَرَّةً فَأَكُونَ مِنَ الْمُحْسِنِينَ",
      "verseStringB": "Or it should say, when it sees the chastisement: Had I another chance I should be a doer of good."
    },
    {
      "verseNumber": 59,
      "verseString": "بَلَىٰ قَدْ جَاءَتْكَ آيَاتِي فَكَذَّبْتَ بِهَا وَاسْتَكْبَرْتَ وَكُنْتَ مِنَ الْكَافِرِينَ",
      "verseStringB": "Aye! My messages came to thee, but thou didst reject them, and wast proud and wast of the disbelievers."
    },
    {
      "verseNumber": 60,
      "verseString": "وَيَوْمَ الْقِيَامَةِ تَرَى الَّذِينَ كَذَبُوا عَلَى اللَّهِ وُجُوهُهُمْ مُسْوَدَّةٌ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِلْمُتَكَبِّرِينَ",
      "verseStringB": "And on the day of Resurrection thou wilt see those who lied against Allāh, their faces will be blackened. Is there not in hell an abode for the proud?"
    },
    {
      "verseNumber": 61,
      "verseString": "وَيُنَجِّي اللَّهُ الَّذِينَ اتَّقَوْا بِمَفَازَتِهِمْ لَا يَمَسُّهُمُ السُّوءُ وَلَا هُمْ يَحْزَنُونَ",
      "verseStringB": "And Allāh delivers those who keep their duty with their achievement — evil touches them not, nor do they grieve."
    },
    {
      "verseNumber": 62,
      "verseString": "اللَّهُ خَالِقُ كُلِّ شَيْءٍ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ وَكِيلٌ",
      "verseStringB": "Allāh is the Creator of all things and He has charge over everything."
    },
    {
      "verseNumber": 63,
      "verseString": "لَهُ مَقَالِيدُ السَّمَاوَاتِ وَالْأَرْضِ ۗ وَالَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ أُولَٰئِكَ هُمُ الْخَاسِرُونَ",
      "verseStringB": "His are the treasures of the heavens and the earth. And those who disbelieve in the messages of Allāh, such are the losers."
    },
    {
      "verseNumber": 64,
      "verseString": "قُلْ أَفَغَيْرَ اللَّهِ تَأْمُرُونِّي أَعْبُدُ أَيُّهَا الْجَاهِلُونَ",
      "verseStringB": "Say: Do you bid me serve others than Allāh, O ye ignorant ones?"
    },
    {
      "verseNumber": 65,
      "verseString": "وَلَقَدْ أُوحِيَ إِلَيْكَ وَإِلَى الَّذِينَ مِنْ قَبْلِكَ لَئِنْ أَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ وَلَتَكُونَنَّ مِنَ الْخَاسِرِينَ",
      "verseStringB": "And certainly, it has been revealed to thee and to those before thee: If thou associate (with Allāh), thy work would certainly come to naught and thou wouldst be a loser."
    },
    {
      "verseNumber": 66,
      "verseString": "بَلِ اللَّهَ فَاعْبُدْ وَكُنْ مِنَ الشَّاكِرِينَ",
      "verseStringB": "Nay, but serve Allāh alone and be of the thankful."
    },
    {
      "verseNumber": 67,
      "verseString": "وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ وَالْأَرْضُ جَمِيعًا قَبْضَتُهُ يَوْمَ الْقِيَامَةِ وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ",
      "verseStringB": "And they honour not Allāh with the honour due to Him; and the whole earth will be in His grip on the day of Resurrection and the heavens rolled up in His right hand. Glory be to Him! and highly exalted is He above what they associate (with Him)."
    },
    {
      "verseNumber": 68,
      "verseString": "وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ إِلَّا مَنْ شَاءَ اللَّهُ ۖ ثُمَّ نُفِخَ فِيهِ أُخْرَىٰ فَإِذَا هُمْ قِيَامٌ يَنْظُرُونَ",
      "verseStringB": "And the trumpet is blown, so all those in the heavens and all those in the earth will swoon, except such as Allāh please. Then it will be blown again, when lo! they stand up, awaiting.ᵃ"
    },
    {
      "verseNumber": 69,
      "verseString": "وَأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّهَا وَوُضِعَ الْكِتَابُ وَجِيءَ بِالنَّبِيِّينَ وَالشُّهَدَاءِ وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ وَهُمْ لَا يُظْلَمُونَ",
      "verseStringB": "And the earth beams with the light of its Lord, and the Book is laid down, and the prophets and the witnesses are brought up, and judgment is given between them with justice, and they are not wronged.ᵃ"
    },
    {
      "verseNumber": 70,
      "verseString": "وَوُفِّيَتْ كُلُّ نَفْسٍ مَا عَمِلَتْ وَهُوَ أَعْلَمُ بِمَا يَفْعَلُونَ",
      "verseStringB": "And every soul is paid back fully for what it did, and He knows best what they do."
    },
    {
      "verseNumber": 71,
      "verseString": "وَسِيقَ الَّذِينَ كَفَرُوا إِلَىٰ جَهَنَّمَ زُمَرًا ۖ حَتَّىٰ إِذَا جَاءُوهَا فُتِحَتْ أَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا أَلَمْ يَأْتِكُمْ رُسُلٌ مِنْكُمْ يَتْلُونَ عَلَيْكُمْ آيَاتِ رَبِّكُمْ وَيُنْذِرُونَكُمْ لِقَاءَ يَوْمِكُمْ هَٰذَا ۚ قَالُوا بَلَىٰ وَلَٰكِنْ حَقَّتْ كَلِمَةُ الْعَذَابِ عَلَى الْكَافِرِينَ",
      "verseStringB": "And those who disbelieve are driven to hell in companies; until, when they come to it, its doors are opened, and the keepers of it say to them: Did not there come to you messengers from among you reciting to you the messages of your Lord and warning you of the meeting of this day of yours? They say: Yea. But the word of punishment proved true against the disbelievers."
    },
    {
      "verseNumber": 72,
      "verseString": "قِيلَ ادْخُلُوا أَبْوَابَ جَهَنَّمَ خَالِدِينَ فِيهَا ۖ فَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ",
      "verseStringB": "It is said: Enter the gates of hell to abide therein; so evil is the abode of the proud."
    },
    {
      "verseNumber": 73,
      "verseString": "وَسِيقَ الَّذِينَ اتَّقَوْا رَبَّهُمْ إِلَى الْجَنَّةِ زُمَرًا ۖ حَتَّىٰ إِذَا جَاءُوهَا وَفُتِحَتْ أَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلَامٌ عَلَيْكُمْ طِبْتُمْ فَادْخُلُوهَا خَالِدِينَ",
      "verseStringB": "And those who keep their duty to their Lord are conveyed to the Garden in companies until when they come to it, and its doors are opened and the keepers of it say to them: Peace be to you! you led pure lives; so enter it to abide."
    },
    {
      "verseNumber": 74,
      "verseString": "وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي صَدَقَنَا وَعْدَهُ وَأَوْرَثَنَا الْأَرْضَ نَتَبَوَّأُ مِنَ الْجَنَّةِ حَيْثُ نَشَاءُ ۖ فَنِعْمَ أَجْرُ الْعَامِلِينَ",
      "verseStringB": "And they say: Praise be to Allāh! Who has made good to us His promise, and He has made us inherit the land; we abide in the Garden where we please.ᵃ So goodly is the reward of the workers."
    },
    {
      "verseNumber": 75,
      "verseString": "وَتَرَى الْمَلَائِكَةَ حَافِّينَ مِنْ حَوْلِ الْعَرْشِ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ ۖ وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ وَقِيلَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
      "verseStringB": "And thou seest the angels going round about the Throne of Power, glorifying their Lord with praise. And they are judged with justice, and it is said: Praise be to Allāh, the Lord of the worlds!"
    }
  ],
  "nameEnglish": "The Crowds",
  "nameTrans": "az-Zumar",
  "nameArabic": "الزمر",
  "chapterNumber": 39,
  "nVerses": 75,
  "footnotes": [
    {
      "note": "3a. All worshippers of false deities pretend that such deities are worshipped only toget nearer to God, as if God Himself were unapproachable. The idol-worshippers saythat the idols are only symbols for concentration on God, while the Christians, plainlyspoken of in the next verse, hold that without the Son they can have no access to God.But undue reverence of created things is a step leading to degradation of human nature.Hence it is that Islåm requires sincere obedience to, or worship of, God alone.\n\n4a. We find the Christian doctrine referred to and refuted in very early Makkan revelations, such as the 19th chapter, which was recited by the Muslim refugees in Abyssiniabefore the Negus, in or about the fifth year of the Prophet’s mission. The Qur’ån refers tothe error of attributing a son to the Divine Being almost as frequently as to the setting upof idols. It is pointed out here that no one holds a relation of sonship to Allåh, but that it isHis chosen servants that are metaphorically called His sons, because in being manifestations of the Divine attributes they stand to Allåh in the same relation as a son stands to afather, being images of His attributes as a son is the image of a father.\n\n6a. The word anzala (infinitive noun inzål) is not applied only to the actual sendingdown of a thing, but also to making it accessible to men. Inzål means ß©ål or iblågh (R),just as iron (57:25) and clothing (7:26) are spoken of as having been sent down. It is inthis sense that the cattle are spoken of here as being sent down for men. The eight of thecattle are the four pairs spoken of in 6:143-144. The four animals are mentioned particularly as being most useful for man.\n\n10a. The words are a comfort to the Muslims, who were subjected to sufferings intheir own land, and give them the assurance that, if suppressed in one land, Islåm willprosper in other lands.\n\n20a. This shows that in the Hereafter, and in this life as well, there is an unceasingprogress, for the high places to which the righteous attain have places still higher abovethem.\n\n21a. The allusion is to the fate of nations; they are brought into existence, made torise, then decay and are swept out of existence. Even the Muslim nations are subject tothe same law, but Islåm itself, being a law of life, is not subject to decay. The place ofone nation that decays is taken by another. Moreover, nations that decay because of theirtransgressions may again be raised to life by turning to righteousness.\n\n23a. The Qur’ån is here spoken of as being mutashåbih and mathånß. The first wordmeans that which is conformable in its various parts (LL). This claim is by no meansinsignificant. The Qur’ån was revealed by portions during a period of twenty-three years,and during this period the circumstances under which the Holy Prophet lived were ofsuch a varied nature that the history of no other man offers a similar combination of varying circumstances. Yet, through all these vicissitudes, the Qur’ån shows a strict uniformity. The conformability of its various parts, however, signifies more than a mere uniformity; it signifies that some parts explain other parts. Mutashåbih, it should be noted, signifies, according to the best authorities, that some parts of it verify other parts. Again, it iscalled mathånß, pl. of mathnå, which means repeated or repeating. It is given this namebecause it repeats over and over again the most important subjects, especially the Unityof the Divine Being and the accountability of human actions. See also 3:7a.\n\n27a. The Holy Qur’ån repeatedly claims to be a complete collection of the bestteachings for the moral and spiritual welfare of man. Here it claims to be a perfect book,as not only containing all the necessary teachings, but also answering all the objectionsof its opponents; see 17:89a and 25:33a.\n\n35a. The Holy Qur’ån brought about an unprecedented revolution in the world.People who took pride in doing evil deeds now aspired to deeds of righteousness. Theywere thus turned away from the worst deeds to the best. This verse prophetically refersto this great change.\n\n36a. The superstitious Arabs no doubt believed that their idols could do harm tomen who did not admit their authority.\n\n40a. Two kinds of punishment are plainly spoken of, viz., the punishment that willbring disgrace, which is clearly the punishment of this life, and the lasting punishmentthat the wicked receive in the life after death. The first of these demonstrates the truth ofthe other.\n\n42a. It is clear that it is not the animal soul that is taken away in sleep; it is the soulthat stands for human consciousness. In death both are taken away. The statement further makes it clear that the word tawaff å is applied to the taking of the soul and not tothe removal of the body from one place to another. See also 21:95a and 23:100a.\n\n45a. Elsewhere the Holy Qur’ån says: “And most of them believe not in Allåh without associating others (with Him)” (12:106).\n\n47a. What they never thought of signifies the overthrow of their power in this lifeand the manifestation of the evil consequences of their deeds in the Hereafter.\n\n48a. The fact that the heaven and hell of the next life are only manifestations of thespiritual realities of this life is stated here in clear language. The evil consequences ofwhat they do are hidden from the eye in this life, but they shall become plain in the nextlife.\n\n51a. Wonderful indeed is the certainty of the tone in which these prophecies areworded, when all around there was not a single ray of hope for Islåm, and its enemieswere in the ascendant.\n\n53a. Stress is laid on the mercy and love of Allåh in all religions, but these greatDivine attributes find their true and final expression in Islåm. No religion gives thesolace and comfort which we find in this verse. It discloses the all-comprehensive mercyof Allåh, before which the sins of men become quite insignificant.\n\n55a. A√san, or best, stands for the revelation of the Qur’ån. God has ever beenrevealing His will to men, but the Qur’ån, being the final expression of His will, is thebest revelation that has been sent to men.\n\n68a. For the ˝∂r, see 6:73b. Here it is stated that the trumpet is blown twice. At thefirst blowing all swoon, and at the second blowing they all stand up, awaiting to receivethe judgment. A general destruction is thus followed by a resurrection. In the case of thespiritual resurrection, the destruction signifies the destruction of the old order.\n\n69a. The beaming of the earth with the light of its Lord in the Resurrection is in reference to the clear manifestation of the consequences of the deeds which remain generally hidden in this life. The laying down of the Book refers to the passing of the judgment on the good and the evil according to their deserts. The prophets and the witnessesare brought up, these being the people who sow the seeds of virtue and turn men’sminds to God. Prophets were sent to every nation, and the followers of the ProphetMu√ammad, who take the place of the previous prophets in turning men’s minds to God,are the witnesses spoken of here; they are specially mentioned by this name in 2:143. Adeeper reference to the spiritual resurrection is evident throughout.\n\n74a. Never was prophecy uttered in clearer terms, nor in more adverse circumstances. The day must come, we are here told, when the believers will praise God formaking them inherit the land. Within fifteen years of this prophecy they were made masters of Arabia, and within another five they were made to inherit the Holy Land. Note,further, how the prophecies of triumph in this life are combined with the Resurrection inwhich the righteous are to receive the mighty spiritual blessings in full manifestation."
    }
  ]
}
