{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "حم",
      "verseStringB": "Beneficent God!"
    },
    {
      "verseNumber": 2,
      "verseString": "عسق",
      "verseStringB": "Knowing, Hearing, Powerful God!ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "كَذَٰلِكَ يُوحِي إِلَيْكَ وَإِلَى الَّذِينَ مِنْ قَبْلِكَ اللَّهُ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "Thus does Allāh, the Mighty, the Wise, reveal to thee, and (He revealed) to those before thee."
    },
    {
      "verseNumber": 4,
      "verseString": "لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      "verseStringB": "To Him belongs whatever is in the heavens and whatever is in the earth; and He is the High, the Great."
    },
    {
      "verseNumber": 5,
      "verseString": "تَكَادُ السَّمَاوَاتُ يَتَفَطَّرْنَ مِنْ فَوْقِهِنَّ ۚ وَالْمَلَائِكَةُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيَسْتَغْفِرُونَ لِمَنْ فِي الْأَرْضِ ۗ أَلَا إِنَّ اللَّهَ هُوَ الْغَفُورُ الرَّحِيمُ",
      "verseStringB": "The heavens may almost be rent asunder above them, while the angels celebrate the praise of their Lord and ask forgiveness for those on earth.ᵃ Now surely Allāh is the Forgiving, the Merciful."
    },
    {
      "verseNumber": 6,
      "verseString": "وَالَّذِينَ اتَّخَذُوا مِنْ دُونِهِ أَوْلِيَاءَ اللَّهُ حَفِيظٌ عَلَيْهِمْ وَمَا أَنْتَ عَلَيْهِمْ بِوَكِيلٍ",
      "verseStringB": "And those who take protectors besides Him — Allāh watches over them; and thou hast not charge over them."
    },
    {
      "verseNumber": 7,
      "verseString": "وَكَذَٰلِكَ أَوْحَيْنَا إِلَيْكَ قُرْآنًا عَرَبِيًّا لِتُنْذِرَ أُمَّ الْقُرَىٰ وَمَنْ حَوْلَهَا وَتُنْذِرَ يَوْمَ الْجَمْعِ لَا رَيْبَ فِيهِ ۚ فَرِيقٌ فِي الْجَنَّةِ وَفَرِيقٌ فِي السَّعِيرِ",
      "verseStringB": "And thus have We revealed to thee an Arabic Qur’ān, that thou mayest warn the mother-town and those around it,ᵃ and give warning of the day of Gathering, wherein is no doubt. A party will be in the Garden and (another) party in the burning Fire."
    },
    {
      "verseNumber": 8,
      "verseString": "وَلَوْ شَاءَ اللَّهُ لَجَعَلَهُمْ أُمَّةً وَاحِدَةً وَلَٰكِنْ يُدْخِلُ مَنْ يَشَاءُ فِي رَحْمَتِهِ ۚ وَالظَّالِمُونَ مَا لَهُمْ مِنْ وَلِيٍّ وَلَا نَصِيرٍ",
      "verseStringB": "And if Allāh had pleased, He would surely have made them a single nation, but He admits whom He pleases to His mercy. And the wrongdoers have no protector nor helper."
    },
    {
      "verseNumber": 9,
      "verseString": "أَمِ اتَّخَذُوا مِنْ دُونِهِ أَوْلِيَاءَ ۖ فَاللَّهُ هُوَ الْوَلِيُّ وَهُوَ يُحْيِي الْمَوْتَىٰ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "Or have they taken protectors besides Him? But Allāh is the Protector, and He gives life to the dead, and He is Possessor of power over all things."
    },
    {
      "verseNumber": 10,
      "verseString": "وَمَا اخْتَلَفْتُمْ فِيهِ مِنْ شَيْءٍ فَحُكْمُهُ إِلَى اللَّهِ ۚ ذَٰلِكُمُ اللَّهُ رَبِّي عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ",
      "verseStringB": "And in whatever you differ, the judgment thereof is with Allāh. That is Allāh, my Lord; on Him I rely, and to Him I turn."
    },
    {
      "verseNumber": 11,
      "verseString": "فَاطِرُ السَّمَاوَاتِ وَالْأَرْضِ ۚ جَعَلَ لَكُمْ مِنْ أَنْفُسِكُمْ أَزْوَاجًا وَمِنَ الْأَنْعَامِ أَزْوَاجًا ۖ يَذْرَؤُكُمْ فِيهِ ۚ لَيْسَ كَمِثْلِهِ شَيْءٌ ۖ وَهُوَ السَّمِيعُ الْبَصِيرُ",
      "verseStringB": "The OrigInᵃ tor of the heavens and the earth. He has made for you pairs from among yourselves, and pairs of the cattle, too, multiplying you thereby. Nothing is like Him; and He is the Hearing, the Seeing.ᵃ"
    },
    {
      "verseNumber": 12,
      "verseString": "لَهُ مَقَالِيدُ السَّمَاوَاتِ وَالْأَرْضِ ۖ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِرُ ۚ إِنَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ",
      "verseStringB": "His are the treasures of the heavens and the earth — He amplifies and straitens subsistence for whom He pleases. Surely He is Knower of all things."
    },
    {
      "verseNumber": 13,
      "verseString": "شَرَعَ لَكُمْ مِنَ الدِّينِ مَا وَصَّىٰ بِهِ نُوحًا وَالَّذِي أَوْحَيْنَا إِلَيْكَ وَمَا وَصَّيْنَا بِهِ إِبْرَاهِيمَ وَمُوسَىٰ وَعِيسَىٰ ۖ أَنْ أَقِيمُوا الدِّينَ وَلَا تَتَفَرَّقُوا فِيهِ ۚ كَبُرَ عَلَى الْمُشْرِكِينَ مَا تَدْعُوهُمْ إِلَيْهِ ۚ اللَّهُ يَجْتَبِي إِلَيْهِ مَنْ يَشَاءُ وَيَهْدِي إِلَيْهِ مَنْ يُنِيبُ",
      "verseStringB": "He has made plain to you the religion which He enjoined upon Noah and which We have revealed to thee, and which We enjoined on Abraham and Moses and Jesus — to establish religion and not to be divided therein.ᵃ Hard for the polytheists is that to which thou callest them. Allāh chooses for Himself whom He pleases, and guides to Himself him who turns (to Him)."
    },
    {
      "verseNumber": 14,
      "verseString": "وَمَا تَفَرَّقُوا إِلَّا مِنْ بَعْدِ مَا جَاءَهُمُ الْعِلْمُ بَغْيًا بَيْنَهُمْ ۚ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَبِّكَ إِلَىٰ أَجَلٍ مُسَمًّى لَقُضِيَ بَيْنَهُمْ ۚ وَإِنَّ الَّذِينَ أُورِثُوا الْكِتَابَ مِنْ بَعْدِهِمْ لَفِي شَكٍّ مِنْهُ مُرِيبٍ",
      "verseStringB": "And they were not divided until after knowledge had come to them, out of envy among themselves. And had not a word gone forth from thy Lord for an appointed term, the matter would surely have been judged between them. And those who were made to inherit the Book after them are surely in disquieting doubt about it.ᵃ"
    },
    {
      "verseNumber": 15,
      "verseString": "فَلِذَٰلِكَ فَادْعُ ۖ وَاسْتَقِمْ كَمَا أُمِرْتَ ۖ وَلَا تَتَّبِعْ أَهْوَاءَهُمْ ۖ وَقُلْ آمَنْتُ بِمَا أَنْزَلَ اللَّهُ مِنْ كِتَابٍ ۖ وَأُمِرْتُ لِأَعْدِلَ بَيْنَكُمُ ۖ اللَّهُ رَبُّنَا وَرَبُّكُمْ ۖ لَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ ۖ لَا حُجَّةَ بَيْنَنَا وَبَيْنَكُمُ ۖ اللَّهُ يَجْمَعُ بَيْنَنَا ۖ وَإِلَيْهِ الْمَصِيرُ",
      "verseStringB": "To this then go on inviting, and be steadfast as thou art commanded, and follow not their low desires, and say: I believe in what Allāh has revealed of the Book, and I am commanded to do justice between you. Allāh is our Lord and your Lord. For us are our deeds; and for you your deeds. There is no contention between us and you. Allāh will gather us together, and to Him is the eventual coming.ᵃ"
    },
    {
      "verseNumber": 16,
      "verseString": "وَالَّذِينَ يُحَاجُّونَ فِي اللَّهِ مِنْ بَعْدِ مَا اسْتُجِيبَ لَهُ حُجَّتُهُمْ دَاحِضَةٌ عِنْدَ رَبِّهِمْ وَعَلَيْهِمْ غَضَبٌ وَلَهُمْ عَذَابٌ شَدِيدٌ",
      "verseStringB": "And those who dispute about Allāh after obedience has been rendered to Him, their plea is null with their Lord, and upon them is wrath, and for them is severe chastisement.ᵃ"
    },
    {
      "verseNumber": 17,
      "verseString": "اللَّهُ الَّذِي أَنْزَلَ الْكِتَابَ بِالْحَقِّ وَالْمِيزَانَ ۗ وَمَا يُدْرِيكَ لَعَلَّ السَّاعَةَ قَرِيبٌ",
      "verseStringB": "Allāh is He Who revealed the Book with truth, and the Balance;ᵃ and what will make thee know that perhaps the Hour is nigh."
    },
    {
      "verseNumber": 18,
      "verseString": "يَسْتَعْجِلُ بِهَا الَّذِينَ لَا يُؤْمِنُونَ بِهَا ۖ وَالَّذِينَ آمَنُوا مُشْفِقُونَ مِنْهَا وَيَعْلَمُونَ أَنَّهَا الْحَقُّ ۗ أَلَا إِنَّ الَّذِينَ يُمَارُونَ فِي السَّاعَةِ لَفِي ضَلَالٍ بَعِيدٍ",
      "verseStringB": "Those who believe not in it would hasten it on, and those who believe are in fear from it, and they know that it is the Truth. Now surely those who dispute concerning the Hour are far astray."
    },
    {
      "verseNumber": 19,
      "verseString": "اللَّهُ لَطِيفٌ بِعِبَادِهِ يَرْزُقُ مَنْ يَشَاءُ ۖ وَهُوَ الْقَوِيُّ الْعَزِيزُ",
      "verseStringB": "Allāh is Benignant to His servants; He gives sustenance to whom He pleases; and He is the Strong, the Mighty."
    },
    {
      "verseNumber": 20,
      "verseString": "مَنْ كَانَ يُرِيدُ حَرْثَ الْآخِرَةِ نَزِدْ لَهُ فِي حَرْثِهِ ۖ وَمَنْ كَانَ يُرِيدُ حَرْثَ الدُّنْيَا نُؤْتِهِ مِنْهَا وَمَا لَهُ فِي الْآخِرَةِ مِنْ نَصِيبٍ",
      "verseStringB": "Whoso desires the tilth of the Hereafter, We give him increase in his tilth; and whoso desires the tilth of this world, We give him thereof; and he has no portion in the Hereafter."
    },
    {
      "verseNumber": 21,
      "verseString": "أَمْ لَهُمْ شُرَكَاءُ شَرَعُوا لَهُمْ مِنَ الدِّينِ مَا لَمْ يَأْذَنْ بِهِ اللَّهُ ۚ وَلَوْلَا كَلِمَةُ الْفَصْلِ لَقُضِيَ بَيْنَهُمْ ۗ وَإِنَّ الظَّالِمِينَ لَهُمْ عَذَابٌ أَلِيمٌ",
      "verseStringB": "Or have they associates who have prescribed for them any religion that Allāh does not sanction? And were it not for the word of judgment, it would have been decided between them. And surely for the wrongdoers is a painful chastisement.ᵃ"
    },
    {
      "verseNumber": 22,
      "verseString": "تَرَى الظَّالِمِينَ مُشْفِقِينَ مِمَّا كَسَبُوا وَهُوَ وَاقِعٌ بِهِمْ ۗ وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فِي رَوْضَاتِ الْجَنَّاتِ ۖ لَهُمْ مَا يَشَاءُونَ عِنْدَ رَبِّهِمْ ۚ ذَٰلِكَ هُوَ الْفَضْلُ الْكَبِيرُ",
      "verseStringB": "Thou seest the unjust fearing on account of what they have earned, and it must befall them. And those who believe and do good are in the meadows of the Gardens — they have what they please with their Lord. That is the great grace."
    },
    {
      "verseNumber": 23,
      "verseString": "ذَٰلِكَ الَّذِي يُبَشِّرُ اللَّهُ عِبَادَهُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ ۗ قُلْ لَا أَسْأَلُكُمْ عَلَيْهِ أَجْرًا إِلَّا الْمَوَدَّةَ فِي الْقُرْبَىٰ ۗ وَمَنْ يَقْتَرِفْ حَسَنَةً نَزِدْ لَهُ فِيهَا حُسْنًا ۚ إِنَّ اللَّهَ غَفُورٌ شَكُورٌ",
      "verseStringB": "This it is of which Allāh gives the good news to His servants, who believe and do good. Say: I ask of you naught in return for it but love for relatives.ᵃ And whoever earns good, We give him more of good therein. Surely Allāh is Forgiving, Grateful."
    },
    {
      "verseNumber": 24,
      "verseString": "أَمْ يَقُولُونَ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا ۖ فَإِنْ يَشَإِ اللَّهُ يَخْتِمْ عَلَىٰ قَلْبِكَ ۗ وَيَمْحُ اللَّهُ الْبَاطِلَ وَيُحِقُّ الْحَقَّ بِكَلِمَاتِهِ ۚ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ",
      "verseStringB": "Or say they: He has forged a lie against Allāh? So, if Allāh please, He would seal thy heart (against them).ᵃ And Allāh blots out the falsehood and confirms the Truth with His words.ᵇ Surely He is Knower of what is in the breasts."
    },
    {
      "verseNumber": 25,
      "verseString": "وَهُوَ الَّذِي يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ وَيَعْفُو عَنِ السَّيِّئَاتِ وَيَعْلَمُ مَا تَفْعَلُونَ",
      "verseStringB": "And He it is Who accepts repentance from His servants and pardons evil deeds, and He knows what you do;"
    },
    {
      "verseNumber": 26,
      "verseString": "وَيَسْتَجِيبُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَيَزِيدُهُمْ مِنْ فَضْلِهِ ۚ وَالْكَافِرُونَ لَهُمْ عَذَابٌ شَدِيدٌ",
      "verseStringB": "And He answers those who believe and do good deeds, and gives them more out of His grace. And for the disbelievers is a severe chastisement."
    },
    {
      "verseNumber": 27,
      "verseString": "وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ وَلَٰكِنْ يُنَزِّلُ بِقَدَرٍ مَا يَشَاءُ ۚ إِنَّهُ بِعِبَادِهِ خَبِيرٌ بَصِيرٌ",
      "verseStringB": "And if Allāh were to amplify the provision for His servants, they would rebel in the earth; but He sends (it) down by measure, as He pleases. Surely He is Aware, Seer of His servants."
    },
    {
      "verseNumber": 28,
      "verseString": "وَهُوَ الَّذِي يُنَزِّلُ الْغَيْثَ مِنْ بَعْدِ مَا قَنَطُوا وَيَنْشُرُ رَحْمَتَهُ ۚ وَهُوَ الْوَلِيُّ الْحَمِيدُ",
      "verseStringB": "And He it is Who sends down the rain after they have despaired, and He unfolds His mercy. And He is the Friend, the Praised One."
    },
    {
      "verseNumber": 29,
      "verseString": "وَمِنْ آيَاتِهِ خَلْقُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَثَّ فِيهِمَا مِنْ دَابَّةٍ ۚ وَهُوَ عَلَىٰ جَمْعِهِمْ إِذَا يَشَاءُ قَدِيرٌ",
      "verseStringB": "And of His signs is the creation of the heavens and the earth and what He has spread forth in both of them of living beings. And He is All-powerful to gather them together, when He will."
    },
    {
      "verseNumber": 30,
      "verseString": "وَمَا أَصَابَكُمْ مِنْ مُصِيبَةٍ فَبِمَا كَسَبَتْ أَيْدِيكُمْ وَيَعْفُو عَنْ كَثِيرٍ",
      "verseStringB": "And whatever misfortune befalls you, it is on account of what your hands have wrought and He pardons much."
    },
    {
      "verseNumber": 31,
      "verseString": "وَمَا أَنْتُمْ بِمُعْجِزِينَ فِي الْأَرْضِ ۖ وَمَا لَكُمْ مِنْ دُونِ اللَّهِ مِنْ وَلِيٍّ وَلَا نَصِيرٍ",
      "verseStringB": "And you cannot escape in the earth, and besides Allāh you have no protector nor helper."
    },
    {
      "verseNumber": 32,
      "verseString": "وَمِنْ آيَاتِهِ الْجَوَارِ فِي الْبَحْرِ كَالْأَعْلَامِ",
      "verseStringB": "And of His signs are the ships, like mountains on the sea."
    },
    {
      "verseNumber": 33,
      "verseString": "إِنْ يَشَأْ يُسْكِنِ الرِّيحَ فَيَظْلَلْنَ رَوَاكِدَ عَلَىٰ ظَهْرِهِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِكُلِّ صَبَّارٍ شَكُورٍ",
      "verseStringB": "If He will, He stills the wind so that they lie motionless on its back. Surely there are signs in this for every patient, grateful one,"
    },
    {
      "verseNumber": 34,
      "verseString": "أَوْ يُوبِقْهُنَّ بِمَا كَسَبُوا وَيَعْفُ عَنْ كَثِيرٍ",
      "verseStringB": "Or He causes them to perish for what they have earned, and He pardons much;ᵃ"
    },
    {
      "verseNumber": 35,
      "verseString": "وَيَعْلَمَ الَّذِينَ يُجَادِلُونَ فِي آيَاتِنَا مَا لَهُمْ مِنْ مَحِيصٍ",
      "verseStringB": "And (that) those who dispute about Our messages may know. There is no refuge for them."
    },
    {
      "verseNumber": 36,
      "verseString": "فَمَا أُوتِيتُمْ مِنْ شَيْءٍ فَمَتَاعُ الْحَيَاةِ الدُّنْيَا ۖ وَمَا عِنْدَ اللَّهِ خَيْرٌ وَأَبْقَىٰ لِلَّذِينَ آمَنُوا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ",
      "verseStringB": "So whatever you are given is but a provision of this world’s life, and that which Allāh has is better and more lasting for those who believe and rely on their Lord;"
    },
    {
      "verseNumber": 37,
      "verseString": "وَالَّذِينَ يَجْتَنِبُونَ كَبَائِرَ الْإِثْمِ وَالْفَوَاحِشَ وَإِذَا مَا غَضِبُوا هُمْ يَغْفِرُونَ",
      "verseStringB": "And those who shun the great sins and indecencies, and whenever they are angry they forgive;"
    },
    {
      "verseNumber": 38,
      "verseString": "وَالَّذِينَ اسْتَجَابُوا لِرَبِّهِمْ وَأَقَامُوا الصَّلَاةَ وَأَمْرُهُمْ شُورَىٰ بَيْنَهُمْ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ",
      "verseStringB": "And those who respond to their Lord and keep up prayer, and whose affairs are (decided) by counsel among themselves, and who spend out of what We have given them;ᵃ"
    },
    {
      "verseNumber": 39,
      "verseString": "وَالَّذِينَ إِذَا أَصَابَهُمُ الْبَغْيُ هُمْ يَنْتَصِرُونَ",
      "verseStringB": "And those who, when great wrong afflicts them, defend themselves.ᵃ"
    },
    {
      "verseNumber": 40,
      "verseString": "وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُهَا ۖ فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ ۚ إِنَّهُ لَا يُحِبُّ الظَّالِمِينَ",
      "verseStringB": "And the recompense of evil is punishment like it; but whoever forgives and amends, his reward is with Allāh. Surely He loves not the wrongdoers.ᵃ"
    },
    {
      "verseNumber": 41,
      "verseString": "وَلَمَنِ انْتَصَرَ بَعْدَ ظُلْمِهِ فَأُولَٰئِكَ مَا عَلَيْهِمْ مِنْ سَبِيلٍ",
      "verseStringB": "And whoever defends himself after his being oppressed, these it is against whom there is no way (of blame)."
    },
    {
      "verseNumber": 42,
      "verseString": "إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَظْلِمُونَ النَّاسَ وَيَبْغُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ ۚ أُولَٰئِكَ لَهُمْ عَذَابٌ أَلِيمٌ",
      "verseStringB": "The way (of blame) is only against those who oppress men and revolt in the earth unjustly. For such there is a painful chastisement."
    },
    {
      "verseNumber": 43,
      "verseString": "وَلَمَنْ صَبَرَ وَغَفَرَ إِنَّ ذَٰلِكَ لَمِنْ عَزْمِ الْأُمُورِ",
      "verseStringB": "And whoever is patient and forgives — that surely is an affair of great resolution."
    },
    {
      "verseNumber": 44,
      "verseString": "وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ وَلِيٍّ مِنْ بَعْدِهِ ۗ وَتَرَى الظَّالِمِينَ لَمَّا رَأَوُا الْعَذَابَ يَقُولُونَ هَلْ إِلَىٰ مَرَدٍّ مِنْ سَبِيلٍ",
      "verseStringB": "And he whom Allāh leaves in error, has no friend after Him. And thou wilt see the iniquitous, when they see the chastisement, saying: Is there any way of return?"
    },
    {
      "verseNumber": 45,
      "verseString": "وَتَرَاهُمْ يُعْرَضُونَ عَلَيْهَا خَاشِعِينَ مِنَ الذُّلِّ يَنْظُرُونَ مِنْ طَرْفٍ خَفِيٍّ ۗ وَقَالَ الَّذِينَ آمَنُوا إِنَّ الْخَاسِرِينَ الَّذِينَ خَسِرُوا أَنْفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ الْقِيَامَةِ ۗ أَلَا إِنَّ الظَّالِمِينَ فِي عَذَابٍ مُقِيمٍ",
      "verseStringB": "And thou wilt see them brought before it, humbling themselves because of abasement, looking with a faint glance. And those who believe will say: Surely the losers are they who lose themselves and their followers on the Resurrection day. Now surely the iniquitous are in lasting chastisement."
    },
    {
      "verseNumber": 46,
      "verseString": "وَمَا كَانَ لَهُمْ مِنْ أَوْلِيَاءَ يَنْصُرُونَهُمْ مِنْ دُونِ اللَّهِ ۗ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ سَبِيلٍ",
      "verseStringB": "And they will have no friends to help them besides Allāh. And he whom Allāh leaves in error cannot find a way."
    },
    {
      "verseNumber": 47,
      "verseString": "اسْتَجِيبُوا لِرَبِّكُمْ مِنْ قَبْلِ أَنْ يَأْتِيَ يَوْمٌ لَا مَرَدَّ لَهُ مِنَ اللَّهِ ۚ مَا لَكُمْ مِنْ مَلْجَإٍ يَوْمَئِذٍ وَمَا لَكُمْ مِنْ نَكِيرٍ",
      "verseStringB": "Hearken to your Lord before there comes from Allāh the day which there is no averting. You will have no refuge on that day, nor will it be yours to make a denial."
    },
    {
      "verseNumber": 48,
      "verseString": "فَإِنْ أَعْرَضُوا فَمَا أَرْسَلْنَاكَ عَلَيْهِمْ حَفِيظًا ۖ إِنْ عَلَيْكَ إِلَّا الْبَلَاغُ ۗ وَإِنَّا إِذَا أَذَقْنَا الْإِنْسَانَ مِنَّا رَحْمَةً فَرِحَ بِهَا ۖ وَإِنْ تُصِبْهُمْ سَيِّئَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ فَإِنَّ الْإِنْسَانَ كَفُورٌ",
      "verseStringB": "But if they turn away, We have not sent thee as a watcher over them. Thy duty is only to deliver (the message). And surely when We make man taste mercy from Us, he rejoices thereat; and if an evil afflicts them on account of what their hands have sent before, then surely man is ungrateful."
    },
    {
      "verseNumber": 49,
      "verseString": "لِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۚ يَخْلُقُ مَا يَشَاءُ ۚ يَهَبُ لِمَنْ يَشَاءُ إِنَاثًا وَيَهَبُ لِمَنْ يَشَاءُ الذُّكُورَ",
      "verseStringB": "Allāh’s is the kingdom of the heavens and the earth. He creates what He pleases. He grants females to whom He pleases and grants males to whom He pleases,"
    },
    {
      "verseNumber": 50,
      "verseString": "أَوْ يُزَوِّجُهُمْ ذُكْرَانًا وَإِنَاثًا ۖ وَيَجْعَلُ مَنْ يَشَاءُ عَقِيمًا ۚ إِنَّهُ عَلِيمٌ قَدِيرٌ",
      "verseStringB": "Or He grants them both males and females, and He makes whom He pleases, barren. Surely He is Knower, Powerful.ᵃ"
    },
    {
      "verseNumber": 51,
      "verseString": "وَمَا كَانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِنْ وَرَاءِ حِجَابٍ أَوْ يُرْسِلَ رَسُولًا فَيُوحِيَ بِإِذْنِهِ مَا يَشَاءُ ۚ إِنَّهُ عَلِيٌّ حَكِيمٌ",
      "verseStringB": "And it is not vouchsafed to a mortal that Allāh should speak to him, except by revelation or from behind a veil, or by sending a messenger and revealing by His permission what He pleases.ᵃ Surely He is High, Wise."
    },
    {
      "verseNumber": 52,
      "verseString": "وَكَذَٰلِكَ أَوْحَيْنَا إِلَيْكَ رُوحًا مِنْ أَمْرِنَا ۚ مَا كُنْتَ تَدْرِي مَا الْكِتَابُ وَلَا الْإِيمَانُ وَلَٰكِنْ جَعَلْنَاهُ نُورًا نَهْدِي بِهِ مَنْ نَشَاءُ مِنْ عِبَادِنَا ۚ وَإِنَّكَ لَتَهْدِي إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ",
      "verseStringB": "And thusa did We reveal to thee an inspired Bookb by Our command. Thou knewest not what the Book was, nor (what) Faith (was), but We made it a light, guiding thereby whom We please of Our servants. And surely thou guidest to the right path —"
    },
    {
      "verseNumber": 53,
      "verseString": "صِرَاطِ اللَّهِ الَّذِي لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ أَلَا إِلَى اللَّهِ تَصِيرُ الْأُمُورُ",
      "verseStringB": "The path of Allāh, to Whom belongs whatsoever is in the heavens and whatsoever is in the earth. Now surely to Allāh do all affairs eventually come."
    }
  ],
  "nameEnglish": "Consultation",
  "nameTrans": "ash-Shura",
  "nameArabic": "الشورى",
  "chapterNumber": 42,
  "nVerses": 53,
  "footnotes": [
    {
      "note": "2a. The first two letters (v. 1) are the same as at the commencement of chapter 40;in the latter three (v. 2), ‘Ain stands for ‘Alßm or Knowing, Sßn for Samß‘ or Hearing, Qåffor Qådir or Powerful.\n\n5a. The significance is that the wickedness of man calls for immediate punishment,but the mercy of Allåh withholds it. The rending asunder of the heaven is elsewhereused to signify Divine displeasure at the Christian doctrine of the divinity of Jesus(19:90, 91). The Divine displeasure at the wickedness of man is very great, but Hismercy supersedes all. The angels’ prayer for forgiveness for man shows that AllåhHimself desires to forgive man. The deeds of men do not merit forgiveness, but forgiveness is the attribute of the Divine Being, and that Divine attribute is exercised throughthe solicitude of the angels.\n\n7a. Umm al-qurå is Makkah, which is called the mother of the towns because it wasdestined to be the spiritual centre of the whole world; see 6:92a.\n\n11a. So transcendent is the Divine Being, and so far above all material conceptions,that a likeness of Him cannot be conceived, even metaphorically. The words translatedlike Him literally mean like a likeness of Him. He is not only above all material limitations, but even above the limitation of metaphor.\n\n13a. Even so early did the Qur’ån announce that the religion preached by theProphet was not a new religion, but, so far as its basic principles were concerned, it wasthe same religion as was preached by Noah and Abraham and Moses and Jesus. Thebasic principle of Islåm — entire submission to One God only — is, in fact, the basicprinciple of the common religion of humanity.\n\n14a. The personal pronoun them in those who were made to inherit the Book afterthem refers to the prophets. The people who were made to inherit the Book after theprophets, rejected the very message with which these prophets came. But they are toldthat their punishment is postponed till an appointed term. Such was the Divine law — aword gone forth from thy Lord — that the struggle against Truth gathers strength at firstand seems to have the upper hand for a time, but it ultimately comes to naught, thusshowing that an unseen hand works in support of the Truth.\n\n15a. The argument was so simple and sound. The Prophet told the followers of earlier revelation that he was a believer in what Allåh had revealed of the Book, in all revelation that came before him, and the basic principles of his revelation were the same asthose of the earlier revelation. The whole thing was so clear that there could not be anydispute. There is a clear ray of hope in the concluding verses — Allåh will gather us —that they will ultimately accept the Truth.\n\n16a. The reference in those who dispute about Allåh after obedience has been rendered to Him may be to the followers of earlier revelation, because their books requiredobedience to a Prophet who should appear after them. Or, the meaning may be, afterpeople have begun to enter Islåm, and Islåm has been established in the land notwithstanding the severest opposition.\n\n17a. The construction is, Allåh revealed the Book and the Balance (Ar., mßzån, balance or measure). The balance is that by which things are weighed. Elsewhere it is said:“Certainly We sent Our messengers with clear arguments, and sent down with them theBook and the measure (mßzån), that men may conduct themselves with equity” (57:25).The purpose of revealing the Balance or measure is thus made clear here. It is that menmay conduct themselves with equity; in other words that they may be able to carry outthe ordinances contained in the Book justly. This is what the Prophet shows by hisexample. He is not only a preacher but also an exemplar. The ordinances of the Book aregiven in words, and the Prophet translates them into deeds, so that it is by following hisexample that men are led aright. The Prophet’s example is thus a balance or measurewhich is as essential for the right guidance of men as the Book. The word mßzån is generally taken here as meaning ‘Adl or Justice (IJ), which would mean the right use of theBook, which is really shown by the Prophet himself, and thus indicates the Prophet’sexample. According to others, the Balance here means the Law (Bd, JB) by which therights and obligations of men are weighed. Mark how material terms are converted intospiritual usage by the Holy Qur’ån. A right realization of this point removes many of thedifficulties in the study of the Holy Book.\n\n21a. The word of judgment indicates a judgment already pronounced, that a respitewill be given to the wrongdoers so that they may have an opportunity to reform themselves.\n\n23a. Commentators generally think that the love enjoined here in respect of relationship signifies loving the offspring (ål) of the Prophet, but there is nothing in the wordswhich entitles us to place that limitation upon the words. The correct significance of thewords is that I ask of you naught in return for it; what I ask you is to love your own relatives. The statement that the Prophet did not ask for any reward at all is made very oftenin the Holy Qur’ån, and the preacher of virtue never asks for any reward. What he askedthem was to live in peace and harmony with each other. The Arabs, closely related asthey were to each other, were in a state of constant warfare. They are told to give upmutual warfare and to love one another. A somewhat similar statement is made elsewhere: “I ask of you naught in return for it, except that he who will may take a way tohis Lord” (25:57). In both cases what the Prophet wanted was not a reward for himself,but it was a good for the people themselves, being, in the second case, that they walk inthe ways of God or lead godly lives and, in the first, that they love one another. Love ofGod and love of man are thus the two essentials of religion taught in these two verses.According to some, however, qurbå here carries the same significance as qurbat ornearness, and what it meant is to love the attainment of nearness to God (R).\n\n24a. The sealing of the Prophet’s heart cannot imply its being sealed against theTruth — Truth was being revealed to him — but the making of it secure against theabuse of his opponents, for they abused the Prophet and called him an impostor. Thissignificance is, moreover, in accordance with the context, for by blotting out the falsehood and confirming the Truth, the abuses would be stopped, and thus his heart wouldbe made secure against them.\n\n24b. The words here imply the prophecies whose fulfilment would firmly establishthe Truth.\n\n34a. The ship in these two verses is the ship of the affairs of the disbelievers, whichwas ultimately to be wrecked, yet Allåh dealt with them mercifully by pardoning mostof the wicked things they did. The next verse makes the significance clear by drawingattention to the fact that the statement is a warning to those who dispute about the messages of Allåh, that they will find no refuge when their ship is wrecked.\n\n38a. The occurrence in an early Makkan revelation of the words whose affairs aredecided by counsel among themselves is very significant. The Muslims are here enjoinedas usual to observe prayer and to spend out of what Allåh has given them. Yet betweenthese two injunctions, which always go together in the Holy Qur’ån, is placed a third:whose affairs are decided by counsel among themselves. It is clear that at this early period the Muslims had no important matters to decide for which they might have stood inneed of counsel, yet between two injunctions which are the basis of a true Islamic life, athird is inserted enjoining that, as a rule, counsel should be taken. The injunction isclearly meant to prepare them for transacting the momentous affairs of State and all matters connected with national weal or woe. In fact, the word amr, which I have translatedas affairs, means command; and amr Allåh, or Allåh’s command, often signifies theestablishment of the kingdom of God, which stands for an Islamic kingdom. The use ofthe word amr, therefore, here refers to the Islamic kingdom, the affairs of which must betransacted by counsel. In this Islåm has laid the basis of Government by parliaments,and the idea found a clear practical expression in the early days of the Caliphate, whenthe Khalßfah had to refer every important affair to counsel. It is strange indeed thatGovernment by parliament is now looked upon by Europeans as an institution which isquite foreign to Islåm and unsuited for the Muslim people.\n\n39a. Inta©ara alone signifies he defended himself against his injurer (LL); followedby min, it signifies the taking of revenge. The first meaning is applicable here, as it is notfollowed by min.\n\n40a. A golden rule relating to forgiveness of evil is given here. The rule laid down isthat evil must be requited by punishment proportionate thereto. Note that punishmentwhich is meted out for an evil is called a sayyi‘ah or an evil, because the Arabs speak ofthe requital of an evil in terms of that evil; see 2:15a. Also note that the punishment mustbe proportionate to the evil. A very just and necessary restriction. And this beautiful maximis given by a man whose people were in the habit of slaughtering whole tribes for the mosttrifling fault of one member. Again, forgiveness is not neglected, nor preached in such amanner as to make it impracticable. There is in Islåm neither the one extreme of tooth fortooth or the opposite one of turning the left cheek when the right is smitten or giving awaythe cloak to one who has already wrongfully taken the coat of his brother; it is the goldenand beautiful mean that forgiveness may be exercised, if forgiveness will mend the matterand do good to the wrongdoer himself. The object to be kept in view is to amend, whetherit is attained by giving proportionate punishment or by exercising forgiveness.\n\n50a. The birth of a daughter was looked upon by the Arabs as a calamity (see 16:58,59), this being due to the low position which women held in society. The wonderfulchange brought about by Islåm in the status of woman is clearly foreshadowed in thisearly revelation, where the daughter has the precedence over the son.\n\n51a. This verse shows how Allåh speaks to a person or makes known His will tohim. Three modes of this are stated: (1) by wa√y, which word is generally translated asmeaning revelation. The primary significance of the word wa√y is, however, a hastysuggestion, and since the different kinds of revelation are spoken of here, the meaningintended must be the primary significance of the word. Hence the inspired word, whichenters the hearts of the prophets and of the righteous, is called wa√y or revelation,because it is like a hasty suggestion made directly to the heart of the inspired one,ilqå-’un fi-l-rau‘i. It is in this sense that a revelation is spoken of as being granted to themother of Moses (28:7), and to the apostles of Jesus who were not prophets (5:111).(2) The second mode of Allåh’s speaking to His servants is that He speaks from behind aveil — a scene is shown as in a vision carrying deeper significance, or words are heard bythe person spoken to as from behind a veil. (3) The third form of revelation is that in whicha messenger — an angel — is chosen by the Almighty to deliver His message to the personto whom He wishes to speak. This is the highest form of revelation, and such is the revelation of the Qur’ån as granted to the Holy Prophet, being recited by Gabriel. This is calledwa√y matluww or revelation that is recited. This revelation is granted only to prophets,while the other two may also be granted to the righteous who are not raised to the dignity ofprophethood. It should, however, be borne in mind that in all these cases the recipient of therevelation is granted certain other senses. He sees what others do not see and he hearswords which others do not hear. It is, therefore, with what may be called the spiritual sensesthat he hears and sees and feels things which others do not hear, see, or feel.\n\n52a. Thus refers to the last mode of granting revelation, because the Holy Qur’ån isspoken of as having been brought by the Angel Gabriel (2:97) or the Faithful Spirit(26:193).\n\n52b. The use of the word r∂√ (“inspired Book”) as meaning inspiration, and not thesoul, is conclusive here. The Qur’ån is called the r∂√ or the spirit, because it gave life toa dead world. It is dead again, and again will life be breathed into it by the Qur’ån."
    }
  ]
}
