{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "حم",
      "verseStringB": "Beneficent God!"
    },
    {
      "verseNumber": 2,
      "verseString": "تَنْزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ",
      "verseStringB": "The revelation of the Book is from Allāh, the Mighty, the Wise."
    },
    {
      "verseNumber": 3,
      "verseString": "مَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ وَأَجَلٍ مُسَمًّى ۚ وَالَّذِينَ كَفَرُوا عَمَّا أُنْذِرُوا مُعْرِضُونَ",
      "verseStringB": "We created not the heavens and the earth and all between them save with truth and for an appointed term.ᵃ And those who disbelieve turn away from that whereof they are warned."
    },
    {
      "verseNumber": 4,
      "verseString": "قُلْ أَرَأَيْتُمْ مَا تَدْعُونَ مِنْ دُونِ اللَّهِ أَرُونِي مَاذَا خَلَقُوا مِنَ الْأَرْضِ أَمْ لَهُمْ شِرْكٌ فِي السَّمَاوَاتِ ۖ ائْتُونِي بِكِتَابٍ مِنْ قَبْلِ هَٰذَا أَوْ أَثَارَةٍ مِنْ عِلْمٍ إِنْ كُنْتُمْ صَادِقِينَ",
      "verseStringB": "Say: Have you considered that which you invoke besides Allāh? Show me what they have created of the earth, or have they a share in the heavens? Bring me a Book before this or any relics of knowledge, if you are truthful."
    },
    {
      "verseNumber": 5,
      "verseString": "وَمَنْ أَضَلُّ مِمَّنْ يَدْعُو مِنْ دُونِ اللَّهِ مَنْ لَا يَسْتَجِيبُ لَهُ إِلَىٰ يَوْمِ الْقِيَامَةِ وَهُمْ عَنْ دُعَائِهِمْ غَافِلُونَ",
      "verseStringB": "And who is in greater error than he who invokes besides Allāh such as answer him not till the day of Resurrection, and they are heedless of their call?"
    },
    {
      "verseNumber": 6,
      "verseString": "وَإِذَا حُشِرَ النَّاسُ كَانُوا لَهُمْ أَعْدَاءً وَكَانُوا بِعِبَادَتِهِمْ كَافِرِينَ",
      "verseStringB": "And when men are gathered together, they will be their enemies, and will deny their worshipping (them)."
    },
    {
      "verseNumber": 7,
      "verseString": "وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ قَالَ الَّذِينَ كَفَرُوا لِلْحَقِّ لَمَّا جَاءَهُمْ هَٰذَا سِحْرٌ مُبِينٌ",
      "verseStringB": "And when Our clear messages are recited to them, those who disbelieve say of the Truth when it comes to them: This is clear enchantment."
    },
    {
      "verseNumber": 8,
      "verseString": "أَمْ يَقُولُونَ افْتَرَاهُ ۖ قُلْ إِنِ افْتَرَيْتُهُ فَلَا تَمْلِكُونَ لِي مِنَ اللَّهِ شَيْئًا ۖ هُوَ أَعْلَمُ بِمَا تُفِيضُونَ فِيهِ ۖ كَفَىٰ بِهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ ۖ وَهُوَ الْغَفُورُ الرَّحِيمُ",
      "verseStringB": "Nay, they say: He has forged it. Say: If I have forged it, you control naught for me from Allāh.ᵃ He knows best what you utter concerning it. He is enough as a witness between me and you. And He is the Forgiving, the Merciful.ᵇ"
    },
    {
      "verseNumber": 9,
      "verseString": "قُلْ مَا كُنْتُ بِدْعًا مِنَ الرُّسُلِ وَمَا أَدْرِي مَا يُفْعَلُ بِي وَلَا بِكُمْ ۖ إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰ إِلَيَّ وَمَا أَنَا إِلَّا نَذِيرٌ مُبِينٌ",
      "verseStringB": "Say: I am not the first of the messengers,ᵃ and I know not what will be done with me or with you. I follow naught but that which is revealed to me, and I am but a plain warner.ᵇ"
    },
    {
      "verseNumber": 10,
      "verseString": "قُلْ أَرَأَيْتُمْ إِنْ كَانَ مِنْ عِنْدِ اللَّهِ وَكَفَرْتُمْ بِهِ وَشَهِدَ شَاهِدٌ مِنْ بَنِي إِسْرَائِيلَ عَلَىٰ مِثْلِهِ فَآمَنَ وَاسْتَكْبَرْتُمْ ۖ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ",
      "verseStringB": "Say: See you if it is from Allāh, and you disbelieve in it, and a witness from among the Children of Israel has borne witness of one like him,ᵃ so he believed, while you are big with pride. Surely Allāh guides not the iniquitous people."
    },
    {
      "verseNumber": 11,
      "verseString": "وَقَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا لَوْ كَانَ خَيْرًا مَا سَبَقُونَا إِلَيْهِ ۚ وَإِذْ لَمْ يَهْتَدُوا بِهِ فَسَيَقُولُونَ هَٰذَا إِفْكٌ قَدِيمٌ",
      "verseStringB": "And those who disbelieve say of those who believe: If it had been a good, they would not have attained it before us. And as they are not guided thereby, they say: It is an old lie."
    },
    {
      "verseNumber": 12,
      "verseString": "وَمِنْ قَبْلِهِ كِتَابُ مُوسَىٰ إِمَامًا وَرَحْمَةً ۚ وَهَٰذَا كِتَابٌ مُصَدِّقٌ لِسَانًا عَرَبِيًّا لِيُنْذِرَ الَّذِينَ ظَلَمُوا وَبُشْرَىٰ لِلْمُحْسِنِينَ",
      "verseStringB": "And before it was the Book of Moses, a guide and a mercy. And this is a Book verifying (it) in the Arabic language,ᵃ that it may warn those who do wrong, and as good news for the doers of good."
    },
    {
      "verseNumber": 13,
      "verseString": "إِنَّ الَّذِينَ قَالُوا رَبُّنَا اللَّهُ ثُمَّ اسْتَقَامُوا فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "verseStringB": "Surely those who say, Our Lord is Allāh, then continue on the right way, on them is no fear, nor shall they grieve."
    },
    {
      "verseNumber": 14,
      "verseString": "أُولَٰئِكَ أَصْحَابُ الْجَنَّةِ خَالِدِينَ فِيهَا جَزَاءً بِمَا كَانُوا يَعْمَلُونَ",
      "verseStringB": "These are the owners of the Garden, abiding therein — a reward for what they did."
    },
    {
      "verseNumber": 15,
      "verseString": "وَوَصَّيْنَا الْإِنْسَانَ بِوَالِدَيْهِ إِحْسَانًا ۖ حَمَلَتْهُ أُمُّهُ كُرْهًا وَوَضَعَتْهُ كُرْهًا ۖ وَحَمْلُهُ وَفِصَالُهُ ثَلَاثُونَ شَهْرًا ۚ حَتَّىٰ إِذَا بَلَغَ أَشُدَّهُ وَبَلَغَ أَرْبَعِينَ سَنَةً قَالَ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي ۖ إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ",
      "verseStringB": "And We have enjoined on man the doing of good to his parents. His mother bears him with trouble and she brings him forth in pain. And the bearing of him and the weaning of him is thirty months. Till, when he attains his maturity and reaches forty years,ᵃ he says: My Lord, grant me that I may give thanks for Thy favour, which Thou hast bestowed on me and on my parents, and that I may do good which pleases Thee; and be good to me in respect of my offspring. Truly I turn to Thee, and truly I am of those who submit."
    },
    {
      "verseNumber": 16,
      "verseString": "أُولَٰئِكَ الَّذِينَ نَتَقَبَّلُ عَنْهُمْ أَحْسَنَ مَا عَمِلُوا وَنَتَجَاوَزُ عَنْ سَيِّئَاتِهِمْ فِي أَصْحَابِ الْجَنَّةِ ۖ وَعْدَ الصِّدْقِ الَّذِي كَانُوا يُوعَدُونَ",
      "verseStringB": "These are they from whom We accept the best of what they do and pass by their evil deeds — among the owners of the Garden. A promise of truth, which they were promised."
    },
    {
      "verseNumber": 17,
      "verseString": "وَالَّذِي قَالَ لِوَالِدَيْهِ أُفٍّ لَكُمَا أَتَعِدَانِنِي أَنْ أُخْرَجَ وَقَدْ خَلَتِ الْقُرُونُ مِنْ قَبْلِي وَهُمَا يَسْتَغِيثَانِ اللَّهَ وَيْلَكَ آمِنْ إِنَّ وَعْدَ اللَّهِ حَقٌّ فَيَقُولُ مَا هَٰذَا إِلَّا أَسَاطِيرُ الْأَوَّلِينَ",
      "verseStringB": "And he who says to his parents: Fie on you! Do you threaten me that I shall be brought forth, when generations have passed away before me? And they both call for Allāh’s aid: Woe to thee! Believe; surely the promise of Allāh is true. But he says: This is nothing but stories of the ancients."
    },
    {
      "verseNumber": 18,
      "verseString": "أُولَٰئِكَ الَّذِينَ حَقَّ عَلَيْهِمُ الْقَوْلُ فِي أُمَمٍ قَدْ خَلَتْ مِنْ قَبْلِهِمْ مِنَ الْجِنِّ وَالْإِنْسِ ۖ إِنَّهُمْ كَانُوا خَاسِرِينَ",
      "verseStringB": "These are they against whom the word proves true, among nations of the jinn and the men that have passed away before them. Surely they are losers."
    },
    {
      "verseNumber": 19,
      "verseString": "وَلِكُلٍّ دَرَجَاتٌ مِمَّا عَمِلُوا ۖ وَلِيُوَفِّيَهُمْ أَعْمَالَهُمْ وَهُمْ لَا يُظْلَمُونَ",
      "verseStringB": "And for all are degrees according to what they do, and that He may pay them for their deeds and they will not be wronged."
    },
    {
      "verseNumber": 20,
      "verseString": "وَيَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى النَّارِ أَذْهَبْتُمْ طَيِّبَاتِكُمْ فِي حَيَاتِكُمُ الدُّنْيَا وَاسْتَمْتَعْتُمْ بِهَا فَالْيَوْمَ تُجْزَوْنَ عَذَابَ الْهُونِ بِمَا كُنْتُمْ تَسْتَكْبِرُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَبِمَا كُنْتُمْ تَفْسُقُونَ",
      "verseStringB": "And on the day when those who disbelieve are brought before the Fire: You did away with your good things in your life of the world and you enjoyed them; so this day you are rewarded with the chastisement of abasement because you were unjustly proud in the land and because you transgressed."
    },
    {
      "verseNumber": 21,
      "verseString": "وَاذْكُرْ أَخَا عَادٍ إِذْ أَنْذَرَ قَوْمَهُ بِالْأَحْقَافِ وَقَدْ خَلَتِ النُّذُرُ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ أَلَّا تَعْبُدُوا إِلَّا اللَّهَ إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ",
      "verseStringB": "And mention the brother of ‘ād; when he warned his people in the sandy plains a — and warners indeed came before him and after him — saying: Serve none but Allāh. Surely I fear for you the chastisement of a grievous day."
    },
    {
      "verseNumber": 22,
      "verseString": "قَالُوا أَجِئْتَنَا لِتَأْفِكَنَا عَنْ آلِهَتِنَا فَأْتِنَا بِمَا تَعِدُنَا إِنْ كُنْتَ مِنَ الصَّادِقِينَ",
      "verseStringB": "They said: Hast thou come to us to turn us away from our gods? Then bring us that with which thou threatenest us, if thou art truthful."
    },
    {
      "verseNumber": 23,
      "verseString": "قَالَ إِنَّمَا الْعِلْمُ عِنْدَ اللَّهِ وَأُبَلِّغُكُمْ مَا أُرْسِلْتُ بِهِ وَلَٰكِنِّي أَرَاكُمْ قَوْمًا تَجْهَلُونَ",
      "verseStringB": "He said: The knowledge is only with Allāh, and I deliver to you that wherewith I am sent, but I see you are an ignorant people."
    },
    {
      "verseNumber": 24,
      "verseString": "فَلَمَّا رَأَوْهُ عَارِضًا مُسْتَقْبِلَ أَوْدِيَتِهِمْ قَالُوا هَٰذَا عَارِضٌ مُمْطِرُنَا ۚ بَلْ هُوَ مَا اسْتَعْجَلْتُمْ بِهِ ۖ رِيحٌ فِيهَا عَذَابٌ أَلِيمٌ",
      "verseStringB": "So when they saw it — a cloud advancing towards their valleys, they said: This is a cloud bringing us rain. Nay, it is that which you sought to hasten, a wind wherein is painful chastisement,"
    },
    {
      "verseNumber": 25,
      "verseString": "تُدَمِّرُ كُلَّ شَيْءٍ بِأَمْرِ رَبِّهَا فَأَصْبَحُوا لَا يُرَىٰ إِلَّا مَسَاكِنُهُمْ ۚ كَذَٰلِكَ نَجْزِي الْقَوْمَ الْمُجْرِمِينَ",
      "verseStringB": "Destroying everything by the command of its Lord. So at dawn naught could be seen except their dwellings. Thus do We reward the guilty people."
    },
    {
      "verseNumber": 26,
      "verseString": "وَلَقَدْ مَكَّنَّاهُمْ فِيمَا إِنْ مَكَّنَّاكُمْ فِيهِ وَجَعَلْنَا لَهُمْ سَمْعًا وَأَبْصَارًا وَأَفْئِدَةً فَمَا أَغْنَىٰ عَنْهُمْ سَمْعُهُمْ وَلَا أَبْصَارُهُمْ وَلَا أَفْئِدَتُهُمْ مِنْ شَيْءٍ إِذْ كَانُوا يَجْحَدُونَ بِآيَاتِ اللَّهِ وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ",
      "verseStringB": "And certainly We had given them power in matters in which We have not empowered you, and We had given them ears and eyes and hearts, but neither their ears, nor their eyes, nor their hearts availed them aught, since they denied the messages of Allāh, and that which they mocked at encompassed them."
    },
    {
      "verseNumber": 27,
      "verseString": "وَلَقَدْ أَهْلَكْنَا مَا حَوْلَكُمْ مِنَ الْقُرَىٰ وَصَرَّفْنَا الْآيَاتِ لَعَلَّهُمْ يَرْجِعُونَ",
      "verseStringB": "And certainly We destroyed the towns round about you,ᵃ and We repeat the messages that they may turn."
    },
    {
      "verseNumber": 28,
      "verseString": "فَلَوْلَا نَصَرَهُمُ الَّذِينَ اتَّخَذُوا مِنْ دُونِ اللَّهِ قُرْبَانًا آلِهَةً ۖ بَلْ ضَلُّوا عَنْهُمْ ۚ وَذَٰلِكَ إِفْكُهُمْ وَمَا كَانُوا يَفْتَرُونَ",
      "verseStringB": "Then why did those whom they took for gods besides Allāh to draw (them) nigh (to Him) not help them? Nay, they failed them. And this was their lie and what they forged."
    },
    {
      "verseNumber": 29,
      "verseString": "وَإِذْ صَرَفْنَا إِلَيْكَ نَفَرًا مِنَ الْجِنِّ يَسْتَمِعُونَ الْقُرْآنَ فَلَمَّا حَضَرُوهُ قَالُوا أَنْصِتُوا ۖ فَلَمَّا قُضِيَ وَلَّوْا إِلَىٰ قَوْمِهِمْ مُنْذِرِينَ",
      "verseStringB": "And when We turned towards thee a party of the jinn,ᵃ who listened to the Qur’ān; so when they were in its presence, they said: Be silent. Then when it was finished, they turned back to their people warning (them)."
    },
    {
      "verseNumber": 30,
      "verseString": "قَالُوا يَا قَوْمَنَا إِنَّا سَمِعْنَا كِتَابًا أُنْزِلَ مِنْ بَعْدِ مُوسَىٰ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ يَهْدِي إِلَى الْحَقِّ وَإِلَىٰ طَرِيقٍ مُسْتَقِيمٍ",
      "verseStringB": "They said: O our people, we have heard a Book revealed after Moses, verifying that which is before it, guiding to the truth and to a right path."
    },
    {
      "verseNumber": 31,
      "verseString": "يَا قَوْمَنَا أَجِيبُوا دَاعِيَ اللَّهِ وَآمِنُوا بِهِ يَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُجِرْكُمْ مِنْ عَذَابٍ أَلِيمٍ",
      "verseStringB": "O our people, accept the Inviter to Allāh and believe in Him. He will forgive you some of your sins and protect you from a painful chastisement."
    },
    {
      "verseNumber": 32,
      "verseString": "وَمَنْ لَا يُجِبْ دَاعِيَ اللَّهِ فَلَيْسَ بِمُعْجِزٍ فِي الْأَرْضِ وَلَيْسَ لَهُ مِنْ دُونِهِ أَوْلِيَاءُ ۚ أُولَٰئِكَ فِي ضَلَالٍ مُبِينٍ",
      "verseStringB": "And whoever accepts not the Inviter to Allāh, he cannot escape in the earth, nor has he protectors besides Him. These are in manifest error."
    },
    {
      "verseNumber": 33,
      "verseString": "أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَلَمْ يَعْيَ بِخَلْقِهِنَّ بِقَادِرٍ عَلَىٰ أَنْ يُحْيِيَ الْمَوْتَىٰ ۚ بَلَىٰ إِنَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "See they not that Allāh, Who created the heavens and the earth and was not tired by their creation, is able to give life to the dead? Aye, He is surely Possessor of power over all things."
    },
    {
      "verseNumber": 34,
      "verseString": "وَيَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى النَّارِ أَلَيْسَ هَٰذَا بِالْحَقِّ ۖ قَالُوا بَلَىٰ وَرَبِّنَا ۚ قَالَ فَذُوقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُونَ",
      "verseStringB": "And on the day when those who disbelieve are brought before the Fire: Is it not true? They will say: Yea, by our Lord! He will say: Then taste the chastisement, because you disbelieved."
    },
    {
      "verseNumber": 35,
      "verseString": "فَاصْبِرْ كَمَا صَبَرَ أُولُو الْعَزْمِ مِنَ الرُّسُلِ وَلَا تَسْتَعْجِلْ لَهُمْ ۚ كَأَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوعَدُونَ لَمْ يَلْبَثُوا إِلَّا سَاعَةً مِنْ نَهَارٍ ۚ بَلَاغٌ ۚ فَهَلْ يُهْلَكُ إِلَّا الْقَوْمُ الْفَاسِقُونَ",
      "verseStringB": "So have patience, as men of resolution, the messengers, had patience, and seek not to hasten on for them (their doom). On the day when they see that which they are promised, (it will be) as if they had not tarried save an hour of the day. (Thine is) to deliver. Shall then any be destroyed save the transgressing people?"
    }
  ],
  "nameEnglish": "The Dunes",
  "nameTrans": "al-Ahqaf",
  "nameArabic": "الأحقاف",
  "chapterNumber": 46,
  "nVerses": 35,
  "footnotes": [
    {
      "note": "3a. The Universe had a beginning and it will also have an end.\n\n8a. From Allåh here means from the punishment of Allåh. If the Qur’ån was a lie whichthe Prophet had forged, none could avert the punishment which must come upon a forger.\n\n8b. It is noteworthy that, whenever the punishment of the opponents is alluded to, asin the statement He is enough as a witness between me and you, the Divine attribute ofmercy and forgiveness is also mentioned to indicate that mercy always predominates inthe Divine nature.\n\n9a. Bid‘ signifies a novelty, or a thing existing for the first time (LL). And you saysuch a one is bid‘ in this affair when he is the first who has done it (LL). Prophets hadappeared before the Holy Prophet Mu√ammad in every country and nation throughoutthe whole world, and God’s sending messengers for the reformation of men was the universal experience of humanity.\n\n9b. The Prophet is made to deny any detailed knowledge as to the ultimate end ofone or the other party, but the warning is reaffirmed in the concluding words to showthat evildoers must suffer the evil consequences of their deeds. I know not, therefore,simply signifies that he did not know the details.\n\n10a. The witness from among the Children of Israel, who bore witness of one likehim is Moses: “I will raise them up a Prophet from among their brethren, like untothee.... And it shall come to pass that whosoever will not hearken unto My words, whichhe shall speak in My name, I will require it of him” (Deut. 18:18, 19). It is to the concluding statement in the above quotation that attention is called in the words, see you ifit is from Allåh, and you disbelieve in it.\n\n12a. The words refer to the subject-matter of v. 10, which speaks of Moses’ prophecy. The Qur’ån is here declared as fulfilling that prophecy, and the reference to its beingin the Arabic language signifies the coming of the Prophet from among the Ishmaelites,who spoke that language, and who were the brethren of the Israelites, this fact beingclearly mentioned in the prophecy of Deut. 18:18.\n\n15a. It would appear from this that the spiritual maturity of man usually takes place atthe age of forty. Evidence of this is also found in the fact that the Holy Prophet Mu√ammadreceived the Divine message for the regeneration of mankind at the age of forty.\n\n21a. The brother of a people signifies their prophet, H∂d being the prophet sent to‘Åd. A√qåf is plural of √iqf, which signifies a heap or hill of sand that has assumed abowed form, and al-a√qåf applies, particularly to certain oblong tracts of sand in theregion of Esh-Shihr (LL). Rodwell and Muir locate the ‘Ådites in the country roundabout Ôå’if; others in Ïa˙ramaut. The latter opinion is the correct one, as maps ofArabia plainly show Al-A√qåf to be situated in Ïa˙ramaut.\n\n27a. The cities of ‘Åd, Tham∂d and Sheba lay on the borders of Arabia; thus thepeople living in the metropolis are told how those living around them were aforetimedestroyed, and they should take a lesson from their fate.\n\n29a. The jinn spoken of here seem to be the leaders of certain Jewish tribes, becausethey are spoken of in the next verse as believers in Moses. In fact, they are of the sameclass as those spoken of in 72:1; see 72:1a."
    }
  ]
}
