{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ أَضَلَّ أَعْمَالَهُمْ",
      "verseStringB": "Those who disbelieve and turn (men) from Allāh’s way, He will destroy their works.ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَآمَنُوا بِمَا نُزِّلَ عَلَىٰ مُحَمَّدٍ وَهُوَ الْحَقُّ مِنْ رَبِّهِمْ ۙ كَفَّرَ عَنْهُمْ سَيِّئَاتِهِمْ وَأَصْلَحَ بَالَهُمْ",
      "verseStringB": "And those who believe and do good, and believe in that which has been revealed to Muƒammad — and it is the Truth from their Lord — He will remove their evil from them and improve their condition.ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "ذَٰلِكَ بِأَنَّ الَّذِينَ كَفَرُوا اتَّبَعُوا الْبَاطِلَ وَأَنَّ الَّذِينَ آمَنُوا اتَّبَعُوا الْحَقَّ مِنْ رَبِّهِمْ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ لِلنَّاسِ أَمْثَالَهُمْ",
      "verseStringB": "That is because those who disbelieve follow falsehood, and those who believe follow the Truth from their Lord. Thus does Allāh set forth their descriptions for men.ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "فَإِذَا لَقِيتُمُ الَّذِينَ كَفَرُوا فَضَرْبَ الرِّقَابِ حَتَّىٰ إِذَا أَثْخَنْتُمُوهُمْ فَشُدُّوا الْوَثَاقَ فَإِمَّا مَنًّا بَعْدُ وَإِمَّا فِدَاءً حَتَّىٰ تَضَعَ الْحَرْبُ أَوْزَارَهَا ۚ ذَٰلِكَ وَلَوْ يَشَاءُ اللَّهُ لَانْتَصَرَ مِنْهُمْ وَلَٰكِنْ لِيَبْلُوَ بَعْضَكُمْ بِبَعْضٍ ۗ وَالَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ فَلَنْ يُضِلَّ أَعْمَالَهُمْ",
      "verseStringB": "So when you meet in battle those who disbelieve, smite the necks; then, when you have overcome them, make (them) prisoners, and afterwards (set them free) as a favour or for ransom till the war lay down its burdens.ᵃ That (shall be so). And if Allāh please, He would certainly exact retribution from them, but that He may try some of you by means of others.ᵇ And those who are slain in the way of Allāh, He will never allow their deeds to perish."
    },
    {
      "verseNumber": 5,
      "verseString": "سَيَهْدِيهِمْ وَيُصْلِحُ بَالَهُمْ",
      "verseStringB": "He will guide them and improve their condition."
    },
    {
      "verseNumber": 6,
      "verseString": "وَيُدْخِلُهُمُ الْجَنَّةَ عَرَّفَهَا لَهُمْ",
      "verseStringB": "And make them enter the Garden, which He has made known to them.ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِنْ تَنْصُرُوا اللَّهَ يَنْصُرْكُمْ وَيُثَبِّتْ أَقْدَامَكُمْ",
      "verseStringB": "O you who believe, if you help Allāh, He will help you and make firm your feet."
    },
    {
      "verseNumber": 8,
      "verseString": "وَالَّذِينَ كَفَرُوا فَتَعْسًا لَهُمْ وَأَضَلَّ أَعْمَالَهُمْ",
      "verseStringB": "And those who disbelieve, for them is destruction, and He will destroy their works."
    },
    {
      "verseNumber": 9,
      "verseString": "ذَٰلِكَ بِأَنَّهُمْ كَرِهُوا مَا أَنْزَلَ اللَّهُ فَأَحْبَطَ أَعْمَالَهُمْ",
      "verseStringB": "That is because they hate that which Allāh reveals, so He has rendered their deeds fruitless."
    },
    {
      "verseNumber": 10,
      "verseString": "أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِنْ قَبْلِهِمْ ۚ دَمَّرَ اللَّهُ عَلَيْهِمْ ۖ وَلِلْكَافِرِينَ أَمْثَالُهَا",
      "verseStringB": "Have they not travelled in the land and seen what was the end of those before them? Allāh destroyed them. And for the disbelievers is the like thereof."
    },
    {
      "verseNumber": 11,
      "verseString": "ذَٰلِكَ بِأَنَّ اللَّهَ مَوْلَى الَّذِينَ آمَنُوا وَأَنَّ الْكَافِرِينَ لَا مَوْلَىٰ لَهُمْ",
      "verseStringB": "That is because Allāh is the Patron of those who believe, and because the disbelievers have no patron."
    },
    {
      "verseNumber": 12,
      "verseString": "إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۖ وَالَّذِينَ كَفَرُوا يَتَمَتَّعُونَ وَيَأْكُلُونَ كَمَا تَأْكُلُ الْأَنْعَامُ وَالنَّارُ مَثْوًى لَهُمْ",
      "verseStringB": "Surely Allāh will make those who believe and do good enter Gardens wherein flow rivers. And those who disbelieve enjoy themselves and eat as the cattle eat, and the Fire is their abode."
    },
    {
      "verseNumber": 13,
      "verseString": "وَكَأَيِّنْ مِنْ قَرْيَةٍ هِيَ أَشَدُّ قُوَّةً مِنْ قَرْيَتِكَ الَّتِي أَخْرَجَتْكَ أَهْلَكْنَاهُمْ فَلَا نَاصِرَ لَهُمْ",
      "verseStringB": "And how many a town, more powerful than thy town which has driven thee out — We destroyed them, so there was no helper for them.ᵃ"
    },
    {
      "verseNumber": 14,
      "verseString": "أَفَمَنْ كَانَ عَلَىٰ بَيِّنَةٍ مِنْ رَبِّهِ كَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ وَاتَّبَعُوا أَهْوَاءَهُمْ",
      "verseStringB": "Is then he who has a clear argument from his Lord like him to whom his evil conduct is made fair-seeming; and they follow their low desires."
    },
    {
      "verseNumber": 15,
      "verseString": "مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ ۖ فِيهَا أَنْهَارٌ مِنْ مَاءٍ غَيْرِ آسِنٍ وَأَنْهَارٌ مِنْ لَبَنٍ لَمْ يَتَغَيَّرْ طَعْمُهُ وَأَنْهَارٌ مِنْ خَمْرٍ لَذَّةٍ لِلشَّارِبِينَ وَأَنْهَارٌ مِنْ عَسَلٍ مُصَفًّى ۖ وَلَهُمْ فِيهَا مِنْ كُلِّ الثَّمَرَاتِ وَمَغْفِرَةٌ مِنْ رَبِّهِمْ ۖ كَمَنْ هُوَ خَالِدٌ فِي النَّارِ وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أَمْعَاءَهُمْ",
      "verseStringB": "A parable of the Garden which the dutiful are promised: Therein are rivers of water not altering for the worse, and rivers of milk whereof the taste changes not, and rivers of wine delicious to the drinkers, and rivers of honey clarified;ᵃ and for them therein are all fruits and protection from their Lord.ᵇ (Are these) like those who abide in the Fire and who are made to drink boiling water, so it rends their bowels asunder?"
    },
    {
      "verseNumber": 16,
      "verseString": "وَمِنْهُمْ مَنْ يَسْتَمِعُ إِلَيْكَ حَتَّىٰ إِذَا خَرَجُوا مِنْ عِنْدِكَ قَالُوا لِلَّذِينَ أُوتُوا الْعِلْمَ مَاذَا قَالَ آنِفًا ۚ أُولَٰئِكَ الَّذِينَ طَبَعَ اللَّهُ عَلَىٰ قُلُوبِهِمْ وَاتَّبَعُوا أَهْوَاءَهُمْ",
      "verseStringB": "And there are those of them who seek to listen to thee, till, when they go forth from thee, they say to those who have been given knowledge: What was it that he said just now? These are they whose hearts Allāh has sealed and they follow their low desires."
    },
    {
      "verseNumber": 17,
      "verseString": "وَالَّذِينَ اهْتَدَوْا زَادَهُمْ هُدًى وَآتَاهُمْ تَقْوَاهُمْ",
      "verseStringB": "And those who follow guidance, He increases them in guidance and grants them their observance of duty."
    },
    {
      "verseNumber": 18,
      "verseString": "فَهَلْ يَنْظُرُونَ إِلَّا السَّاعَةَ أَنْ تَأْتِيَهُمْ بَغْتَةً ۖ فَقَدْ جَاءَ أَشْرَاطُهَا ۚ فَأَنَّىٰ لَهُمْ إِذَا جَاءَتْهُمْ ذِكْرَاهُمْ",
      "verseStringB": "Wait they for aught but the Hour that it should come upon them of a sudden? Now tokens thereof have already come.ᵃ But how will they have their reminder, when it comes on them?"
    },
    {
      "verseNumber": 19,
      "verseString": "فَاعْلَمْ أَنَّهُ لَا إِلَٰهَ إِلَّا اللَّهُ وَاسْتَغْفِرْ لِذَنْبِكَ وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ۗ وَاللَّهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْوَاكُمْ",
      "verseStringB": "So know that there is no god but Allāh and ask protection for thy sin and for the believing men and the believing women.ᵃ And Allāh knows your moving about and your staying (in a place).ᵇ"
    },
    {
      "verseNumber": 20,
      "verseString": "وَيَقُولُ الَّذِينَ آمَنُوا لَوْلَا نُزِّلَتْ سُورَةٌ ۖ فَإِذَا أُنْزِلَتْ سُورَةٌ مُحْكَمَةٌ وَذُكِرَ فِيهَا الْقِتَالُ ۙ رَأَيْتَ الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ يَنْظُرُونَ إِلَيْكَ نَظَرَ الْمَغْشِيِّ عَلَيْهِ مِنَ الْمَوْتِ ۖ فَأَوْلَىٰ لَهُمْ",
      "verseStringB": "And those who believe say: Why is not a chapter revealed?ᵃ But when a decisive chapter is revealed, and fighting is mentioned therein, thou seest those in whose hearts is a disease look to thee with the look of one fainting at death. So woe to them!"
    },
    {
      "verseNumber": 21,
      "verseString": "طَاعَةٌ وَقَوْلٌ مَعْرُوفٌ ۚ فَإِذَا عَزَمَ الْأَمْرُ فَلَوْ صَدَقُوا اللَّهَ لَكَانَ خَيْرًا لَهُمْ",
      "verseStringB": "Obedience and a gentle word (was proper). Then when the affair is settled, it is better for them if they remain true to Allāh."
    },
    {
      "verseNumber": 22,
      "verseString": "فَهَلْ عَسَيْتُمْ إِنْ تَوَلَّيْتُمْ أَنْ تُفْسِدُوا فِي الْأَرْضِ وَتُقَطِّعُوا أَرْحَامَكُمْ",
      "verseStringB": "But if you turn away, you are sure to make mischief in the land and cut off the ties of kinship!ᵃ"
    },
    {
      "verseNumber": 23,
      "verseString": "أُولَٰئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ فَأَصَمَّهُمْ وَأَعْمَىٰ أَبْصَارَهُمْ",
      "verseStringB": "Those it is whom Allāh has cursed, so He has made them deaf and blinded their eyes.ᵃ"
    },
    {
      "verseNumber": 24,
      "verseString": "أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ أَمْ عَلَىٰ قُلُوبٍ أَقْفَالُهَا",
      "verseStringB": "Do they not reflect on the Qur’ān? Or, are there locks on the hearts?"
    },
    {
      "verseNumber": 25,
      "verseString": "إِنَّ الَّذِينَ ارْتَدُّوا عَلَىٰ أَدْبَارِهِمْ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَى ۙ الشَّيْطَانُ سَوَّلَ لَهُمْ وَأَمْلَىٰ لَهُمْ",
      "verseStringB": "Surely those who turn back after guidance is manifest to them, the devil embellishes it for them; and lengthens false hopes for them."
    },
    {
      "verseNumber": 26,
      "verseString": "ذَٰلِكَ بِأَنَّهُمْ قَالُوا لِلَّذِينَ كَرِهُوا مَا نَزَّلَ اللَّهُ سَنُطِيعُكُمْ فِي بَعْضِ الْأَمْرِ ۖ وَاللَّهُ يَعْلَمُ إِسْرَارَهُمْ",
      "verseStringB": "That is because they say to those who hate what Allāh has revealed: We will obey you in some matters. And Allāh knows their secrets."
    },
    {
      "verseNumber": 27,
      "verseString": "فَكَيْفَ إِذَا تَوَفَّتْهُمُ الْمَلَائِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ",
      "verseStringB": "But how will it be when the angels cause them to die, smiting their faces and their backs?"
    },
    {
      "verseNumber": 28,
      "verseString": "ذَٰلِكَ بِأَنَّهُمُ اتَّبَعُوا مَا أَسْخَطَ اللَّهَ وَكَرِهُوا رِضْوَانَهُ فَأَحْبَطَ أَعْمَالَهُمْ",
      "verseStringB": "That is because they follow that which displeases Allāh and are averse to His pleasure, so He makes their deeds fruitless."
    },
    {
      "verseNumber": 29,
      "verseString": "أَمْ حَسِبَ الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ أَنْ لَنْ يُخْرِجَ اللَّهُ أَضْغَانَهُمْ",
      "verseStringB": "Or do those in whose hearts is a disease think that Allāh will not bring forth their spite?"
    },
    {
      "verseNumber": 30,
      "verseString": "وَلَوْ نَشَاءُ لَأَرَيْنَاكَهُمْ فَلَعَرَفْتَهُمْ بِسِيمَاهُمْ ۚ وَلَتَعْرِفَنَّهُمْ فِي لَحْنِ الْقَوْلِ ۚ وَاللَّهُ يَعْلَمُ أَعْمَالَكُمْ",
      "verseStringB": "And if We please, We could show them to thee so that thou shouldst know them by their marks. And certainly thou canst recognize them by the tone of (their) speech. And Allāh knows your deeds."
    },
    {
      "verseNumber": 31,
      "verseString": "وَلَنَبْلُوَنَّكُمْ حَتَّىٰ نَعْلَمَ الْمُجَاهِدِينَ مِنْكُمْ وَالصَّابِرِينَ وَنَبْلُوَ أَخْبَارَكُمْ",
      "verseStringB": "And certainly We shall try you, till We know those among you who strive hard, and the steadfast, and manifest your news."
    },
    {
      "verseNumber": 32,
      "verseString": "إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ وَشَاقُّوا الرَّسُولَ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَىٰ لَنْ يَضُرُّوا اللَّهَ شَيْئًا وَسَيُحْبِطُ أَعْمَالَهُمْ",
      "verseStringB": "Surely those who disbelieve and hinder (men) from Allāh’s way and oppose the Messenger after guidance is quite clear to them, cannot harm Allāh in any way, and He will make their deeds fruitless."
    },
    {
      "verseNumber": 33,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَلَا تُبْطِلُوا أَعْمَالَكُمْ",
      "verseStringB": "O you who believe, obey Allāh and obey the Messenger and make not your deeds vain."
    },
    {
      "verseNumber": 34,
      "verseString": "إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ ثُمَّ مَاتُوا وَهُمْ كُفَّارٌ فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ",
      "verseStringB": "Surely those who disbelieve and hinder (men) from Allāh’s way, then die disbelievers, Allāh will not forgive them."
    },
    {
      "verseNumber": 35,
      "verseString": "فَلَا تَهِنُوا وَتَدْعُوا إِلَى السَّلْمِ وَأَنْتُمُ الْأَعْلَوْنَ وَاللَّهُ مَعَكُمْ وَلَنْ يَتِرَكُمْ أَعْمَالَكُمْ",
      "verseStringB": "And be not slack so as to cry for peace — and you are the uppermost — and Allāh is with you, and He will not bring your deeds to naught."
    },
    {
      "verseNumber": 36,
      "verseString": "إِنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ ۚ وَإِنْ تُؤْمِنُوا وَتَتَّقُوا يُؤْتِكُمْ أُجُورَكُمْ وَلَا يَسْأَلْكُمْ أَمْوَالَكُمْ",
      "verseStringB": "The life of this world is but idle sport and play, and, if you believe and keep your duty, He will give you your reward, and He does not ask of you your wealth."
    },
    {
      "verseNumber": 37,
      "verseString": "إِنْ يَسْأَلْكُمُوهَا فَيُحْفِكُمْ تَبْخَلُوا وَيُخْرِجْ أَضْغَانَكُمْ",
      "verseStringB": "If He should ask you for it and press you, you will be niggardly,ᵃ and He will bring forth your malice."
    },
    {
      "verseNumber": 38,
      "verseString": "هَا أَنْتُمْ هَٰؤُلَاءِ تُدْعَوْنَ لِتُنْفِقُوا فِي سَبِيلِ اللَّهِ فَمِنْكُمْ مَنْ يَبْخَلُ ۖ وَمَنْ يَبْخَلْ فَإِنَّمَا يَبْخَلُ عَنْ نَفْسِهِ ۚ وَاللَّهُ الْغَنِيُّ وَأَنْتُمُ الْفُقَرَاءُ ۚ وَإِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ ثُمَّ لَا يَكُونُوا أَمْثَالَكُمْ",
      "verseStringB": "Behold! you are those who are called to spend in Allāh’s way, but among you are those who are niggardly; and whoever is niggardly, is niggardly against his own soul. And Allāh is Self-Sufficient and you are needy. And if you turn back He will bring in your place another people, then they will not be like you."
    }
  ],
  "nameEnglish": "Muhammad",
  "nameTrans": "Muhammad",
  "nameArabic": "محمـد",
  "chapterNumber": 47,
  "nVerses": 38,
  "footnotes": [
    {
      "note": "1a. A˙alla-h∂ is synonymous with ahlaka-h∂ or a˙å‘a-h∂ (T, LL), the first meaninghe destroyed him or caused him to perish, and the second he wasted it or made it ineffective. The significance is that their endeavours to uproot Truth will be brought to naught.This chapter was revealed at a time when the enemies of Islåm were at the height oftheir power, and had apparently uprooted Islåm from Makkah, and were preparing togive it a death-blow at Madßnah.\n\n2a. This is another prophecy, a counterpart of the one contained in the previousverse. The Muslims, whose condition, it is announced here, will be bettered, were in amost helpless condition at the time. The majority of them had just fled from their homes,almost penniless, to save their lives and to settle down at Madßnah where, however, theywere not left alone, the enemy being determined to crush them by force.\n\n3a. Amthål is the plural of mathal, which means a description, condition, state or case,or a description by way of comparison, i.e., a parable (LL). V. 1 tells us of the condition ofthose who tried to uproot Truth, stating that their endeavours will be brought to naught,while v. 2 speaks of those who accept the Truth and states that their material as well asmoral condition will be bettered. These are the conditions or descriptions referred to in v. 3.\n\n4a. The word athkhana occurring in this passage has been fully explained in 8:67a.This passage mentions the only case in which prisoners of war can be taken, and thuscondemns the practice of slavery, according to which men could be seized anywhere andsold into slavery. Here we are told that prisoners of war can only be taken after meeting anenemy in regular battle, and even in that case they must be set free, either as a favour orafter taking ransom. It was the former of these alternatives that the Holy Prophet adoptedin most cases; for instance, in the case of the prisoners of the Banß Mu©Δaliq, in which ahundred families were set at liberty, and in the case of Hawåzin, in which fully six thousand prisoners of war were released merely as an act of favour. Only in the case of the seventy prisoners taken at Badr is there mention of redemption having been taken, but thiswas when Islåm was very weak and the powerful enemy was determined to crush it.\n\n4b. Inta©ara min-hu signifies he exacted retribution from him (LA), or he exactedhis due completely from him (T-LL). The meaning is that, if Allåh had pleased, He couldhave punished the enemies of Islåm otherwise than by war, but as He means to punishthem by the hands of the Muslims, therefore battles must be fought.\n\n6a. The Garden of the next life is made known to the righteous in this life by making them taste of the spiritual blessings of good deeds in this very life. That a paradise isgranted to the righteous in this very life is mentioned frequently in the Holy Qur’ån. Itshould be noted, however, as stated elsewhere, too, that triumph over those who wouldannihilate Truth is also spoken of as a garden in this life.\n\n13a. The town which had driven away the Holy Prophet was Makkah, and the overthrow of its power is here foretold in the clearest words. It will be seen that the Makkanswere not destroyed when their final overthrow came, nor did the Holy Prophet punishthem for their crimes and tyrannies against the Muslims. They were dealt with very mercifully — so mercifully indeed that the history of the world does not present anotherinstance of such merciful treatment of a conquered nation of oppressors. By theirdestruction was thus meant the overthrow of their power.\n\n15a. Note that the description given does not mention the actual blessings of para -dise, for they are blessings “which no eye has seen, nor has any ear heard, nor has itentered into the heart of man to conceive them” (B. 59:8). The blessings mentioned hereare plainly called a parable, an example which shows what they are like.\n\n15b. Here is another instance of the use of the word maghfirat, showing that it doesnot mean forgiveness of sins, but protection from sin. Among the various blessings ofparadise, which its inmates find after admission to paradise, is maghfirat. It is clear thatthey could be admitted to paradise only after forgiveness of sins, if they had any, and thecommission of sins in paradise is inconceivable.\n\n18a. By the Hour is to be understood the hour of their doom, the overthrow of theirpower, which is clearly spoken of in the previous verses. Tokens of it had alreadyappeared, for they had seen how Islåm was daily advancing, and how all their efforts tocheck its progress had ended in failure.\n\n19a. Not only the Prophet but every believer is told here to keep praying to God forbeing protected from sins, for himself and for all the believers, men as well as women;see also 40:55a, 48:2a.\n\n19b. Moving about refers to man’s going to and fro for the transaction of his affairs,and staying to taking rest.\n\n20a. The Muslims had been persecuted beyond all measure; they had beenoppressed, slain and turned out of their homes. Hence they naturally desired to beallowed to defend themselves. By a chapter is meant a revelation allowing them to fight.\n\n22a. It is the hypocrites who are addressed in these words. Tawallai-tum may meaneither that you turn your backs on the Divine commandment to fight in defence of Truthor that you are put in authority.\n\n23a. Note that Allåh blinds the eyes of and makes deaf those who would not turn tothe right way. The next verse makes it clear by saying that they do not reflect on theQur’ån, as if there were locks on their hearts.\n\n37a. In the concluding words of v. 36, it is stated that God does not ask of men theirwealth, while here they are told that if He should ask them for it, they would be niggardly. The two statements do not contradict each other. V. 38 makes it clear that Allåh,being Self-Sufficient, does not stand in need of men’s wealth, so He does not ask ofthem their wealth for His needs — He has no need at all. Yet it is true that great stress islaid on spending wealth, but that is for man’s own good. This too is made clear in v. 38— whoever is niggardly, is niggardly against his own soul. You are needy, we arefurther told. Man stands in need of making sacrifices for the good of his own soul and, ifhe does not make a sacrifice, he will suffer. There is no advancement in this worldwithout a sacrifice, so if man has an urge for advancement, he must spend his wealth."
    }
  ]
}
