{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالًا كَثِيرًا وَنِسَاءً ۚ وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ ۚ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا",
      "verseStringB": "O people, keep your duty to your Lord, Who created you from a single being and created its mate of the same (kind),ᵃ and spread from these two many men and women.ᵇ And keep your duty to Allāh, by Whom you demand one of another (your rights), and (to) the ties of relationship.ᶜ Surely Allāh is ever a Watcher over you."
    },
    {
      "verseNumber": 2,
      "verseString": "وَآتُوا الْيَتَامَىٰ أَمْوَالَهُمْ ۖ وَلَا تَتَبَدَّلُوا الْخَبِيثَ بِالطَّيِّبِ ۖ وَلَا تَأْكُلُوا أَمْوَالَهُمْ إِلَىٰ أَمْوَالِكُمْ ۚ إِنَّهُ كَانَ حُوبًا كَبِيرًا",
      "verseStringB": "And give to the orphans their property, and substitute not worthless (things) for (their) good (ones), and devour not their property (adding) to your own property. This is surely a great sin.ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَىٰ فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ مَثْنَىٰ وَثُلَاثَ وَرُبَاعَ ۖ فَإِنْ خِفْتُمْ أَلَّا تَعْدِلُوا فَوَاحِدَةً أَوْ مَا مَلَكَتْ أَيْمَانُكُمْ ۚ ذَٰلِكَ أَدْنَىٰ أَلَّا تَعُولُوا",
      "verseStringB": "And if you fear that you cannot do justice to orphans, marry such women as seem good to you, two, or three, or four;ᵃ but if you fear that you will not do justice, then (marry) only one or that which your right hands possess. This is more proper that you may not do injustice.ᵇ"
    },
    {
      "verseNumber": 4,
      "verseString": "وَآتُوا النِّسَاءَ صَدُقَاتِهِنَّ نِحْلَةً ۚ فَإِنْ طِبْنَ لَكُمْ عَنْ شَيْءٍ مِنْهُ نَفْسًا فَكُلُوهُ هَنِيئًا مَرِيئًا",
      "verseStringB": "And give women their dowries as a free gift. But if they of themselves be pleased to give you a portion thereof, consume it with enjoyment and pleasure.ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "وَلَا تُؤْتُوا السُّفَهَاءَ أَمْوَالَكُمُ الَّتِي جَعَلَ اللَّهُ لَكُمْ قِيَامًا وَارْزُقُوهُمْ فِيهَا وَاكْسُوهُمْ وَقُولُوا لَهُمْ قَوْلًا مَعْرُوفًا",
      "verseStringB": "And make not over your property, which Allāh has made a (means of) support for you,ᵃ to the weak of understanding, and maintain them out of it,ᵇ and clothe them and give them a good education.ᶜ"
    },
    {
      "verseNumber": 6,
      "verseString": "وَابْتَلُوا الْيَتَامَىٰ حَتَّىٰ إِذَا بَلَغُوا النِّكَاحَ فَإِنْ آنَسْتُمْ مِنْهُمْ رُشْدًا فَادْفَعُوا إِلَيْهِمْ أَمْوَالَهُمْ ۖ وَلَا تَأْكُلُوهَا إِسْرَافًا وَبِدَارًا أَنْ يَكْبَرُوا ۚ وَمَنْ كَانَ غَنِيًّا فَلْيَسْتَعْفِفْ ۖ وَمَنْ كَانَ فَقِيرًا فَلْيَأْكُلْ بِالْمَعْرُوفِ ۚ فَإِذَا دَفَعْتُمْ إِلَيْهِمْ أَمْوَالَهُمْ فَأَشْهِدُوا عَلَيْهِمْ ۚ وَكَفَىٰ بِاللَّهِ حَسِيبًا",
      "verseStringB": "And test the orphans until they reach the age of marriage.ᵃ Then if you find in them maturity of intellect, make over to them their property, and consume it not extravagantly and hastily against their growing up.ᵇ And whoever is rich, let him abstain, and whoever is poor let him consume reasonably.ᶜ And when you make over to them their property, call witnesses in their presence. And Allāh is enough as a Reckoner."
    },
    {
      "verseNumber": 7,
      "verseString": "لِلرِّجَالِ نَصِيبٌ مِمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ وَلِلنِّسَاءِ نَصِيبٌ مِمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ مِمَّا قَلَّ مِنْهُ أَوْ كَثُرَ ۚ نَصِيبًا مَفْرُوضًا",
      "verseStringB": "For men is a share of what the parents and the near relatives leave, and for women a share of what the parents and the near relatives leave, whether it be little or much — an appointed share.ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "وَإِذَا حَضَرَ الْقِسْمَةَ أُولُو الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينُ فَارْزُقُوهُمْ مِنْهُ وَقُولُوا لَهُمْ قَوْلًا مَعْرُوفًا",
      "verseStringB": "And when relativesa and the orphans and the needy are present at the division, give them out of it and speak to them kind words."
    },
    {
      "verseNumber": 9,
      "verseString": "وَلْيَخْشَ الَّذِينَ لَوْ تَرَكُوا مِنْ خَلْفِهِمْ ذُرِّيَّةً ضِعَافًا خَافُوا عَلَيْهِمْ فَلْيَتَّقُوا اللَّهَ وَلْيَقُولُوا قَوْلًا سَدِيدًا",
      "verseStringB": "And let those fear who, should they leave behind them weakly offspring, would fear on their account; so let them observe their duty to Allāh and let them speak right words."
    },
    {
      "verseNumber": 10,
      "verseString": "إِنَّ الَّذِينَ يَأْكُلُونَ أَمْوَالَ الْيَتَامَىٰ ظُلْمًا إِنَّمَا يَأْكُلُونَ فِي بُطُونِهِمْ نَارًا ۖ وَسَيَصْلَوْنَ سَعِيرًا",
      "verseStringB": "Those who swallow the property of the orphans unjustly, they swallow only fire into their bellies. And they will burn in blazing fire."
    },
    {
      "verseNumber": 11,
      "verseString": "يُوصِيكُمُ اللَّهُ فِي أَوْلَادِكُمْ ۖ لِلذَّكَرِ مِثْلُ حَظِّ الْأُنْثَيَيْنِ ۚ فَإِنْ كُنَّ نِسَاءً فَوْقَ اثْنَتَيْنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَ ۖ وَإِنْ كَانَتْ وَاحِدَةً فَلَهَا النِّصْفُ ۚ وَلِأَبَوَيْهِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ مِمَّا تَرَكَ إِنْ كَانَ لَهُ وَلَدٌ ۚ فَإِنْ لَمْ يَكُنْ لَهُ وَلَدٌ وَوَرِثَهُ أَبَوَاهُ فَلِأُمِّهِ الثُّلُثُ ۚ فَإِنْ كَانَ لَهُ إِخْوَةٌ فَلِأُمِّهِ السُّدُسُ ۚ مِنْ بَعْدِ وَصِيَّةٍ يُوصِي بِهَا أَوْ دَيْنٍ ۗ آبَاؤُكُمْ وَأَبْنَاؤُكُمْ لَا تَدْرُونَ أَيُّهُمْ أَقْرَبُ لَكُمْ نَفْعًا ۚ فَرِيضَةً مِنَ اللَّهِ ۗ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا",
      "verseStringB": "Allāh enjoins you concerning your children: for the male is the equal of the portion of two females; but if there be more than two females,ᵃ two-thirds of what the deceased leaves is theirs; and if there be one, for her is the half. And as for his parents, for each of them is the sixth of what he leaves, if he has a child; but if he has no child and (only) his two parents inherit him, for his mother is the third; but if he has brothers, for his mother is the sixth, after (payment of) a bequest he may have bequeathed or a debt.ᵇ Your parents and your children, you know not which of them is the nearer to you in benefit. This is an ordInᵃ nce from Allāh. Allāh is surely ever Knowing, Wise."
    },
    {
      "verseNumber": 12,
      "verseString": "وَلَكُمْ نِصْفُ مَا تَرَكَ أَزْوَاجُكُمْ إِنْ لَمْ يَكُنْ لَهُنَّ وَلَدٌ ۚ فَإِنْ كَانَ لَهُنَّ وَلَدٌ فَلَكُمُ الرُّبُعُ مِمَّا تَرَكْنَ ۚ مِنْ بَعْدِ وَصِيَّةٍ يُوصِينَ بِهَا أَوْ دَيْنٍ ۚ وَلَهُنَّ الرُّبُعُ مِمَّا تَرَكْتُمْ إِنْ لَمْ يَكُنْ لَكُمْ وَلَدٌ ۚ فَإِنْ كَانَ لَكُمْ وَلَدٌ فَلَهُنَّ الثُّمُنُ مِمَّا تَرَكْتُمْ ۚ مِنْ بَعْدِ وَصِيَّةٍ تُوصُونَ بِهَا أَوْ دَيْنٍ ۗ وَإِنْ كَانَ رَجُلٌ يُورَثُ كَلَالَةً أَوِ امْرَأَةٌ وَلَهُ أَخٌ أَوْ أُخْتٌ فَلِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ ۚ فَإِنْ كَانُوا أَكْثَرَ مِنْ ذَٰلِكَ فَهُمْ شُرَكَاءُ فِي الثُّلُثِ ۚ مِنْ بَعْدِ وَصِيَّةٍ يُوصَىٰ بِهَا أَوْ دَيْنٍ غَيْرَ مُضَارٍّ ۚ وَصِيَّةً مِنَ اللَّهِ ۗ وَاللَّهُ عَلِيمٌ حَلِيمٌ",
      "verseStringB": "And yours is half of what your wives leave if they have no child; but if they have a child, your share is a fourth of what they leave after (payment of) any bequest they may have bequeathed or a debt; and theirs is the fourth of what you leave if you have no child, but if you have a child, their share is the eighth of what you leave after (payment of) a bequest you may have bequeathed or a debt.ᵃ And if a man or a woman, having no children, leaves property to be inherited and he (or she) has a brother or a sister,ᵇ then for each of them is the sixth; but if they are more than that, they shall be sharers in the third after (payment of) a bequest that may have been bequeathed or a debt not injuring (others).ᶜ This is an ordInᵃ nce from Allāh: and Allāh is Knowing, Forbearing."
    },
    {
      "verseNumber": 13,
      "verseString": "تِلْكَ حُدُودُ اللَّهِ ۚ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ وَذَٰلِكَ الْفَوْزُ الْعَظِيمُ",
      "verseStringB": "These are Allāh’s limits. And whoever obeys Allāh and His Messenger, He will admit him to Gardens wherein flow rivers, to abide in them. And this is the great achievement."
    },
    {
      "verseNumber": 14,
      "verseString": "وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ وَيَتَعَدَّ حُدُودَهُ يُدْخِلْهُ نَارًا خَالِدًا فِيهَا وَلَهُ عَذَابٌ مُهِينٌ",
      "verseStringB": "And whoever disobeys Allāh and His Messenger and goes beyond His limits, He will make him enter fire to abide in it, and for him is an abasing chastisement."
    },
    {
      "verseNumber": 15,
      "verseString": "وَاللَّاتِي يَأْتِينَ الْفَاحِشَةَ مِنْ نِسَائِكُمْ فَاسْتَشْهِدُوا عَلَيْهِنَّ أَرْبَعَةً مِنْكُمْ ۖ فَإِنْ شَهِدُوا فَأَمْسِكُوهُنَّ فِي الْبُيُوتِ حَتَّىٰ يَتَوَفَّاهُنَّ الْمَوْتُ أَوْ يَجْعَلَ اللَّهُ لَهُنَّ سَبِيلًا",
      "verseStringB": "And as for those of your women who are guilty of an indecency, call to witness against them four (witnesses) from among you; so if they bear witness, confine them to the houses until death takes them away or Allāh opens a way for them.ᵃ"
    },
    {
      "verseNumber": 16,
      "verseString": "وَاللَّذَانِ يَأْتِيَانِهَا مِنْكُمْ فَآذُوهُمَا ۖ فَإِنْ تَابَا وَأَصْلَحَا فَأَعْرِضُوا عَنْهُمَا ۗ إِنَّ اللَّهَ كَانَ تَوَّابًا رَحِيمًا",
      "verseStringB": "And as for the two of you who are guilty of it, give them both a slight punishment; then if they repent and amend, turn aside from them.ᵃ Surely Allāh is ever Oft-returning (to mercy), the Merciful."
    },
    {
      "verseNumber": 17,
      "verseString": "إِنَّمَا التَّوْبَةُ عَلَى اللَّهِ لِلَّذِينَ يَعْمَلُونَ السُّوءَ بِجَهَالَةٍ ثُمَّ يَتُوبُونَ مِنْ قَرِيبٍ فَأُولَٰئِكَ يَتُوبُ اللَّهُ عَلَيْهِمْ ۗ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا",
      "verseStringB": "Repentance with Allāh is only for those who do evil in ignorance, then turn (to Allāh) soon, so these it is to whom Allāh turns (mercifully). And Allāh is ever Knowing, Wise."
    },
    {
      "verseNumber": 18,
      "verseString": "وَلَيْسَتِ التَّوْبَةُ لِلَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ حَتَّىٰ إِذَا حَضَرَ أَحَدَهُمُ الْمَوْتُ قَالَ إِنِّي تُبْتُ الْآنَ وَلَا الَّذِينَ يَمُوتُونَ وَهُمْ كُفَّارٌ ۚ أُولَٰئِكَ أَعْتَدْنَا لَهُمْ عَذَابًا أَلِيمًا",
      "verseStringB": "And repentance is not for those who go on doing evil deeds, until when death comes to one of them, he says: Now I repent; nor (for) those who die while they are disbelievers. For such We have prepared a painful chastisement.ᵃ"
    },
    {
      "verseNumber": 19,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا يَحِلُّ لَكُمْ أَنْ تَرِثُوا النِّسَاءَ كَرْهًا ۖ وَلَا تَعْضُلُوهُنَّ لِتَذْهَبُوا بِبَعْضِ مَا آتَيْتُمُوهُنَّ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ ۚ وَعَاشِرُوهُنَّ بِالْمَعْرُوفِ ۚ فَإِنْ كَرِهْتُمُوهُنَّ فَعَسَىٰ أَنْ تَكْرَهُوا شَيْئًا وَيَجْعَلَ اللَّهُ فِيهِ خَيْرًا كَثِيرًا",
      "verseStringB": "O you who believe, it is not lawful for you to take women as heritage against (their) will.ᵃ Nor should you straiten them by taking part of what you have given them,ᵇ unless they are guilty of manifest indecency.ᶜ And treat them kindly. Then if you hate them, it may be that you dislike a thing while Allāh has placed abundant good in it."
    },
    {
      "verseNumber": 20,
      "verseString": "وَإِنْ أَرَدْتُمُ اسْتِبْدَالَ زَوْجٍ مَكَانَ زَوْجٍ وَآتَيْتُمْ إِحْدَاهُنَّ قِنْطَارًا فَلَا تَأْخُذُوا مِنْهُ شَيْئًا ۚ أَتَأْخُذُونَهُ بُهْتَانًا وَإِثْمًا مُبِينًا",
      "verseStringB": "And if you wish to have (one) wife in the place of another and you have given one of them a heap of gold, take nothing from it. Would you take it by slandering (her) and (doing her) manifest wrong?ᵃ"
    },
    {
      "verseNumber": 21,
      "verseString": "وَكَيْفَ تَأْخُذُونَهُ وَقَدْ أَفْضَىٰ بَعْضُكُمْ إِلَىٰ بَعْضٍ وَأَخَذْنَ مِنْكُمْ مِيثَاقًا غَلِيظًا",
      "verseStringB": "And how can you take it when one of you has already gone in to the other and they have taken from you a strong covenant?ᵃ"
    },
    {
      "verseNumber": 22,
      "verseString": "وَلَا تَنْكِحُوا مَا نَكَحَ آبَاؤُكُمْ مِنَ النِّسَاءِ إِلَّا مَا قَدْ سَلَفَ ۚ إِنَّهُ كَانَ فَاحِشَةً وَمَقْتًا وَسَاءَ سَبِيلًا",
      "verseStringB": "And marry not women whom your fathers married, except what has already passed. This surely is indecent and hateful; and it is an evil way.ᵃ"
    },
    {
      "verseNumber": 23,
      "verseString": "حُرِّمَتْ عَلَيْكُمْ أُمَّهَاتُكُمْ وَبَنَاتُكُمْ وَأَخَوَاتُكُمْ وَعَمَّاتُكُمْ وَخَالَاتُكُمْ وَبَنَاتُ الْأَخِ وَبَنَاتُ الْأُخْتِ وَأُمَّهَاتُكُمُ اللَّاتِي أَرْضَعْنَكُمْ وَأَخَوَاتُكُمْ مِنَ الرَّضَاعَةِ وَأُمَّهَاتُ نِسَائِكُمْ وَرَبَائِبُكُمُ اللَّاتِي فِي حُجُورِكُمْ مِنْ نِسَائِكُمُ اللَّاتِي دَخَلْتُمْ بِهِنَّ فَإِنْ لَمْ تَكُونُوا دَخَلْتُمْ بِهِنَّ فَلَا جُنَاحَ عَلَيْكُمْ وَحَلَائِلُ أَبْنَائِكُمُ الَّذِينَ مِنْ أَصْلَابِكُمْ وَأَنْ تَجْمَعُوا بَيْنَ الْأُخْتَيْنِ إِلَّا مَا قَدْ سَلَفَ ۗ إِنَّ اللَّهَ كَانَ غَفُورًا رَحِيمًا",
      "verseStringB": "Forbidden to you are your mothers, and your daughters, and your sisters, and your paternal aunts, and your maternal aunts, and brother’s daughters and sister’s daughters, and your mothers that have suckled you, and your foster-sisters, and mothers of your wives, and your stepdaughters who are in your guardianship (born) of your wives to whom you have gone in — but if you have not gone in to them, there is no blame on you — and the wives of your sons who are of your own loins; and that you should have two sisters together, except what has already passed. Surely Allāh is ever Forgiving, Merciful,ᵃ"
    },
    {
      "verseNumber": 24,
      "verseString": "وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ إِلَّا مَا مَلَكَتْ أَيْمَانُكُمْ ۖ كِتَابَ اللَّهِ عَلَيْكُمْ ۚ وَأُحِلَّ لَكُمْ مَا وَرَاءَ ذَٰلِكُمْ أَنْ تَبْتَغُوا بِأَمْوَالِكُمْ مُحْصِنِينَ غَيْرَ مُسَافِحِينَ ۚ فَمَا اسْتَمْتَعْتُمْ بِهِ مِنْهُنَّ فَآتُوهُنَّ أُجُورَهُنَّ فَرِيضَةً ۚ وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا تَرَاضَيْتُمْ بِهِ مِنْ بَعْدِ الْفَرِيضَةِ ۚ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا",
      "verseStringB": "And all married women except those whom your right hands possess (are forbidden);ᵃ (this is) Allāh’s ordInᵃ nce to you. And lawful for you are (all women) besides those, provided that you seek (them) with your property, taking (them) in marriage, not committing fornication. Then as to those whom you profit by (by marrying), give them their dowries as appointed. And there is no blame on you about what you mutually agree after what is appointed (of dowry).ᵇ Surely Allāh is ever Knowing, Wise."
    },
    {
      "verseNumber": 25,
      "verseString": "وَمَنْ لَمْ يَسْتَطِعْ مِنْكُمْ طَوْلًا أَنْ يَنْكِحَ الْمُحْصَنَاتِ الْمُؤْمِنَاتِ فَمِنْ مَا مَلَكَتْ أَيْمَانُكُمْ مِنْ فَتَيَاتِكُمُ الْمُؤْمِنَاتِ ۚ وَاللَّهُ أَعْلَمُ بِإِيمَانِكُمْ ۚ بَعْضُكُمْ مِنْ بَعْضٍ ۚ فَانْكِحُوهُنَّ بِإِذْنِ أَهْلِهِنَّ وَآتُوهُنَّ أُجُورَهُنَّ بِالْمَعْرُوفِ مُحْصَنَاتٍ غَيْرَ مُسَافِحَاتٍ وَلَا مُتَّخِذَاتِ أَخْدَانٍ ۚ فَإِذَا أُحْصِنَّ فَإِنْ أَتَيْنَ بِفَاحِشَةٍ فَعَلَيْهِنَّ نِصْفُ مَا عَلَى الْمُحْصَنَاتِ مِنَ الْعَذَابِ ۚ ذَٰلِكَ لِمَنْ خَشِيَ الْعَنَتَ مِنْكُمْ ۚ وَأَنْ تَصْبِرُوا خَيْرٌ لَكُمْ ۗ وَاللَّهُ غَفُورٌ رَحِيمٌ",
      "verseStringB": "And whoever among you cannot afford to marry free believing women, (let him marry) such of your believing maidens as your right hands possess. And Allāh knows best your faith — you are (sprung) the one from the other. So marry them with the permission of their masters, and give them their dowries justly, they being chaste, not fornicating, nor receiving paramours; then if they are guilty of adultery when they are taken in marriage, they shall suffer half the punishment for free married women. This is for him among you who fears falling into evil. And that you abstain is better for you. And Allāh is Forgiving, Merciful.ᵃ"
    },
    {
      "verseNumber": 26,
      "verseString": "يُرِيدُ اللَّهُ لِيُبَيِّنَ لَكُمْ وَيَهْدِيَكُمْ سُنَنَ الَّذِينَ مِنْ قَبْلِكُمْ وَيَتُوبَ عَلَيْكُمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
      "verseStringB": "Allāh desires to explain to you, and to guide you into the ways of those before you, and to turn to you (mercifully). And Allāh is Knowing, Wise."
    },
    {
      "verseNumber": 27,
      "verseString": "وَاللَّهُ يُرِيدُ أَنْ يَتُوبَ عَلَيْكُمْ وَيُرِيدُ الَّذِينَ يَتَّبِعُونَ الشَّهَوَاتِ أَنْ تَمِيلُوا مَيْلًا عَظِيمًا",
      "verseStringB": "And Allāh desires to turn to you (mercifully). And those who follow (their) lusts desire that you should deviate (with) a great deviation."
    },
    {
      "verseNumber": 28,
      "verseString": "يُرِيدُ اللَّهُ أَنْ يُخَفِّفَ عَنْكُمْ ۚ وَخُلِقَ الْإِنْسَانُ ضَعِيفًا",
      "verseStringB": "Allāh desires to make light your burdens,ᵃ and man is created weak.ᵇ"
    },
    {
      "verseNumber": 29,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَأْكُلُوا أَمْوَالَكُمْ بَيْنَكُمْ بِالْبَاطِلِ إِلَّا أَنْ تَكُونَ تِجَارَةً عَنْ تَرَاضٍ مِنْكُمْ ۚ وَلَا تَقْتُلُوا أَنْفُسَكُمْ ۚ إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيمًا",
      "verseStringB": "O you who believe, devour not your property among yourselves by illegal methods except that it be trading by your mutual consent.ᵃ And kill not your people. Surely Allāh is ever Merciful to you."
    },
    {
      "verseNumber": 30,
      "verseString": "وَمَنْ يَفْعَلْ ذَٰلِكَ عُدْوَانًا وَظُلْمًا فَسَوْفَ نُصْلِيهِ نَارًا ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا",
      "verseStringB": "And whoso does this aggressively and unjustly, We shall soon cast him into fire. And this is ever easy for Allāh."
    },
    {
      "verseNumber": 31,
      "verseString": "إِنْ تَجْتَنِبُوا كَبَائِرَ مَا تُنْهَوْنَ عَنْهُ نُكَفِّرْ عَنْكُمْ سَيِّئَاتِكُمْ وَنُدْخِلْكُمْ مُدْخَلًا كَرِيمًا",
      "verseStringB": "If you shun the great things which you are forbidden, We shall do away with your evil (inclInᵃ tions)a and cause you to enter an honourable place of entering."
    },
    {
      "verseNumber": 32,
      "verseString": "وَلَا تَتَمَنَّوْا مَا فَضَّلَ اللَّهُ بِهِ بَعْضَكُمْ عَلَىٰ بَعْضٍ ۚ لِلرِّجَالِ نَصِيبٌ مِمَّا اكْتَسَبُوا ۖ وَلِلنِّسَاءِ نَصِيبٌ مِمَّا اكْتَسَبْنَ ۚ وَاسْأَلُوا اللَّهَ مِنْ فَضْلِهِ ۗ إِنَّ اللَّهَ كَانَ بِكُلِّ شَيْءٍ عَلِيمًا",
      "verseStringB": "And covet not that by which Allāh has made some of you excel others. For men is the benefit of what they earn. And for women is the benefit of what they earn. And ask Allāh of His grace. Surely Allāh is ever Knower of all things."
    },
    {
      "verseNumber": 33,
      "verseString": "وَلِكُلٍّ جَعَلْنَا مَوَالِيَ مِمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ ۚ وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ فَآتُوهُمْ نَصِيبَهُمْ ۚ إِنَّ اللَّهَ كَانَ عَلَىٰ كُلِّ شَيْءٍ شَهِيدًا",
      "verseStringB": "And to everyone We have appointed heirs a of that which parents and near relatives leave. And as to those with whom your right hands have ratified agreements, give them their due.ᵇ Surely Allāh is ever Witness over all things."
    },
    {
      "verseNumber": 34,
      "verseString": "الرِّجَالُ قَوَّامُونَ عَلَى النِّسَاءِ بِمَا فَضَّلَ اللَّهُ بَعْضَهُمْ عَلَىٰ بَعْضٍ وَبِمَا أَنْفَقُوا مِنْ أَمْوَالِهِمْ ۚ فَالصَّالِحَاتُ قَانِتَاتٌ حَافِظَاتٌ لِلْغَيْبِ بِمَا حَفِظَ اللَّهُ ۚ وَاللَّاتِي تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَاهْجُرُوهُنَّ فِي الْمَضَاجِعِ وَاضْرِبُوهُنَّ ۖ فَإِنْ أَطَعْنَكُمْ فَلَا تَبْغُوا عَلَيْهِنَّ سَبِيلًا ۗ إِنَّ اللَّهَ كَانَ عَلِيًّا كَبِيرًا",
      "verseStringB": "Men are the maintainersa of women, with what Allāh has made some of them to excel others and with what they spend out of their wealth. So the good women are obedient, b guarding the unseenc as Allāh has guarded.ᵈ And (as to) those on whose part you fear desertion, admonish them, and leave them alone in the beds and chastise them. So if they obey you, seek not a way against them. Surely Allāh is ever Exalted, Great.ᵉ"
    },
    {
      "verseNumber": 35,
      "verseString": "وَإِنْ خِفْتُمْ شِقَاقَ بَيْنِهِمَا فَابْعَثُوا حَكَمًا مِنْ أَهْلِهِ وَحَكَمًا مِنْ أَهْلِهَا إِنْ يُرِيدَا إِصْلَاحًا يُوَفِّقِ اللَّهُ بَيْنَهُمَا ۗ إِنَّ اللَّهَ كَانَ عَلِيمًا خَبِيرًا",
      "verseStringB": "And if you fear a breach between the two, appoint an arbiter from his people and an arbiter from her people. If they both desire agreement, Allāh will effect harmony between them. Surely Allāh is ever Knowing, Aware.ᵃ"
    },
    {
      "verseNumber": 36,
      "verseString": "وَاعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا ۖ وَبِالْوَالِدَيْنِ إِحْسَانًا وَبِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَالْجَارِ ذِي الْقُرْبَىٰ وَالْجَارِ الْجُنُبِ وَالصَّاحِبِ بِالْجَنْبِ وَابْنِ السَّبِيلِ وَمَا مَلَكَتْ أَيْمَانُكُمْ ۗ إِنَّ اللَّهَ لَا يُحِبُّ مَنْ كَانَ مُخْتَالًا فَخُورًا",
      "verseStringB": "And serve Allāh, and associate naught with Him, and be good to the parents and to the near of kin and the orphans and the needy and the neighbour of (your) kin and the alien neighbour,ᵃ and the companion in a journey and the wayfarer and those whom your right hands possess.ᵇ Surely Allāh loves not such as are proud, boastful,"
    },
    {
      "verseNumber": 37,
      "verseString": "الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ وَيَكْتُمُونَ مَا آتَاهُمُ اللَّهُ مِنْ فَضْلِهِ ۗ وَأَعْتَدْنَا لِلْكَافِرِينَ عَذَابًا مُهِينًا",
      "verseStringB": "Who are niggardly and bid people to be niggardly and hide that which Allāh has given them out of His grace. And We have prepared for the disbelievers an abasing chastisement —"
    },
    {
      "verseNumber": 38,
      "verseString": "وَالَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ رِئَاءَ النَّاسِ وَلَا يُؤْمِنُونَ بِاللَّهِ وَلَا بِالْيَوْمِ الْآخِرِ ۗ وَمَنْ يَكُنِ الشَّيْطَانُ لَهُ قَرِينًا فَسَاءَ قَرِينًا",
      "verseStringB": "And those who spend their wealth to be seen of men and believe not in Allāh nor in the Last Day. And as for him whose companion is the devil, an evil companion is he!"
    },
    {
      "verseNumber": 39,
      "verseString": "وَمَاذَا عَلَيْهِمْ لَوْ آمَنُوا بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَأَنْفَقُوا مِمَّا رَزَقَهُمُ اللَّهُ ۚ وَكَانَ اللَّهُ بِهِمْ عَلِيمًا",
      "verseStringB": "And what (harm) would it do them if they believe in Allāh and the Last Day and spend of that which Allāh has given them? And Allāh is ever Knower of them."
    },
    {
      "verseNumber": 40,
      "verseString": "إِنَّ اللَّهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ ۖ وَإِنْ تَكُ حَسَنَةً يُضَاعِفْهَا وَيُؤْتِ مِنْ لَدُنْهُ أَجْرًا عَظِيمًا",
      "verseStringB": "Surely Allāh wrongs not the weight of an atom; and if it is a good deed, He multiplies it and gives from Himself a great reward.ᵃ"
    },
    {
      "verseNumber": 41,
      "verseString": "فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَىٰ هَٰؤُلَاءِ شَهِيدًا",
      "verseStringB": "But how will it be when We bring from every people a witness and bring thee as a witness against these?ᵃ"
    },
    {
      "verseNumber": 42,
      "verseString": "يَوْمَئِذٍ يَوَدُّ الَّذِينَ كَفَرُوا وَعَصَوُا الرَّسُولَ لَوْ تُسَوَّىٰ بِهِمُ الْأَرْضُ وَلَا يَكْتُمُونَ اللَّهَ حَدِيثًا",
      "verseStringB": "On that day will those who disbelieved and disobeyed the Messenger desire that the earth were levelled with them. And they can hide no fact from Allāh."
    },
    {
      "verseNumber": 43,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقْرَبُوا الصَّلَاةَ وَأَنْتُمْ سُكَارَىٰ حَتَّىٰ تَعْلَمُوا مَا تَقُولُونَ وَلَا جُنُبًا إِلَّا عَابِرِي سَبِيلٍ حَتَّىٰ تَغْتَسِلُوا ۚ وَإِنْ كُنْتُمْ مَرْضَىٰ أَوْ عَلَىٰ سَفَرٍ أَوْ جَاءَ أَحَدٌ مِنْكُمْ مِنَ الْغَائِطِ أَوْ لَامَسْتُمُ النِّسَاءَ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا فَامْسَحُوا بِوُجُوهِكُمْ وَأَيْدِيكُمْ ۗ إِنَّ اللَّهَ كَانَ عَفُوًّا غَفُورًا",
      "verseStringB": "O you who believe, go not near prayer when you are intoxicated till you know what you say,ᵃ nor after sexual intercourseb — except you are merely passing byc — until you have bathed. And if you are sick, or on a journey, or one of you come from the privy, or you have touched the women,ᵈ and you cannot find water, betake yourselves to pure earth,ᵉ then wipe your faces and your hands. Surely Allāh is ever Pardoning, Forgiving."
    },
    {
      "verseNumber": 44,
      "verseString": "أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِنَ الْكِتَابِ يَشْتَرُونَ الضَّلَالَةَ وَيُرِيدُونَ أَنْ تَضِلُّوا السَّبِيلَ",
      "verseStringB": "Seest thou not those to whom a portion of the Book was given? They buy error and desire to make you err from the (right) way."
    },
    {
      "verseNumber": 45,
      "verseString": "وَاللَّهُ أَعْلَمُ بِأَعْدَائِكُمْ ۚ وَكَفَىٰ بِاللَّهِ وَلِيًّا وَكَفَىٰ بِاللَّهِ نَصِيرًا",
      "verseStringB": "And Allāh best knows your enemies. And Allāh is sufficient as a Friend and Allāh is sufficient as a Helper."
    },
    {
      "verseNumber": 46,
      "verseString": "مِنَ الَّذِينَ هَادُوا يُحَرِّفُونَ الْكَلِمَ عَنْ مَوَاضِعِهِ وَيَقُولُونَ سَمِعْنَا وَعَصَيْنَا وَاسْمَعْ غَيْرَ مُسْمَعٍ وَرَاعِنَا لَيًّا بِأَلْسِنَتِهِمْ وَطَعْنًا فِي الدِّينِ ۚ وَلَوْ أَنَّهُمْ قَالُوا سَمِعْنَا وَأَطَعْنَا وَاسْمَعْ وَانْظُرْنَا لَكَانَ خَيْرًا لَهُمْ وَأَقْوَمَ وَلَٰكِنْ لَعَنَهُمُ اللَّهُ بِكُفْرِهِمْ فَلَا يُؤْمِنُونَ إِلَّا قَلِيلًا",
      "verseStringB": "Some of those who are Jews alter words from their placesa and say, We have heard and we disobey; and (say), Hear without being made to hear, and (say), Rā‘i-nā, distorting with their tongues and slandering religion. And if they had said, We hear and we obey, and hearken, and un˚ur-nā,ᵇ it would have been better for them and more upright; but Allāh has cursed them on account of their disbelief, so they believe not but a little."
    },
    {
      "verseNumber": 47,
      "verseString": "يَا أَيُّهَا الَّذِينَ أُوتُوا الْكِتَابَ آمِنُوا بِمَا نَزَّلْنَا مُصَدِّقًا لِمَا مَعَكُمْ مِنْ قَبْلِ أَنْ نَطْمِسَ وُجُوهًا فَنَرُدَّهَا عَلَىٰ أَدْبَارِهَا أَوْ نَلْعَنَهُمْ كَمَا لَعَنَّا أَصْحَابَ السَّبْتِ ۚ وَكَانَ أَمْرُ اللَّهِ مَفْعُولًا",
      "verseStringB": "O you who have been given the Book, believe in what We have revealed, verifying that which you have, before We destroy the leaders and turn them on their backs, or curse them as We cursed the Sabbath-breakers.ᵃ And the command of Allāh is ever executed"
    },
    {
      "verseNumber": 48,
      "verseString": "إِنَّ اللَّهَ لَا يَغْفِرُ أَنْ يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَنْ يَشَاءُ ۚ وَمَنْ يُشْرِكْ بِاللَّهِ فَقَدِ افْتَرَىٰ إِثْمًا عَظِيمًا",
      "verseStringB": "Surely Allāh forgives not that a partner should be set up with Him, and forgives all besides that to whom He pleases. And whoever sets up a partner with Allāh, he devises indeed a great sin.ᵃ"
    },
    {
      "verseNumber": 49,
      "verseString": "أَلَمْ تَرَ إِلَى الَّذِينَ يُزَكُّونَ أَنْفُسَهُمْ ۚ بَلِ اللَّهُ يُزَكِّي مَنْ يَشَاءُ وَلَا يُظْلَمُونَ فَتِيلًا",
      "verseStringB": "Hast thou not seen those who attribute purity to themselves? Nay, Allāh purifies whom He pleases, and they will not be wronged a whit.ᵃ"
    },
    {
      "verseNumber": 50,
      "verseString": "انْظُرْ كَيْفَ يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ ۖ وَكَفَىٰ بِهِ إِثْمًا مُبِينًا",
      "verseStringB": "See how they forge lies against Allāh! And sufficient is this as a manifest sin.ᵃ"
    },
    {
      "verseNumber": 51,
      "verseString": "أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِنَ الْكِتَابِ يُؤْمِنُونَ بِالْجِبْتِ وَالطَّاغُوتِ وَيَقُولُونَ لِلَّذِينَ كَفَرُوا هَٰؤُلَاءِ أَهْدَىٰ مِنَ الَّذِينَ آمَنُوا سَبِيلًا",
      "verseStringB": "Hast thou not seen those to whom a portion of the Book was given? They believe in sorcerya and diviners and say of those who disbelieve: These are better guided in the path than those who believe."
    },
    {
      "verseNumber": 52,
      "verseString": "أُولَٰئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ ۖ وَمَنْ يَلْعَنِ اللَّهُ فَلَنْ تَجِدَ لَهُ نَصِيرًا",
      "verseStringB": "Those are they whom Allāh has cursed. And whomever Allāh curses, thou wilt not find a helper for him."
    },
    {
      "verseNumber": 53,
      "verseString": "أَمْ لَهُمْ نَصِيبٌ مِنَ الْمُلْكِ فَإِذًا لَا يُؤْتُونَ النَّاسَ نَقِيرًا",
      "verseStringB": "Or have they a share in the kingdom? But then they would not give to people even the speck on a datestone.ᵃ"
    },
    {
      "verseNumber": 54,
      "verseString": "أَمْ يَحْسُدُونَ النَّاسَ عَلَىٰ مَا آتَاهُمُ اللَّهُ مِنْ فَضْلِهِ ۖ فَقَدْ آتَيْنَا آلَ إِبْرَاهِيمَ الْكِتَابَ وَالْحِكْمَةَ وَآتَيْنَاهُمْ مُلْكًا عَظِيمًا",
      "verseStringB": "Or do they envy the people for that which Allāh has given them of His grace? But indeed We have given to Abraham’s children the Book and the Wisdom, and We have given them a grand kingdom.ᵃ"
    },
    {
      "verseNumber": 55,
      "verseString": "فَمِنْهُمْ مَنْ آمَنَ بِهِ وَمِنْهُمْ مَنْ صَدَّ عَنْهُ ۚ وَكَفَىٰ بِجَهَنَّمَ سَعِيرًا",
      "verseStringB": "So of thema is he who believes in him, and of them is he who turns away from him.ᵇ And Hell is sufficient to burn."
    },
    {
      "verseNumber": 56,
      "verseString": "إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِنَا سَوْفَ نُصْلِيهِمْ نَارًا كُلَّمَا نَضِجَتْ جُلُودُهُمْ بَدَّلْنَاهُمْ جُلُودًا غَيْرَهَا لِيَذُوقُوا الْعَذَابَ ۗ إِنَّ اللَّهَ كَانَ عَزِيزًا حَكِيمًا",
      "verseStringB": "Those who disbelieve in Our Messages, We shall make them enter Fire. As often as their skins are burned, We shall change them for other skins,ᵃ that they may taste the chastisement. Surely Allāh is ever Mighty, Wise."
    },
    {
      "verseNumber": 57,
      "verseString": "وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَنُدْخِلُهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۖ لَهُمْ فِيهَا أَزْوَاجٌ مُطَهَّرَةٌ ۖ وَنُدْخِلُهُمْ ظِلًّا ظَلِيلًا",
      "verseStringB": "And those who believe and do good deeds, We shall make them enter Gardens wherein flow rivers, to abide in them forever. For them therein are pure companions and We shall make them enter a pleasant shade.ᵃ"
    },
    {
      "verseNumber": 58,
      "verseString": "إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَمَانَاتِ إِلَىٰ أَهْلِهَا وَإِذَا حَكَمْتُمْ بَيْنَ النَّاسِ أَنْ تَحْكُمُوا بِالْعَدْلِ ۚ إِنَّ اللَّهَ نِعِمَّا يَعِظُكُمْ بِهِ ۗ إِنَّ اللَّهَ كَانَ سَمِيعًا بَصِيرًا",
      "verseStringB": "Surely Allāh commands you to make over trustsa to those worthy of them, and that when you judge between people, you judge with justice. Surely Allāh admonishes you with what is excellent. Surely Allāh is ever Hearing, Seeing."
    },
    {
      "verseNumber": 59,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنْكُمْ ۖ فَإِنْ تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ إِنْ كُنْتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ۚ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا",
      "verseStringB": "O you who believe, obey Allāh and obey the Messenger and those in authority from among you; then if you quarrel about anything, refer it to Allāh and the Messenger, if you believe in Allāh and the Last Day.ᵃ This is best and more suitable to (achieve) the end.ᵇ"
    },
    {
      "verseNumber": 60,
      "verseString": "أَلَمْ تَرَ إِلَى الَّذِينَ يَزْعُمُونَ أَنَّهُمْ آمَنُوا بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ يُرِيدُونَ أَنْ يَتَحَاكَمُوا إِلَى الطَّاغُوتِ وَقَدْ أُمِرُوا أَنْ يَكْفُرُوا بِهِ وَيُرِيدُ الشَّيْطَانُ أَنْ يُضِلَّهُمْ ضَلَالًا بَعِيدًا",
      "verseStringB": "Hast thou not seen those who assert that they believe in that which has been revealed to thee and that which was revealed before thee? They desire to seek the judgment of the devil,ᵃ though they have been commanded to deny him. And the devil desires to lead them far astray."
    },
    {
      "verseNumber": 61,
      "verseString": "وَإِذَا قِيلَ لَهُمْ تَعَالَوْا إِلَىٰ مَا أَنْزَلَ اللَّهُ وَإِلَى الرَّسُولِ رَأَيْتَ الْمُنَافِقِينَ يَصُدُّونَ عَنْكَ صُدُودًا",
      "verseStringB": "And when it is said to them, Come to that which Allāh has revealed and to the Messenger, thou seest the hypocrites turning away from thee with aversion."
    },
    {
      "verseNumber": 62,
      "verseString": "فَكَيْفَ إِذَا أَصَابَتْهُمْ مُصِيبَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ ثُمَّ جَاءُوكَ يَحْلِفُونَ بِاللَّهِ إِنْ أَرَدْنَا إِلَّا إِحْسَانًا وَتَوْفِيقًا",
      "verseStringB": "But how is it that when a misfortune befalls them on account of that which their hands have sent before, they come to thee swearing by Allāh: We desired naught but good and concord?"
    },
    {
      "verseNumber": 63,
      "verseString": "أُولَٰئِكَ الَّذِينَ يَعْلَمُ اللَّهُ مَا فِي قُلُوبِهِمْ فَأَعْرِضْ عَنْهُمْ وَعِظْهُمْ وَقُلْ لَهُمْ فِي أَنْفُسِهِمْ قَوْلًا بَلِيغًا",
      "verseStringB": "These are they, the secrets of whose hearts Allāh knows; so turn aside from them and admonish them and speak to them effective words concerning themselves.ᵃ"
    },
    {
      "verseNumber": 64,
      "verseString": "وَمَا أَرْسَلْنَا مِنْ رَسُولٍ إِلَّا لِيُطَاعَ بِإِذْنِ اللَّهِ ۚ وَلَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جَاءُوكَ فَاسْتَغْفَرُوا اللَّهَ وَاسْتَغْفَرَ لَهُمُ الرَّسُولُ لَوَجَدُوا اللَّهَ تَوَّابًا رَحِيمًا",
      "verseStringB": "And We sent no messenger but that he should be obeyed by Allāh’s command. And had they, when they wronged themselves, come to thee and asked forgiveness of Allāh, and the Messenger had (also) asked forgiveness for them, they would have found Allāh Oft-returning (to mercy), Merciful"
    },
    {
      "verseNumber": 65,
      "verseString": "فَلَا وَرَبِّكَ لَا يُؤْمِنُونَ حَتَّىٰ يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لَا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجًا مِمَّا قَضَيْتَ وَيُسَلِّمُوا تَسْلِيمًا",
      "verseStringB": "But no, by thy Lord! they believe not until they make thee a judge of what is in dispute between them, then find not any straitness in their hearts as to that which thou decidest and submit with full submission."
    },
    {
      "verseNumber": 66,
      "verseString": "وَلَوْ أَنَّا كَتَبْنَا عَلَيْهِمْ أَنِ اقْتُلُوا أَنْفُسَكُمْ أَوِ اخْرُجُوا مِنْ دِيَارِكُمْ مَا فَعَلُوهُ إِلَّا قَلِيلٌ مِنْهُمْ ۖ وَلَوْ أَنَّهُمْ فَعَلُوا مَا يُوعَظُونَ بِهِ لَكَانَ خَيْرًا لَهُمْ وَأَشَدَّ تَثْبِيتًا",
      "verseStringB": "And if We had enjoined them, Lay down your livesa or go forth from your homes, they would not have done it except a few of them. And if they had done what they are exhorted to do, it would certainly have been better for them and more strengthening:"
    },
    {
      "verseNumber": 67,
      "verseString": "وَإِذًا لَآتَيْنَاهُمْ مِنْ لَدُنَّا أَجْرًا عَظِيمًا",
      "verseStringB": "And then We would certainly have given them from Ourselves a great reward,"
    },
    {
      "verseNumber": 68,
      "verseString": "وَلَهَدَيْنَاهُمْ صِرَاطًا مُسْتَقِيمًا",
      "verseStringB": "And We would certainly have guided them in the right path."
    },
    {
      "verseNumber": 69,
      "verseString": "وَمَنْ يُطِعِ اللَّهَ وَالرَّسُولَ فَأُولَٰئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ ۚ وَحَسُنَ أُولَٰئِكَ رَفِيقًا",
      "verseStringB": "And whoever obeys Allāh and the Messenger, they are with those upon whom Allāh has bestowed favours from among the prophets and the truthful and the faithful and the righteous, and a goodly company are they!ᵃ"
    },
    {
      "verseNumber": 70,
      "verseString": "ذَٰلِكَ الْفَضْلُ مِنَ اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ عَلِيمًا",
      "verseStringB": "Such is the grace from Allāh, and Allāh is sufficient as Knower."
    },
    {
      "verseNumber": 71,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا خُذُوا حِذْرَكُمْ فَانْفِرُوا ثُبَاتٍ أَوِ انْفِرُوا جَمِيعًا",
      "verseStringB": "O you who believe, take your precautions, then go forth in detachments or go forth in a body."
    },
    {
      "verseNumber": 72,
      "verseString": "وَإِنَّ مِنْكُمْ لَمَنْ لَيُبَطِّئَنَّ فَإِنْ أَصَابَتْكُمْ مُصِيبَةٌ قَالَ قَدْ أَنْعَمَ اللَّهُ عَلَيَّ إِذْ لَمْ أَكُنْ مَعَهُمْ شَهِيدًا",
      "verseStringB": "And among you is he who would hang back. Then if a mis fortune befalls you he says: Allāh indeed bestowed a favour on me as I was not present with them."
    },
    {
      "verseNumber": 73,
      "verseString": "وَلَئِنْ أَصَابَكُمْ فَضْلٌ مِنَ اللَّهِ لَيَقُولَنَّ كَأَنْ لَمْ تَكُنْ بَيْنَكُمْ وَبَيْنَهُ مَوَدَّةٌ يَا لَيْتَنِي كُنْتُ مَعَهُمْ فَأَفُوزَ فَوْزًا عَظِيمًا",
      "verseStringB": "And if bounty from Allāh comes to you, he would cry, as if there were no friendship between you and him: Would that I had been with them, then I should have achieved a mighty success!"
    },
    {
      "verseNumber": 74,
      "verseString": "فَلْيُقَاتِلْ فِي سَبِيلِ اللَّهِ الَّذِينَ يَشْرُونَ الْحَيَاةَ الدُّنْيَا بِالْآخِرَةِ ۚ وَمَنْ يُقَاتِلْ فِي سَبِيلِ اللَّهِ فَيُقْتَلْ أَوْ يَغْلِبْ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًا",
      "verseStringB": "So let those fight in the way of Allāh who sell this world’s life for the Hereafter. And whoever fights in the way of Allāh, be he slain or be he victorious, We shall grant him a mighty reward."
    },
    {
      "verseNumber": 75,
      "verseString": "وَمَا لَكُمْ لَا تُقَاتِلُونَ فِي سَبِيلِ اللَّهِ وَالْمُسْتَضْعَفِينَ مِنَ الرِّجَالِ وَالنِّسَاءِ وَالْوِلْدَانِ الَّذِينَ يَقُولُونَ رَبَّنَا أَخْرِجْنَا مِنْ هَٰذِهِ الْقَرْيَةِ الظَّالِمِ أَهْلُهَا وَاجْعَلْ لَنَا مِنْ لَدُنْكَ وَلِيًّا وَاجْعَلْ لَنَا مِنْ لَدُنْكَ نَصِيرًا",
      "verseStringB": "And what reason have you not to fight in the way of Allāh, and of the weak among the men and the women and the children, who say: Our Lord, take us out of this town, whose people are oppressors, and grant us from Thee a friend, and grant us from Thee a helper!ᵃ"
    },
    {
      "verseNumber": 76,
      "verseString": "الَّذِينَ آمَنُوا يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ ۖ وَالَّذِينَ كَفَرُوا يُقَاتِلُونَ فِي سَبِيلِ الطَّاغُوتِ فَقَاتِلُوا أَوْلِيَاءَ الشَّيْطَانِ ۖ إِنَّ كَيْدَ الشَّيْطَانِ كَانَ ضَعِيفًا",
      "verseStringB": "Those who believe fight in the way of Allāh, and those who disbelieve fight in the way of the devil. So fight against the friends of the devil; surely the struggle of the devil is ever weak.ᵃ"
    },
    {
      "verseNumber": 77,
      "verseString": "أَلَمْ تَرَ إِلَى الَّذِينَ قِيلَ لَهُمْ كُفُّوا أَيْدِيَكُمْ وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ فَلَمَّا كُتِبَ عَلَيْهِمُ الْقِتَالُ إِذَا فَرِيقٌ مِنْهُمْ يَخْشَوْنَ النَّاسَ كَخَشْيَةِ اللَّهِ أَوْ أَشَدَّ خَشْيَةً ۚ وَقَالُوا رَبَّنَا لِمَ كَتَبْتَ عَلَيْنَا الْقِتَالَ لَوْلَا أَخَّرْتَنَا إِلَىٰ أَجَلٍ قَرِيبٍ ۗ قُلْ مَتَاعُ الدُّنْيَا قَلِيلٌ وَالْآخِرَةُ خَيْرٌ لِمَنِ اتَّقَىٰ وَلَا تُظْلَمُونَ فَتِيلًا",
      "verseStringB": "Hast thou not seen those to whom it was said: Withhold your hands, and keep up prayer and pay the poorrate. But when fighting is prescribed for them, lo! a party of them fear men as they ought to fear Allāh, or with a greater fear, and say: Our Lord, why hast Thou ordained fighting for us? Wouldst Thou not grant us respite to a near term?ᵃ Say: The enjoyment of this world is short, and the Hereafter is better for him who keeps his duty. And you shall not be wronged a whit."
    },
    {
      "verseNumber": 78,
      "verseString": "أَيْنَمَا تَكُونُوا يُدْرِكْكُمُ الْمَوْتُ وَلَوْ كُنْتُمْ فِي بُرُوجٍ مُشَيَّدَةٍ ۗ وَإِنْ تُصِبْهُمْ حَسَنَةٌ يَقُولُوا هَٰذِهِ مِنْ عِنْدِ اللَّهِ ۖ وَإِنْ تُصِبْهُمْ سَيِّئَةٌ يَقُولُوا هَٰذِهِ مِنْ عِنْدِكَ ۚ قُلْ كُلٌّ مِنْ عِنْدِ اللَّهِ ۖ فَمَالِ هَٰؤُلَاءِ الْقَوْمِ لَا يَكَادُونَ يَفْقَهُونَ حَدِيثًا",
      "verseStringB": "Wherever you are, death will overtake you, though you are in towers, raised high. And if good befalls them, they say: This is from Allāh; and if a misfortune befalls them, they say: This is from thee. Say: All is from Allāh. But what is the matter with these people that they make no effort to understand anything?"
    },
    {
      "verseNumber": 79,
      "verseString": "مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ ۖ وَمَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ ۚ وَأَرْسَلْنَاكَ لِلنَّاسِ رَسُولًا ۚ وَكَفَىٰ بِاللَّهِ شَهِيدًا",
      "verseStringB": "Whatever good befalls thee (O man), it is from Allāh, and whatever misfortune befalls thee, it is from thyself.ᵃ And We have sent thee (O Prophet) to mankind as a Messenger. And Allāh is sufficient as a witness."
    },
    {
      "verseNumber": 80,
      "verseString": "مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ ۖ وَمَنْ تَوَلَّىٰ فَمَا أَرْسَلْنَاكَ عَلَيْهِمْ حَفِيظًا",
      "verseStringB": "Whoever obeys the Messenger, he indeed obeys Allāh. And whoever turns away, We have not sent thee as a keeper over them."
    },
    {
      "verseNumber": 81,
      "verseString": "وَيَقُولُونَ طَاعَةٌ فَإِذَا بَرَزُوا مِنْ عِنْدِكَ بَيَّتَ طَائِفَةٌ مِنْهُمْ غَيْرَ الَّذِي تَقُولُ ۖ وَاللَّهُ يَكْتُبُ مَا يُبَيِّتُونَ ۖ فَأَعْرِضْ عَنْهُمْ وَتَوَكَّلْ عَلَى اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا",
      "verseStringB": "And they say: Obedience. But when they go out from thy presence, a party of them plan by night doing otherwise than what thou sayest.ᵃ And Allāh writes down what they plan by night, so turn aside from them and trust in Allāh. And Allāh is sufficient as having charge of affairs."
    },
    {
      "verseNumber": 82,
      "verseString": "أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ ۚ وَلَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللَّهِ لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا",
      "verseStringB": "Will they not then meditate on the Qur’ān? And if it were from any other than Allāh, they would have found in it many a discrepancy.ᵃ"
    },
    {
      "verseNumber": 83,
      "verseString": "وَإِذَا جَاءَهُمْ أَمْرٌ مِنَ الْأَمْنِ أَوِ الْخَوْفِ أَذَاعُوا بِهِ ۖ وَلَوْ رَدُّوهُ إِلَى الرَّسُولِ وَإِلَىٰ أُولِي الْأَمْرِ مِنْهُمْ لَعَلِمَهُ الَّذِينَ يَسْتَنْبِطُونَهُ مِنْهُمْ ۗ وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ لَاتَّبَعْتُمُ الشَّيْطَانَ إِلَّا قَلِيلًا",
      "verseStringB": "But if any news of security or fear comes to them, they spread it abroad. And if they had referred it to the Messenger and to those in authority among them, those of them who can search out knowledge of it would have known it. And were it not for the grace of Allāh upon you and His mercy, you would certainly have followed the devil save a few.ᵃ"
    },
    {
      "verseNumber": 84,
      "verseString": "فَقَاتِلْ فِي سَبِيلِ اللَّهِ لَا تُكَلَّفُ إِلَّا نَفْسَكَ ۚ وَحَرِّضِ الْمُؤْمِنِينَ ۖ عَسَى اللَّهُ أَنْ يَكُفَّ بَأْسَ الَّذِينَ كَفَرُوا ۚ وَاللَّهُ أَشَدُّ بَأْسًا وَأَشَدُّ تَنْكِيلًا",
      "verseStringB": "Fight then in Allāh’s way — thou art not responsible except for thyself; and urge on the believers. It may be that Allāh will restrain the fighting of those who disbelieve. And Allāh is stronger in prowess and stronger to give exemplary punishment.ᵃ"
    },
    {
      "verseNumber": 85,
      "verseString": "مَنْ يَشْفَعْ شَفَاعَةً حَسَنَةً يَكُنْ لَهُ نَصِيبٌ مِنْهَا ۖ وَمَنْ يَشْفَعْ شَفَاعَةً سَيِّئَةً يَكُنْ لَهُ كِفْلٌ مِنْهَا ۗ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ مُقِيتًا",
      "verseStringB": "Whoever intercedes in a good cause has a share of it, and whoever intercedes in an evil cause has a portion of it. And Allāh is ever Keeper over all things.ᵃ"
    },
    {
      "verseNumber": 86,
      "verseString": "وَإِذَا حُيِّيتُمْ بِتَحِيَّةٍ فَحَيُّوا بِأَحْسَنَ مِنْهَا أَوْ رُدُّوهَا ۗ إِنَّ اللَّهَ كَانَ عَلَىٰ كُلِّ شَيْءٍ حَسِيبًا",
      "verseStringB": "And when you are greeted with a greeting, greet with one better than it, or return it.ᵃ Surely Allāh ever takes account of all things."
    },
    {
      "verseNumber": 87,
      "verseString": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۚ لَيَجْمَعَنَّكُمْ إِلَىٰ يَوْمِ الْقِيَامَةِ لَا رَيْبَ فِيهِ ۗ وَمَنْ أَصْدَقُ مِنَ اللَّهِ حَدِيثًا",
      "verseStringB": "Allāh, there is no god but He — He will certainly gather you together on the Resurrection day, there is no doubt in it. And who is more true in word than Allāh"
    },
    {
      "verseNumber": 88,
      "verseString": "فَمَا لَكُمْ فِي الْمُنَافِقِينَ فِئَتَيْنِ وَاللَّهُ أَرْكَسَهُمْ بِمَا كَسَبُوا ۚ أَتُرِيدُونَ أَنْ تَهْدُوا مَنْ أَضَلَّ اللَّهُ ۖ وَمَنْ يُضْلِلِ اللَّهُ فَلَنْ تَجِدَ لَهُ سَبِيلًا",
      "verseStringB": "Why should you, then, be two parties in relation to the hypocrites while Allāh has made them return (to disbelief) for what they have earned? Do you desire to guide him whom Allāh leaves in error? And whomsoeve Allāh leaves in error thou canst not find a way for him."
    },
    {
      "verseNumber": 89,
      "verseString": "وَدُّوا لَوْ تَكْفُرُونَ كَمَا كَفَرُوا فَتَكُونُونَ سَوَاءً ۖ فَلَا تَتَّخِذُوا مِنْهُمْ أَوْلِيَاءَ حَتَّىٰ يُهَاجِرُوا فِي سَبِيلِ اللَّهِ ۚ فَإِنْ تَوَلَّوْا فَخُذُوهُمْ وَاقْتُلُوهُمْ حَيْثُ وَجَدْتُمُوهُمْ ۖ وَلَا تَتَّخِذُوا مِنْهُمْ وَلِيًّا وَلَا نَصِيرًا",
      "verseStringB": "They long that you should disbeliev as they have disbelieved so that you might be on the same level; so take not from among them friends until they flee (their homes) in Allāh’s way. Then if they turn back (to hostility), seize them and kill them wherever you find them, and take no friend nor helper from among them"
    },
    {
      "verseNumber": 90,
      "verseString": "إِلَّا الَّذِينَ يَصِلُونَ إِلَىٰ قَوْمٍ بَيْنَكُمْ وَبَيْنَهُمْ مِيثَاقٌ أَوْ جَاءُوكُمْ حَصِرَتْ صُدُورُهُمْ أَنْ يُقَاتِلُوكُمْ أَوْ يُقَاتِلُوا قَوْمَهُمْ ۚ وَلَوْ شَاءَ اللَّهُ لَسَلَّطَهُمْ عَلَيْكُمْ فَلَقَاتَلُوكُمْ ۚ فَإِنِ اعْتَزَلُوكُمْ فَلَمْ يُقَاتِلُوكُمْ وَأَلْقَوْا إِلَيْكُمُ السَّلَمَ فَمَا جَعَلَ اللَّهُ لَكُمْ عَلَيْهِمْ سَبِيلًا",
      "verseStringB": "Except those who join a people between whom and you there is a alliance, or who come to you, their hearts shrinking from fighting you or fighting their own people. And if Allāh had pleased, He would have given them power over you, so that they would have fought you. So if they withdraw from you and fight you not and offer you peace, then Allāh allows you no way against them."
    },
    {
      "verseNumber": 91,
      "verseString": "سَتَجِدُونَ آخَرِينَ يُرِيدُونَ أَنْ يَأْمَنُوكُمْ وَيَأْمَنُوا قَوْمَهُمْ كُلَّ مَا رُدُّوا إِلَى الْفِتْنَةِ أُرْكِسُوا فِيهَا ۚ فَإِنْ لَمْ يَعْتَزِلُوكُمْ وَيُلْقُوا إِلَيْكُمُ السَّلَمَ وَيَكُفُّوا أَيْدِيَهُمْ فَخُذُوهُمْ وَاقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ ۚ وَأُولَٰئِكُمْ جَعَلْنَا لَكُمْ عَلَيْهِمْ سُلْطَانًا مُبِينًا",
      "verseStringB": "You will find others who desire to be secure from you and secure from their own people. Whenever they are made to return to hostility, they are plunged into it.ᵃ So if they withdraw not from you, nor offer you peace and restrain their hands, then seize them and kill them wherever you find them. And against these We have given you a clear authority"
    },
    {
      "verseNumber": 92,
      "verseString": "وَمَا كَانَ لِمُؤْمِنٍ أَنْ يَقْتُلَ مُؤْمِنًا إِلَّا خَطَأً ۚ وَمَنْ قَتَلَ مُؤْمِنًا خَطَأً فَتَحْرِيرُ رَقَبَةٍ مُؤْمِنَةٍ وَدِيَةٌ مُسَلَّمَةٌ إِلَىٰ أَهْلِهِ إِلَّا أَنْ يَصَّدَّقُوا ۚ فَإِنْ كَانَ مِنْ قَوْمٍ عَدُوٍّ لَكُمْ وَهُوَ مُؤْمِنٌ فَتَحْرِيرُ رَقَبَةٍ مُؤْمِنَةٍ ۖ وَإِنْ كَانَ مِنْ قَوْمٍ بَيْنَكُمْ وَبَيْنَهُمْ مِيثَاقٌ فَدِيَةٌ مُسَلَّمَةٌ إِلَىٰ أَهْلِهِ وَتَحْرِيرُ رَقَبَةٍ مُؤْمِنَةٍ ۖ فَمَنْ لَمْ يَجِدْ فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ تَوْبَةً مِنَ اللَّهِ ۗ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا",
      "verseStringB": "And a believer would not kill a believer except by mistake.ᵃ And he who kills a believer by mistake should free a believing slave, and bloodmone should be paid to his peopl unless they remit it as alms. But if he be from a tribe hostile to you and he is a believer, the freeing of a believin slave (suffices). And if he be from a tribe between whom and you there is a covenant, the blood-money should be paid to his people along with the freeing of a believing slave; but he who has not the means should fast for two months successively: a penance from Allāh. And Allāh is ever Knowing, Wise"
    },
    {
      "verseNumber": 93,
      "verseString": "وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا وَغَضِبَ اللَّهُ عَلَيْهِ وَلَعَنَهُ وَأَعَدَّ لَهُ عَذَابًا عَظِيمًا",
      "verseStringB": "And whoever kills a believer intentionally, his punishment is hell, abiding therein; and Allāh is wroth with him and He has cursed him and prepared for him a grievous chastisement.ᵃ"
    },
    {
      "verseNumber": 94,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا ضَرَبْتُمْ فِي سَبِيلِ اللَّهِ فَتَبَيَّنُوا وَلَا تَقُولُوا لِمَنْ أَلْقَىٰ إِلَيْكُمُ السَّلَامَ لَسْتَ مُؤْمِنًا تَبْتَغُونَ عَرَضَ الْحَيَاةِ الدُّنْيَا فَعِنْدَ اللَّهِ مَغَانِمُ كَثِيرَةٌ ۚ كَذَٰلِكَ كُنْتُمْ مِنْ قَبْلُ فَمَنَّ اللَّهُ عَلَيْكُمْ فَتَبَيَّنُوا ۚ إِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا",
      "verseStringB": "O you who believe, when you go forth (to fight) in Allāh’s way, make investigation, and say not to any one who offers you salutation, Thou art not a believer,ᵃ seeking the good of this world’s life. But with Allāh there are abundant gains. You too were such before, then Allāh conferred a benefit on you; so make investigation. Surely Allāh is ever Aware of what you do.ᵇ"
    },
    {
      "verseNumber": 95,
      "verseString": "لَا يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ غَيْرُ أُولِي الضَّرَرِ وَالْمُجَاهِدُونَ فِي سَبِيلِ اللَّهِ بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ ۚ فَضَّلَ اللَّهُ الْمُجَاهِدِينَ بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ عَلَى الْقَاعِدِينَ دَرَجَةً ۚ وَكُلًّا وَعَدَ اللَّهُ الْحُسْنَىٰ ۚ وَفَضَّلَ اللَّهُ الْمُجَاهِدِينَ عَلَى الْقَاعِدِينَ أَجْرًا عَظِيمًا",
      "verseStringB": "The holders-back from among the believers, not disabled by injury, and those who strive hard in Allāh’s way with their property and their persons, are not equal. Allāh has made the strivers with their property and their persons to excel the holdersback a (high) degree. And to each Allāh has promised good. And Allāh has granted to the strivers above the holders-back a mighty reward —"
    },
    {
      "verseNumber": 96,
      "verseString": "دَرَجَاتٍ مِنْهُ وَمَغْفِرَةً وَرَحْمَةً ۚ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا",
      "verseStringB": "(High) degrees from Him and protection and mercy. And Allāh is ever Forgiving, Merciful."
    },
    {
      "verseNumber": 97,
      "verseString": "إِنَّ الَّذِينَ تَوَفَّاهُمُ الْمَلَائِكَةُ ظَالِمِي أَنْفُسِهِمْ قَالُوا فِيمَ كُنْتُمْ ۖ قَالُوا كُنَّا مُسْتَضْعَفِينَ فِي الْأَرْضِ ۚ قَالُوا أَلَمْ تَكُنْ أَرْضُ اللَّهِ وَاسِعَةً فَتُهَاجِرُوا فِيهَا ۚ فَأُولَٰئِكَ مَأْوَاهُمْ جَهَنَّمُ ۖ وَسَاءَتْ مَصِيرًا",
      "verseStringB": "(As for) those whom the angels cause to die while they are unjust to themselves, (the angels) will say: What were you doing? They will say: We were weak in the earth. (They will) say: Was not Allāh’s earth spacious, so that you could have migrated therein? So these it is whose refuge is hell — and it is an evil resort.ᵃ"
    },
    {
      "verseNumber": 98,
      "verseString": "إِلَّا الْمُسْتَضْعَفِينَ مِنَ الرِّجَالِ وَالنِّسَاءِ وَالْوِلْدَانِ لَا يَسْتَطِيعُونَ حِيلَةً وَلَا يَهْتَدُونَ سَبِيلًا",
      "verseStringB": "Except the weak from among the men and the women and the children who have not the means, nor can they find a way (to escape);"
    },
    {
      "verseNumber": 99,
      "verseString": "فَأُولَٰئِكَ عَسَى اللَّهُ أَنْ يَعْفُوَ عَنْهُمْ ۚ وَكَانَ اللَّهُ عَفُوًّا غَفُورًا",
      "verseStringB": "So these, it may be that Allāh will pardon them. And Allāh is ever Pardoning, Forgiving."
    },
    {
      "verseNumber": 100,
      "verseString": "وَمَنْ يُهَاجِرْ فِي سَبِيلِ اللَّهِ يَجِدْ فِي الْأَرْضِ مُرَاغَمًا كَثِيرًا وَسَعَةً ۚ وَمَنْ يَخْرُجْ مِنْ بَيْتِهِ مُهَاجِرًا إِلَى اللَّهِ وَرَسُولِهِ ثُمَّ يُدْرِكْهُ الْمَوْتُ فَقَدْ وَقَعَ أَجْرُهُ عَلَى اللَّهِ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا",
      "verseStringB": "And whoever flees in Allāh’s way, he will find in the earth many a place of escape and abundant resources. And whoever goes forth from his home fleeing to Allāh and His Messenger, then death overtakes him, his reward is indeed with Allāh. And Allāh is ever Forgiving, Merciful."
    },
    {
      "verseNumber": 101,
      "verseString": "وَإِذَا ضَرَبْتُمْ فِي الْأَرْضِ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَقْصُرُوا مِنَ الصَّلَاةِ إِنْ خِفْتُمْ أَنْ يَفْتِنَكُمُ الَّذِينَ كَفَرُوا ۚ إِنَّ الْكَافِرِينَ كَانُوا لَكُمْ عَدُوًّا مُبِينًا",
      "verseStringB": "And when you journey in the earth, there is no blame on you if you shorten the prayer, if you fear that those who disbelieve will give you trouble.ᵃ Surely the disbelievers are an open enemy to you."
    },
    {
      "verseNumber": 102,
      "verseString": "وَإِذَا كُنْتَ فِيهِمْ فَأَقَمْتَ لَهُمُ الصَّلَاةَ فَلْتَقُمْ طَائِفَةٌ مِنْهُمْ مَعَكَ وَلْيَأْخُذُوا أَسْلِحَتَهُمْ فَإِذَا سَجَدُوا فَلْيَكُونُوا مِنْ وَرَائِكُمْ وَلْتَأْتِ طَائِفَةٌ أُخْرَىٰ لَمْ يُصَلُّوا فَلْيُصَلُّوا مَعَكَ وَلْيَأْخُذُوا حِذْرَهُمْ وَأَسْلِحَتَهُمْ ۗ وَدَّ الَّذِينَ كَفَرُوا لَوْ تَغْفُلُونَ عَنْ أَسْلِحَتِكُمْ وَأَمْتِعَتِكُمْ فَيَمِيلُونَ عَلَيْكُمْ مَيْلَةً وَاحِدَةً ۚ وَلَا جُنَاحَ عَلَيْكُمْ إِنْ كَانَ بِكُمْ أَذًى مِنْ مَطَرٍ أَوْ كُنْتُمْ مَرْضَىٰ أَنْ تَضَعُوا أَسْلِحَتَكُمْ ۖ وَخُذُوا حِذْرَكُمْ ۗ إِنَّ اللَّهَ أَعَدَّ لِلْكَافِرِينَ عَذَابًا مُهِينًا",
      "verseStringB": "And when thou art among them and leadest the prayer for them, let a party of them stand up with thee, and let them take their arms. Then when they have performed their prostration, let them go to your rear, and let another party who have not prayed come forward and pray with thee, and let them take their precautions and their arms. Those who disbelieve long that you may neglect your arms and your baggage, that they may attack you with a sudden united attack. And there is no blame on you, if you are inconvenienced on account of rain or if you are sick, to put away your arms; and take your precautions. Surely Allāh has prepared abasing chastisement for the disbelievers.ᵃ"
    },
    {
      "verseNumber": 103,
      "verseString": "فَإِذَا قَضَيْتُمُ الصَّلَاةَ فَاذْكُرُوا اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِكُمْ ۚ فَإِذَا اطْمَأْنَنْتُمْ فَأَقِيمُوا الصَّلَاةَ ۚ إِنَّ الصَّلَاةَ كَانَتْ عَلَى الْمُؤْمِنِينَ كِتَابًا مَوْقُوتًا",
      "verseStringB": "So when you have finished the prayer, remember Allāh standing and sitting and reclining. But when you are secure (from danger) keep up (regular) prayer. Prayer indeed has been enjoined on the believers at fixed times.ᵃ"
    },
    {
      "verseNumber": 104,
      "verseString": "وَلَا تَهِنُوا فِي ابْتِغَاءِ الْقَوْمِ ۖ إِنْ تَكُونُوا تَأْلَمُونَ فَإِنَّهُمْ يَأْلَمُونَ كَمَا تَأْلَمُونَ ۖ وَتَرْجُونَ مِنَ اللَّهِ مَا لَا يَرْجُونَ ۗ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا",
      "verseStringB": "And be not weak-hearted in pursuit of the enemy. If you suffer they (too) suffer as you suffer, and you hope from Allāh what they hope not. And Allāh is ever Knowing, Wise."
    },
    {
      "verseNumber": 105,
      "verseString": "إِنَّا أَنْزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ لِتَحْكُمَ بَيْنَ النَّاسِ بِمَا أَرَاكَ اللَّهُ ۚ وَلَا تَكُنْ لِلْخَائِنِينَ خَصِيمًا",
      "verseStringB": "Surely We have revealed the Book to thee with truth that thou mayest judge between people by means of what Allāh has taught thee. And be not one pleading the cause of the dishonest,ᵃ"
    },
    {
      "verseNumber": 106,
      "verseString": "وَاسْتَغْفِرِ اللَّهَ ۖ إِنَّ اللَّهَ كَانَ غَفُورًا رَحِيمًا",
      "verseStringB": "And ask the forgiveness of Allāh. Surely Allāh is ever Forgiving, Merciful.ᵃ"
    },
    {
      "verseNumber": 107,
      "verseString": "وَلَا تُجَادِلْ عَنِ الَّذِينَ يَخْتَانُونَ أَنْفُسَهُمْ ۚ إِنَّ اللَّهَ لَا يُحِبُّ مَنْ كَانَ خَوَّانًا أَثِيمًا",
      "verseStringB": "And contend not on behalf of those who act unfaithfully to their souls. Surely Allāh loves not him who is treacherous, sinful:"
    },
    {
      "verseNumber": 108,
      "verseString": "يَسْتَخْفُونَ مِنَ النَّاسِ وَلَا يَسْتَخْفُونَ مِنَ اللَّهِ وَهُوَ مَعَهُمْ إِذْ يُبَيِّتُونَ مَا لَا يَرْضَىٰ مِنَ الْقَوْلِ ۚ وَكَانَ اللَّهُ بِمَا يَعْمَلُونَ مُحِيطًا",
      "verseStringB": "They seek to hide from men and they cannot hide from Allāh, and He is with them when they counsel by night matters which please Him not. And Allāh ever encompasses what they do.ᵃ"
    },
    {
      "verseNumber": 109,
      "verseString": "هَا أَنْتُمْ هَٰؤُلَاءِ جَادَلْتُمْ عَنْهُمْ فِي الْحَيَاةِ الدُّنْيَا فَمَنْ يُجَادِلُ اللَّهَ عَنْهُمْ يَوْمَ الْقِيَامَةِ أَمْ مَنْ يَكُونُ عَلَيْهِمْ وَكِيلًا",
      "verseStringB": "Behold! You are they who may contend on their behalf in this world’s life, but who will contend with Allāh on their behalf on the Resurrection day, or who will have charge of their affairs?"
    },
    {
      "verseNumber": 110,
      "verseString": "وَمَنْ يَعْمَلْ سُوءًا أَوْ يَظْلِمْ نَفْسَهُ ثُمَّ يَسْتَغْفِرِ اللَّهَ يَجِدِ اللَّهَ غَفُورًا رَحِيمًا",
      "verseStringB": "And whoever does evil or wrongs his soul, then asks forgiveness of Allāh, will find Allāh Forgiving, Merciful."
    },
    {
      "verseNumber": 111,
      "verseString": "وَمَنْ يَكْسِبْ إِثْمًا فَإِنَّمَا يَكْسِبُهُ عَلَىٰ نَفْسِهِ ۚ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا",
      "verseStringB": "And whoever commits a sin, commits it only against himself. And Allāh is ever Knowing, Wise."
    },
    {
      "verseNumber": 112,
      "verseString": "وَمَنْ يَكْسِبْ خَطِيئَةً أَوْ إِثْمًا ثُمَّ يَرْمِ بِهِ بَرِيئًا فَقَدِ احْتَمَلَ بُهْتَانًا وَإِثْمًا مُبِينًا",
      "verseStringB": "And whoever commits a fault or a sin, then accuses of it one innocent, he indeed takes upon himself the burden of a calumny and a manifest sin."
    },
    {
      "verseNumber": 113,
      "verseString": "وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكَ وَرَحْمَتُهُ لَهَمَّتْ طَائِفَةٌ مِنْهُمْ أَنْ يُضِلُّوكَ وَمَا يُضِلُّونَ إِلَّا أَنْفُسَهُمْ ۖ وَمَا يَضُرُّونَكَ مِنْ شَيْءٍ ۚ وَأَنْزَلَ اللَّهُ عَلَيْكَ الْكِتَابَ وَالْحِكْمَةَ وَعَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ ۚ وَكَانَ فَضْلُ اللَّهِ عَلَيْكَ عَظِيمًا",
      "verseStringB": "And were it not for Allāh’s grace upon thee and His mercy, a party of them had certainly designed to ruin thee. And they ruin only themselves,ᵃ and they cannot harm thee in any way. And Allāh has revealed to thee the Book and the Wisdom, and taught thee what thou knewest not, and Allāh’s grace on thee is very great."
    },
    {
      "verseNumber": 114,
      "verseString": "لَا خَيْرَ فِي كَثِيرٍ مِنْ نَجْوَاهُمْ إِلَّا مَنْ أَمَرَ بِصَدَقَةٍ أَوْ مَعْرُوفٍ أَوْ إِصْلَاحٍ بَيْنَ النَّاسِ ۚ وَمَنْ يَفْعَلْ ذَٰلِكَ ابْتِغَاءَ مَرْضَاتِ اللَّهِ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًا",
      "verseStringB": "There is no good in most of their secret counsels except (in) him who enjoins charity or goodness or recon - cili ation between people. And whoever does this, seeking Allāh’s pleasure, We shall give him a mighty reward."
    },
    {
      "verseNumber": 115,
      "verseString": "وَمَنْ يُشَاقِقِ الرَّسُولَ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُ الْهُدَىٰ وَيَتَّبِعْ غَيْرَ سَبِيلِ الْمُؤْمِنِينَ نُوَلِّهِ مَا تَوَلَّىٰ وَنُصْلِهِ جَهَنَّمَ ۖ وَسَاءَتْ مَصِيرًا",
      "verseStringB": "And whoever acts hostilely to the Messenger after guidance has become manifest to him and follows other than the way of the believers, We turn him to that to which he (himself) turns and make him enter hell; and it is an evil resort.ᵃ"
    },
    {
      "verseNumber": 116,
      "verseString": "إِنَّ اللَّهَ لَا يَغْفِرُ أَنْ يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَنْ يَشَاءُ ۚ وَمَنْ يُشْرِكْ بِاللَّهِ فَقَدْ ضَلَّ ضَلَالًا بَعِيدًا",
      "verseStringB": "Surely Allāh forgives not setting up partners with Him, and He forgives all besides this to whom He pleases. And whoever sets up a partner with Allāh, he indeed goes far astray."
    },
    {
      "verseNumber": 117,
      "verseString": "إِنْ يَدْعُونَ مِنْ دُونِهِ إِلَّا إِنَاثًا وَإِنْ يَدْعُونَ إِلَّا شَيْطَانًا مَرِيدًا",
      "verseStringB": "Besides Him they call on nothing but female divinitiesa and they call on nothing but a rebellious devil,ᵇ"
    },
    {
      "verseNumber": 118,
      "verseString": "لَعَنَهُ اللَّهُ ۘ وَقَالَ لَأَتَّخِذَنَّ مِنْ عِبَادِكَ نَصِيبًا مَفْرُوضًا",
      "verseStringB": "Whom Allāh has cursed. And he said: Certainly I will take of Thy servants an appointed portion;"
    },
    {
      "verseNumber": 119,
      "verseString": "وَلَأُضِلَّنَّهُمْ وَلَأُمَنِّيَنَّهُمْ وَلَآمُرَنَّهُمْ فَلَيُبَتِّكُنَّ آذَانَ الْأَنْعَامِ وَلَآمُرَنَّهُمْ فَلَيُغَيِّرُنَّ خَلْقَ اللَّهِ ۚ وَمَنْ يَتَّخِذِ الشَّيْطَانَ وَلِيًّا مِنْ دُونِ اللَّهِ فَقَدْ خَسِرَ خُسْرَانًا مُبِينًا",
      "verseStringB": "And certainly I will lead them astray and excite in them vain desires and bid them so that they will slit the ears of the cattle,ᵃ and bid them so that they will alter Allāh’s creation.ᵇ And whoever takes the devil for a friend, forsaking Allāh, he indeed suffers a manifest loss."
    },
    {
      "verseNumber": 120,
      "verseString": "يَعِدُهُمْ وَيُمَنِّيهِمْ ۖ وَمَا يَعِدُهُمُ الشَّيْطَانُ إِلَّا غُرُورًا",
      "verseStringB": "He promises them and excites vain desires in them. And the devil promises them only to deceive."
    },
    {
      "verseNumber": 121,
      "verseString": "أُولَٰئِكَ مَأْوَاهُمْ جَهَنَّمُ وَلَا يَجِدُونَ عَنْهَا مَحِيصًا",
      "verseStringB": "These — their refuge is hell, and they will find no way of escape from it."
    },
    {
      "verseNumber": 122,
      "verseString": "وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَنُدْخِلُهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۖ وَعْدَ اللَّهِ حَقًّا ۚ وَمَنْ أَصْدَقُ مِنَ اللَّهِ قِيلًا",
      "verseStringB": "And those who believe and do good, We shall make them enter Gardens in which rivers flow, to abide therein forever. It is Allāh’s promise, in truth. And who is more truthful in word than Allāh?"
    },
    {
      "verseNumber": 123,
      "verseString": "لَيْسَ بِأَمَانِيِّكُمْ وَلَا أَمَانِيِّ أَهْلِ الْكِتَابِ ۗ مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ وَلَا يَجِدْ لَهُ مِنْ دُونِ اللَّهِ وَلِيًّا وَلَا نَصِيرًا",
      "verseStringB": "It will not be in accordance with your vain desiresa nor the vain desires of the People of the Book. Whoever does evil, will be requited for it and will not find for himself besides Allāh a friend or a helper."
    },
    {
      "verseNumber": 124,
      "verseString": "وَمَنْ يَعْمَلْ مِنَ الصَّالِحَاتِ مِنْ ذَكَرٍ أَوْ أُنْثَىٰ وَهُوَ مُؤْمِنٌ فَأُولَٰئِكَ يَدْخُلُونَ الْجَنَّةَ وَلَا يُظْلَمُونَ نَقِيرًا",
      "verseStringB": "And whoever does good deeds, whether male or female, and he (or she) is a believer — these will enter the Garden, and they will not be dealt with a whit unjustly."
    },
    {
      "verseNumber": 125,
      "verseString": "وَمَنْ أَحْسَنُ دِينًا مِمَّنْ أَسْلَمَ وَجْهَهُ لِلَّهِ وَهُوَ مُحْسِنٌ وَاتَّبَعَ مِلَّةَ إِبْرَاهِيمَ حَنِيفًا ۗ وَاتَّخَذَ اللَّهُ إِبْرَاهِيمَ خَلِيلًا",
      "verseStringB": "And who is better in religion than he who submits himself entirely to Allāh while doing good (to others) and follows the faith of Abraham, the upright one? And Allāh took Abraham for a friend."
    },
    {
      "verseNumber": 126,
      "verseString": "وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ مُحِيطًا",
      "verseStringB": "And to Allāh belongs whatever is in the heavens and whatever is in the earth. And Allāh ever encompasses all things."
    },
    {
      "verseNumber": 127,
      "verseString": "وَيَسْتَفْتُونَكَ فِي النِّسَاءِ ۖ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ وَمَا يُتْلَىٰ عَلَيْكُمْ فِي الْكِتَابِ فِي يَتَامَى النِّسَاءِ اللَّاتِي لَا تُؤْتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ وَالْمُسْتَضْعَفِينَ مِنَ الْوِلْدَانِ وَأَنْ تَقُومُوا لِلْيَتَامَىٰ بِالْقِسْطِ ۚ وَمَا تَفْعَلُوا مِنْ خَيْرٍ فَإِنَّ اللَّهَ كَانَ بِهِ عَلِيمًا",
      "verseStringB": "And they ask thee a decision about women. Say: Allāh makes known to you His decision concerning them; and that which is recited to you in the Book is concerning widowed women, whom you give not what is appointed for them, while you are not inclined to marry them, nor to the weak among children, and that you should deal justly with orphans. And whatever good you do, Allāh is surely ever Knower of it.ᵃ"
    },
    {
      "verseNumber": 128,
      "verseString": "وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا فَلَا جُنَاحَ عَلَيْهِمَا أَنْ يُصْلِحَا بَيْنَهُمَا صُلْحًا ۚ وَالصُّلْحُ خَيْرٌ ۗ وَأُحْضِرَتِ الْأَنْفُسُ الشُّحَّ ۚ وَإِنْ تُحْسِنُوا وَتَتَّقُوا فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا",
      "verseStringB": "And if a woman fears ill-usage from her husband or desertiona no blame is on them if they effect a reconciliation between them. And reconciliation is better. And avarice is met with in (men’s) minds. And if you do good (to others) and keep your duty, surely Allāh is ever Aware of what you do."
    },
    {
      "verseNumber": 129,
      "verseString": "وَلَنْ تَسْتَطِيعُوا أَنْ تَعْدِلُوا بَيْنَ النِّسَاءِ وَلَوْ حَرَصْتُمْ ۖ فَلَا تَمِيلُوا كُلَّ الْمَيْلِ فَتَذَرُوهَا كَالْمُعَلَّقَةِ ۚ وَإِنْ تُصْلِحُوا وَتَتَّقُوا فَإِنَّ اللَّهَ كَانَ غَفُورًا رَحِيمًا",
      "verseStringB": "And you cannot do justice between wives, even though you wish (it), but be not disinclined (from one) with total disinclInᵃ tion, so that you leave her in suspense. And if you are reconciled and keep your duty, surely Allāh is ever Forgiving, Merciful."
    },
    {
      "verseNumber": 130,
      "verseString": "وَإِنْ يَتَفَرَّقَا يُغْنِ اللَّهُ كُلًّا مِنْ سَعَتِهِ ۚ وَكَانَ اللَّهُ وَاسِعًا حَكِيمًا",
      "verseStringB": "And if they separate, Allāh will render them both free from want out of His ampleness. And Allāh is ever Ample-giving, Wise."
    },
    {
      "verseNumber": 131,
      "verseString": "وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَلَقَدْ وَصَّيْنَا الَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلِكُمْ وَإِيَّاكُمْ أَنِ اتَّقُوا اللَّهَ ۚ وَإِنْ تَكْفُرُوا فَإِنَّ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَكَانَ اللَّهُ غَنِيًّا حَمِيدًا",
      "verseStringB": "And to Allāh belongs whatever is in the heavens and whatever is in the earth. And certainly We enjoined those who were given the Book before you and (We enjoin) you too to keep your duty to Allāh. And if you disbelieve, surely to Allāh belongs whatever is in the heavens and whatever is in the earth. And Allāh is ever Self-sufficient, Praiseworthy."
    },
    {
      "verseNumber": 132,
      "verseString": "وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا",
      "verseStringB": "And to Allāh belongs whatever is in the heavens and whatever is in the earth. And Allāh suffices as having charge of affairs."
    },
    {
      "verseNumber": 133,
      "verseString": "إِنْ يَشَأْ يُذْهِبْكُمْ أَيُّهَا النَّاسُ وَيَأْتِ بِآخَرِينَ ۚ وَكَانَ اللَّهُ عَلَىٰ ذَٰلِكَ قَدِيرًا",
      "verseStringB": "If He please, He will take you away, O people, and bring others. And Allāh is ever Powerful to do that."
    },
    {
      "verseNumber": 134,
      "verseString": "مَنْ كَانَ يُرِيدُ ثَوَابَ الدُّنْيَا فَعِنْدَ اللَّهِ ثَوَابُ الدُّنْيَا وَالْآخِرَةِ ۚ وَكَانَ اللَّهُ سَمِيعًا بَصِيرًا",
      "verseStringB": "Whoever desires the reward of this world — then with Allāh is the reward of this world and the Hereafter. And Allāh is ever Hearing, Seeing."
    },
    {
      "verseNumber": 135,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ بِالْقِسْطِ شُهَدَاءَ لِلَّهِ وَلَوْ عَلَىٰ أَنْفُسِكُمْ أَوِ الْوَالِدَيْنِ وَالْأَقْرَبِينَ ۚ إِنْ يَكُنْ غَنِيًّا أَوْ فَقِيرًا فَاللَّهُ أَوْلَىٰ بِهِمَا ۖ فَلَا تَتَّبِعُوا الْهَوَىٰ أَنْ تَعْدِلُوا ۚ وَإِنْ تَلْوُوا أَوْ تُعْرِضُوا فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا",
      "verseStringB": "O you who believe, be maintainers of justice, bearers of witness for Allāh, even though it be against your own selves or (your) parents or near relatives — whether he be rich or poor, Allāh has a better right over them both.ᵃ So follow not (your) low desires, lest you deviate. And if you distort or turn away from (truth), surely Allāh is ever Aware of what you do."
    },
    {
      "verseNumber": 136,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا بِاللَّهِ وَرَسُولِهِ وَالْكِتَابِ الَّذِي نَزَّلَ عَلَىٰ رَسُولِهِ وَالْكِتَابِ الَّذِي أَنْزَلَ مِنْ قَبْلُ ۚ وَمَنْ يَكْفُرْ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ فَقَدْ ضَلَّ ضَلَالًا بَعِيدًا",
      "verseStringB": "O you who believe, believe in Allāh and His Messenger and the Book which He has revealed to His Messenger and the Book which He revealed before. And whoever disbelieves in Allāh and His angels and His Books and His messengers and the Last Day, he indeed strays far away."
    },
    {
      "verseNumber": 137,
      "verseString": "إِنَّ الَّذِينَ آمَنُوا ثُمَّ كَفَرُوا ثُمَّ آمَنُوا ثُمَّ كَفَرُوا ثُمَّ ازْدَادُوا كُفْرًا لَمْ يَكُنِ اللَّهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ سَبِيلًا",
      "verseStringB": "Those who believe then dis - believe, again believe and again disbelieve, then increase in disbelief, Allāh will never forgive them nor guide them in the (right) way.ᵇ"
    },
    {
      "verseNumber": 138,
      "verseString": "بَشِّرِ الْمُنَافِقِينَ بِأَنَّ لَهُمْ عَذَابًا أَلِيمًا",
      "verseStringB": "Give news to the hypocrites that for them is a painful chastisementa—"
    },
    {
      "verseNumber": 139,
      "verseString": "الَّذِينَ يَتَّخِذُونَ الْكَافِرِينَ أَوْلِيَاءَ مِنْ دُونِ الْمُؤْمِنِينَ ۚ أَيَبْتَغُونَ عِنْدَهُمُ الْعِزَّةَ فَإِنَّ الْعِزَّةَ لِلَّهِ جَمِيعًا",
      "verseStringB": "Those who take disbelievers for friends rather than believers. Do they seek for might from them? Might surely belongs wholly to Allāh."
    },
    {
      "verseNumber": 140,
      "verseString": "وَقَدْ نَزَّلَ عَلَيْكُمْ فِي الْكِتَابِ أَنْ إِذَا سَمِعْتُمْ آيَاتِ اللَّهِ يُكْفَرُ بِهَا وَيُسْتَهْزَأُ بِهَا فَلَا تَقْعُدُوا مَعَهُمْ حَتَّىٰ يَخُوضُوا فِي حَدِيثٍ غَيْرِهِ ۚ إِنَّكُمْ إِذًا مِثْلُهُمْ ۗ إِنَّ اللَّهَ جَامِعُ الْمُنَافِقِينَ وَالْكَافِرِينَ فِي جَهَنَّمَ جَمِيعًا",
      "verseStringB": "And indeed He has revealed to you in the Book that when you hear Allāh’s messages disbelieved in and mocked at, sit not with them until they enter into some other discourse, for then indeed you would be like them. Surely Allāh will gather together the hypocrites and the disbelievers all in hella—"
    },
    {
      "verseNumber": 141,
      "verseString": "الَّذِينَ يَتَرَبَّصُونَ بِكُمْ فَإِنْ كَانَ لَكُمْ فَتْحٌ مِنَ اللَّهِ قَالُوا أَلَمْ نَكُنْ مَعَكُمْ وَإِنْ كَانَ لِلْكَافِرِينَ نَصِيبٌ قَالُوا أَلَمْ نَسْتَحْوِذْ عَلَيْكُمْ وَنَمْنَعْكُمْ مِنَ الْمُؤْمِنِينَ ۚ فَاللَّهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ الْقِيَامَةِ ۗ وَلَنْ يَجْعَلَ اللَّهُ لِلْكَافِرِينَ عَلَى الْمُؤْمِنِينَ سَبِيلًا",
      "verseStringB": "Those who wait (for misfortunes) for you. Then if you have a victory from Allāh they say: Were we not with you? And if there is a chance for the disbelievers, they say: Did we not prevail over you and defend you from the believers? So Allāh will judge between you on the day of Resurrection. And Allāh will by no means give the disbelievers a way against the believers."
    },
    {
      "verseNumber": 142,
      "verseString": "إِنَّ الْمُنَافِقِينَ يُخَادِعُونَ اللَّهَ وَهُوَ خَادِعُهُمْ وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَىٰ يُرَاءُونَ النَّاسَ وَلَا يَذْكُرُونَ اللَّهَ إِلَّا قَلِيلًا",
      "verseStringB": "The hypocrites seek to deceive Allāh, and He will requite their deceit to them.ᵃ And when they stand up for prayer, they stand up sluggishly — they do it only to be seen of men and remember Allāh but little,"
    },
    {
      "verseNumber": 143,
      "verseString": "مُذَبْذَبِينَ بَيْنَ ذَٰلِكَ لَا إِلَىٰ هَٰؤُلَاءِ وَلَا إِلَىٰ هَٰؤُلَاءِ ۚ وَمَنْ يُضْلِلِ اللَّهُ فَلَنْ تَجِدَ لَهُ سَبِيلًا",
      "verseStringB": "Wavering between that (and this) — (belonging) neither to these nor to those.ᵃ And whomsoever Allāh leaves in error, thou wilt not find a way for him."
    },
    {
      "verseNumber": 144,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا الْكَافِرِينَ أَوْلِيَاءَ مِنْ دُونِ الْمُؤْمِنِينَ ۚ أَتُرِيدُونَ أَنْ تَجْعَلُوا لِلَّهِ عَلَيْكُمْ سُلْطَانًا مُبِينًا",
      "verseStringB": "O you who believe, take not the disbelievers for friends rather than the believers. Do you desire to give Allāh a manifest proof against yourselves?"
    },
    {
      "verseNumber": 145,
      "verseString": "إِنَّ الْمُنَافِقِينَ فِي الدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ وَلَنْ تَجِدَ لَهُمْ نَصِيرًا",
      "verseStringB": "The hypocrites are surely in the lowest depths of the Fire,ᵃ and thou wilt find no helper for them,"
    },
    {
      "verseNumber": 146,
      "verseString": "إِلَّا الَّذِينَ تَابُوا وَأَصْلَحُوا وَاعْتَصَمُوا بِاللَّهِ وَأَخْلَصُوا دِينَهُمْ لِلَّهِ فَأُولَٰئِكَ مَعَ الْمُؤْمِنِينَ ۖ وَسَوْفَ يُؤْتِ اللَّهُ الْمُؤْمِنِينَ أَجْرًا عَظِيمًا",
      "verseStringB": "Save those who repent and amend and hold fast to Allāh and are sincere in their obedience to Allāh — these are with the believers. And Allāh will soon grant the believers a mighty reward."
    },
    {
      "verseNumber": 147,
      "verseString": "مَا يَفْعَلُ اللَّهُ بِعَذَابِكُمْ إِنْ شَكَرْتُمْ وَآمَنْتُمْ ۚ وَكَانَ اللَّهُ شَاكِرًا عَلِيمًا",
      "verseStringB": "Why should Allāh chastise you if you are grateful and believe? And Allāh is ever Multiplier of rewards,ᵃ Knowing."
    },
    {
      "verseNumber": 148,
      "verseString": "لَا يُحِبُّ اللَّهُ الْجَهْرَ بِالسُّوءِ مِنَ الْقَوْلِ إِلَّا مَنْ ظُلِمَ ۚ وَكَانَ اللَّهُ سَمِيعًا عَلِيمًا",
      "verseStringB": "Allāh loves not the public utterance of hurtful speech, except by one who has been wronged.ᵃ And Allāh is ever Hearing, Knowing."
    },
    {
      "verseNumber": 149,
      "verseString": "إِنْ تُبْدُوا خَيْرًا أَوْ تُخْفُوهُ أَوْ تَعْفُوا عَنْ سُوءٍ فَإِنَّ اللَّهَ كَانَ عَفُوًّا قَدِيرًا",
      "verseStringB": "If you do good openly or keep it secret or pardon an evil, Allāh surely is ever Pardoning, Powerful.ᵃ"
    },
    {
      "verseNumber": 150,
      "verseString": "إِنَّ الَّذِينَ يَكْفُرُونَ بِاللَّهِ وَرُسُلِهِ وَيُرِيدُونَ أَنْ يُفَرِّقُوا بَيْنَ اللَّهِ وَرُسُلِهِ وَيَقُولُونَ نُؤْمِنُ بِبَعْضٍ وَنَكْفُرُ بِبَعْضٍ وَيُرِيدُونَ أَنْ يَتَّخِذُوا بَيْنَ ذَٰلِكَ سَبِيلًا",
      "verseStringB": "Those who disbelieve in Allāh and His messengers and desire to make a distinction between Allāh and His messengers and say: We believe in some and disbelieve in others; and desire to take a course in between —"
    },
    {
      "verseNumber": 151,
      "verseString": "أُولَٰئِكَ هُمُ الْكَافِرُونَ حَقًّا ۚ وَأَعْتَدْنَا لِلْكَافِرِينَ عَذَابًا مُهِينًا",
      "verseStringB": "These are truly disbelievers; and We have prepared for the disbelievers an abasing chastisement."
    },
    {
      "verseNumber": 152,
      "verseString": "وَالَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ وَلَمْ يُفَرِّقُوا بَيْنَ أَحَدٍ مِنْهُمْ أُولَٰئِكَ سَوْفَ يُؤْتِيهِمْ أُجُورَهُمْ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا",
      "verseStringB": "And those who believe in Allāh and His messengers and make no distinction between any of them, to them He will grant their rewards. And"
    },
    {
      "verseNumber": 153,
      "verseString": "يَسْأَلُكَ أَهْلُ الْكِتَابِ أَنْ تُنَزِّلَ عَلَيْهِمْ كِتَابًا مِنَ السَّمَاءِ ۚ فَقَدْ سَأَلُوا مُوسَىٰ أَكْبَرَ مِنْ ذَٰلِكَ فَقَالُوا أَرِنَا اللَّهَ جَهْرَةً فَأَخَذَتْهُمُ الصَّاعِقَةُ بِظُلْمِهِمْ ۚ ثُمَّ اتَّخَذُوا الْعِجْلَ مِنْ بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَاتُ فَعَفَوْنَا عَنْ ذَٰلِكَ ۚ وَآتَيْنَا مُوسَىٰ سُلْطَانًا مُبِينًا",
      "verseStringB": "The People of the Book ask thee to bring down to them a Book from heaven; indeed they demanded of Moses a greater thing than that, for they said: Show us Allāh manifestly. So destructive punishment overtook them on account of their wrongdoing. Then they took the calf (for a god), after clear signs had come to them, but We pardoned this. And We gave Moses clear authority."
    },
    {
      "verseNumber": 154,
      "verseString": "وَرَفَعْنَا فَوْقَهُمُ الطُّورَ بِمِيثَاقِهِمْ وَقُلْنَا لَهُمُ ادْخُلُوا الْبَابَ سُجَّدًا وَقُلْنَا لَهُمْ لَا تَعْدُوا فِي السَّبْتِ وَأَخَذْنَا مِنْهُمْ مِيثَاقًا غَلِيظًا",
      "verseStringB": "And We raised the mountain above them at their covenant. And We said to them: Enter the door making obeisance. And We said to them: Violate not the Sabbath; and We took from them a firm covenant."
    },
    {
      "verseNumber": 155,
      "verseString": "فَبِمَا نَقْضِهِمْ مِيثَاقَهُمْ وَكُفْرِهِمْ بِآيَاتِ اللَّهِ وَقَتْلِهِمُ الْأَنْبِيَاءَ بِغَيْرِ حَقٍّ وَقَوْلِهِمْ قُلُوبُنَا غُلْفٌ ۚ بَلْ طَبَعَ اللَّهُ عَلَيْهَا بِكُفْرِهِمْ فَلَا يُؤْمِنُونَ إِلَّا قَلِيلًا",
      "verseStringB": "Then for their breaking their covenant and their disbelief in the messages of Allāh and their killing the prophets wrongfully and their saying, Our hearts are covered; nay, Allāh has sealed them owing to their disbelief, so they believe not but a little:ᵃ"
    },
    {
      "verseNumber": 156,
      "verseString": "وَبِكُفْرِهِمْ وَقَوْلِهِمْ عَلَىٰ مَرْيَمَ بُهْتَانًا عَظِيمًا",
      "verseStringB": "And for their disbelief and for their uttering against Mary a grievous calumny:ᵃ"
    },
    {
      "verseNumber": 157,
      "verseString": "وَقَوْلِهِمْ إِنَّا قَتَلْنَا الْمَسِيحَ عِيسَى ابْنَ مَرْيَمَ رَسُولَ اللَّهِ وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَٰكِنْ شُبِّهَ لَهُمْ ۚ وَإِنَّ الَّذِينَ اخْتَلَفُوا فِيهِ لَفِي شَكٍّ مِنْهُ ۚ مَا لَهُمْ بِهِ مِنْ عِلْمٍ إِلَّا اتِّبَاعَ الظَّنِّ ۚ وَمَا قَتَلُوهُ يَقِينًا",
      "verseStringB": "And for their saying: We have killed the Messiah, Jesus, son of Mary, the messenger of Allāh, and they killed him not, nor did they cause his death on the cross,ᵃ but he was made to appear to them as such.ᵇ And certainly those who differ therein are in doubt about it. They have no knowledge about it, but only follow a conjecture, and they killed him not for certain:"
    },
    {
      "verseNumber": 158,
      "verseString": "بَلْ رَفَعَهُ اللَّهُ إِلَيْهِ ۚ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا",
      "verseStringB": "Nay, Allāh exalted him in His presence. And Allāh is ever Mighty,"
    },
    {
      "verseNumber": 159,
      "verseString": "وَإِنْ مِنْ أَهْلِ الْكِتَابِ إِلَّا لَيُؤْمِنَنَّ بِهِ قَبْلَ مَوْتِهِ ۖ وَيَوْمَ الْقِيَامَةِ يَكُونُ عَلَيْهِمْ شَهِيدًا",
      "verseStringB": "And there is none of the People of the Book but will believe in this before his death; and on the day of Resurrection he will be a witness against them.ᵃ"
    },
    {
      "verseNumber": 160,
      "verseString": "فَبِظُلْمٍ مِنَ الَّذِينَ هَادُوا حَرَّمْنَا عَلَيْهِمْ طَيِّبَاتٍ أُحِلَّتْ لَهُمْ وَبِصَدِّهِمْ عَنْ سَبِيلِ اللَّهِ كَثِيرًا",
      "verseStringB": "So for the iniquity of the Jews, We forbade them the good things which had been made lawful for them, and for their hindering many (people) from Allāh’s way."
    },
    {
      "verseNumber": 161,
      "verseString": "وَأَخْذِهِمُ الرِّبَا وَقَدْ نُهُوا عَنْهُ وَأَكْلِهِمْ أَمْوَالَ النَّاسِ بِالْبَاطِلِ ۚ وَأَعْتَدْنَا لِلْكَافِرِينَ مِنْهُمْ عَذَابًا أَلِيمًا",
      "verseStringB": "And for their taking usury — though indeed they were forbidden it — and their devouring the property of people falsely. And We have prepared for the disbelievers from among them a painful chastisement."
    },
    {
      "verseNumber": 162,
      "verseString": "لَٰكِنِ الرَّاسِخُونَ فِي الْعِلْمِ مِنْهُمْ وَالْمُؤْمِنُونَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ ۚ وَالْمُقِيمِينَ الصَّلَاةَ ۚ وَالْمُؤْتُونَ الزَّكَاةَ وَالْمُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أُولَٰئِكَ سَنُؤْتِيهِمْ أَجْرًا عَظِيمًا",
      "verseStringB": "But the firm in knowledge among them and the believers believe in that which has been revealed to thee and that which was revealed before thee, and those who keep up prayer and give the poor-rate and the believers in Allāh and the Last Day — these it is to whom We"
    },
    {
      "verseNumber": 163,
      "verseString": "إِنَّا أَوْحَيْنَا إِلَيْكَ كَمَا أَوْحَيْنَا إِلَىٰ نُوحٍ وَالنَّبِيِّينَ مِنْ بَعْدِهِ ۚ وَأَوْحَيْنَا إِلَىٰ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطِ وَعِيسَىٰ وَأَيُّوبَ وَيُونُسَ وَهَارُونَ وَسُلَيْمَانَ ۚ وَآتَيْنَا دَاوُودَ زَبُورًا",
      "verseStringB": "Surely We have revealed to thee as We revealed to Noah and the prophets after him, and We revealed to Abraham and Ishmael and Isaac and Jacob and the tribes, and Jesus and Job and Jonah and Aaron and Solomon, and We gave to David a scripture."
    },
    {
      "verseNumber": 164,
      "verseString": "وَرُسُلًا قَدْ قَصَصْنَاهُمْ عَلَيْكَ مِنْ قَبْلُ وَرُسُلًا لَمْ نَقْصُصْهُمْ عَلَيْكَ ۚ وَكَلَّمَ اللَّهُ مُوسَىٰ تَكْلِيمًا",
      "verseStringB": "And (We sent) messengers We have mentioned to thee before and messengers We have not mentioned to thee. And to Moses Allāh addressed His word, speaking (to"
    },
    {
      "verseNumber": 165,
      "verseString": "رُسُلًا مُبَشِّرِينَ وَمُنْذِرِينَ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَى اللَّهِ حُجَّةٌ بَعْدَ الرُّسُلِ ۚ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا",
      "verseStringB": "Messengers, bearers of good news and warners, so that the people may have no plea against Allāh after the (coming of) messengers. And Allāh is ever Mighty, Wise."
    },
    {
      "verseNumber": 166,
      "verseString": "لَٰكِنِ اللَّهُ يَشْهَدُ بِمَا أَنْزَلَ إِلَيْكَ ۖ أَنْزَلَهُ بِعِلْمِهِ ۖ وَالْمَلَائِكَةُ يَشْهَدُونَ ۚ وَكَفَىٰ بِاللَّهِ شَهِيدًا",
      "verseStringB": "But Allāh bears witness by that which He has revealed to thee that He has revealed it with His knowledge, and the angels (also) bear witness. And Allāh is sufficient as a witness."
    },
    {
      "verseNumber": 167,
      "verseString": "إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ قَدْ ضَلُّوا ضَلَالًا بَعِيدًا",
      "verseStringB": "Those who disbelieve and hinder (others) from Allāh’s way, they indeed have erred, going far astray."
    },
    {
      "verseNumber": 168,
      "verseString": "إِنَّ الَّذِينَ كَفَرُوا وَظَلَمُوا لَمْ يَكُنِ اللَّهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ طَرِيقًا",
      "verseStringB": "Those who disbelieve and act unjustly, Allāh will never forgive"
    },
    {
      "verseNumber": 169,
      "verseString": "إِلَّا طَرِيقَ جَهَنَّمَ خَالِدِينَ فِيهَا أَبَدًا ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا",
      "verseStringB": "Except the path of hell, to abide in it for a long time. And that is easy to Allāh."
    },
    {
      "verseNumber": 170,
      "verseString": "يَا أَيُّهَا النَّاسُ قَدْ جَاءَكُمُ الرَّسُولُ بِالْحَقِّ مِنْ رَبِّكُمْ فَآمِنُوا خَيْرًا لَكُمْ ۚ وَإِنْ تَكْفُرُوا فَإِنَّ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا",
      "verseStringB": "O mankind, the Messenger has indeed come to you with truth from your Lord, so believe, it is better for you. And if you disbelieve, then surely to Allāh belongs whatever is in the heavens and the earth. And Allāh is ever Knowing, Wise."
    },
    {
      "verseNumber": 171,
      "verseString": "يَا أَهْلَ الْكِتَابِ لَا تَغْلُوا فِي دِينِكُمْ وَلَا تَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ ۚ إِنَّمَا الْمَسِيحُ عِيسَى ابْنُ مَرْيَمَ رَسُولُ اللَّهِ وَكَلِمَتُهُ أَلْقَاهَا إِلَىٰ مَرْيَمَ وَرُوحٌ مِنْهُ ۖ فَآمِنُوا بِاللَّهِ وَرُسُلِهِ ۖ وَلَا تَقُولُوا ثَلَاثَةٌ ۚ انْتَهُوا خَيْرًا لَكُمْ ۚ إِنَّمَا اللَّهُ إِلَٰهٌ وَاحِدٌ ۖ سُبْحَانَهُ أَنْ يَكُونَ لَهُ وَلَدٌ ۘ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَكَفَىٰ بِاللَّهِ وَكِيلًا",
      "verseStringB": "O People of the Book, exceed not the limits in your religion nor speak anything about Allāh, but the truth. The Messiah, Jesus, son of Mary, is only a messenger of Allāh and His worda which He communicate to Mary and a mercy from Him.ᵇ So believe in Allāh and His messengers. And say not, Three. Desist, it is better for you. Allāh is only one God. Far be it from His glory to have a son. To Him belongs whatever is in the heavens and whateve is in the earth. And sufficient is Allāh as having charge of affairs."
    },
    {
      "verseNumber": 172,
      "verseString": "لَنْ يَسْتَنْكِفَ الْمَسِيحُ أَنْ يَكُونَ عَبْدًا لِلَّهِ وَلَا الْمَلَائِكَةُ الْمُقَرَّبُونَ ۚ وَمَنْ يَسْتَنْكِفْ عَنْ عِبَادَتِهِ وَيَسْتَكْبِرْ فَسَيَحْشُرُهُمْ إِلَيْهِ جَمِيعًا",
      "verseStringB": "The Messiah disdains not to be a servant of Allāh, nor do the angels who are near to Him. And whoever disdains His service and is proud, He will gather them all together to Himself."
    },
    {
      "verseNumber": 173,
      "verseString": "فَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَيُوَفِّيهِمْ أُجُورَهُمْ وَيَزِيدُهُمْ مِنْ فَضْلِهِ ۖ وَأَمَّا الَّذِينَ اسْتَنْكَفُوا وَاسْتَكْبَرُوا فَيُعَذِّبُهُمْ عَذَابًا أَلِيمًا وَلَا يَجِدُونَ لَهُمْ مِنْ دُونِ اللَّهِ وَلِيًّا وَلَا نَصِيرًا",
      "verseStringB": "Then as for those who believe and do good, He will pay them fully their rewards and give them more out of His grace. And as for those who disdain and are proud, He will chastis them with a painful chastisement, and they will find for themselves besides Allāh no friend nor helper."
    },
    {
      "verseNumber": 174,
      "verseString": "يَا أَيُّهَا النَّاسُ قَدْ جَاءَكُمْ بُرْهَانٌ مِنْ رَبِّكُمْ وَأَنْزَلْنَا إِلَيْكُمْ نُورًا مُبِينًا",
      "verseStringB": "O people, manifest proof has indeed come to you from your Lord and We have sent down to you a clear light"
    },
    {
      "verseNumber": 175,
      "verseString": "فَأَمَّا الَّذِينَ آمَنُوا بِاللَّهِ وَاعْتَصَمُوا بِهِ فَسَيُدْخِلُهُمْ فِي رَحْمَةٍ مِنْهُ وَفَضْلٍ وَيَهْدِيهِمْ إِلَيْهِ صِرَاطًا مُسْتَقِيمًا",
      "verseStringB": "Then as for those who believe in Allāh and hold fast by Him, He will admit them to His mercy and grace, and guide them to Himself on a right path"
    },
    {
      "verseNumber": 176,
      "verseString": "يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلَالَةِ ۚ إِنِ امْرُؤٌ هَلَكَ لَيْسَ لَهُ وَلَدٌ وَلَهُ أُخْتٌ فَلَهَا نِصْفُ مَا تَرَكَ ۚ وَهُوَ يَرِثُهَا إِنْ لَمْ يَكُنْ لَهَا وَلَدٌ ۚ فَإِنْ كَانَتَا اثْنَتَيْنِ فَلَهُمَا الثُّلُثَانِ مِمَّا تَرَكَ ۚ وَإِنْ كَانُوا إِخْوَةً رِجَالًا وَنِسَاءً فَلِلذَّكَرِ مِثْلُ حَظِّ الْأُنْثَيَيْنِ ۗ يُبَيِّنُ اللَّهُ لَكُمْ أَنْ تَضِلُّوا ۗ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ",
      "verseStringB": "They ask thee for a decision. Say: Allāh gives you a decision concerning the person who has neither parents nor children. If a man dies (and) he has no son and he has a sister, hers is half of what he leaves, and he shall be her heir if she has no son. But if there be two (sisters), they shall have two-thirds of what he leaves. And if there are brethren, men and women, then for the male is the like of the portion of two females. Allāh makes clear to you, lest you err. And Allāh is Knower of all thin"
    }
  ],
  "nameEnglish": "Women",
  "nameTrans": "an-Nisa'",
  "nameArabic": "النساء",
  "chapterNumber": 4,
  "nVerses": 176,
  "footnotes": [
    {
      "note": "1a. “The word nafs is used in the language of the Arabs in two ways, one of which      is your saying kharajat nafsu-h∂ where by nafs is implied the soul, and according to the      other use the significance of nafs is the whole of a thing, and its essence” (T). It is in this      latter sense that the creation of mates is spoken of in the Holy Qur’ån, and hence the      correct rendering of nafs on such occasions is kind, which implies the essence. This is      made clear in 16: 72: “And Allåh has made wives for you from among yourselves” (Ar.      min anfusi-kum), i.e. of the same kind and essence as you are. Some commentators have      taken this to be the significance here, i.e. He created its mate of the same kind (AH, Rz).      Ïasan also explains the words as meaning of the same kind (AH on 7: 189).      How the first man was created is not stated either in the Qur’ån or in the Ïadßth, nor      is the Bible statement accepted that Eve was created from a rib of Adam. The Muslims      do not accept that man was created six thousand years ago. The Imåmiyyah accept the      tradition that Allåh created thirty Adams before our father Adam, and one Shß‘ah Imåm      has gone so far as to say that hundreds of thousands of Adams were created before our      Adam (RM). Nor do the Muslims accept that our world is the only world in this universe; one Imåm is reported as saying that in God’s universe there are twelve thousand      systems each bigger than our solar system (RM).      The words occurring here — Who created you from a single being and created its      mate of the same — only declare the unity of the human race and the equality of the      male and the female. Elsewhere we are told that for all of you wives are created from      yourselves: “And Allåh has made wives for you from among yourselves” (16: 72). \n\n1b. “Many men and women” spring from married pairs. The verse does not necessarily refer to any parent pair of the whole of mankind. The underlying significance      seems to be to remind men of the strength of the ties of relationship, an idea finding      clear expression in what follows.\n\n1c. The original word is arƒåm, plural of riƒm, which means womb or the place of      origin of the young; hence relationship, by some restricted to relationship by the female      side only, or ties of relationship (T, LL).      \n\n2a. The care of the orphan was one of the earliest injunctions that Islåm gave, and      the Prophet had always shown a deep anxiety for the welfare of the poor and the      orphans. See 2: 220a,      220b, and also 90: 15,      16, where the care of the orphan and      “the poor man lying in the dust” is described as an uphill task, but one which must be      accomplished. The subject is here introduced in detail on account of the number of      orphans having been greatly increased by the war.\n\n3a. This passage permits polygamy under certain circumstances; it does not enjoin      it, nor even permits it unconditionally. It may be noted here that the explanation of this      passage as generally understood is based on a report contained in the Muslim, according      to which ‘Å’ishah understood this verse as meaning that if the guardians of orphan girls      feared that by marrying them they would not be able to do justice to them, they should      marry other women. This explanation, even if the report be taken to be authentic,      requires the insertion into the passage of a number of words which the original does not      contain, and as the meaning is much more clear, and more in consonance with the context, without the addition of these words, the interpretation given below is preferable. It      is admitted that this chapter was revealed to guide the Muslims under the conditions      which followed the battle of Uƒud, and the last chapter deals with that battle. Now in      that battle 70 men out of 700 Muslims had been slain, and this decimation had largely      decreased the number of males, who, being the breadwinners, were the natural guardians      and supporters of the females. The number was likely to suffer a still greater diminution      in the battles which had yet to be fought. Thus many orphans would be left in the charge      of widows, who would find it difficult to procure the necessary means of support. Hence      in the first verse of this chapter the Muslims are enjoined to respect the ties of relationship. As they all came from a single ancestor, a breadth is introduced into the idea of      relationship, inasmuch as they are told that they are all in fact related to each other. In      the second verse the care of orphans is particularly enjoined. In the third verse we are      told that if they could not do justice to the orphans, they might marry the widows, whose      children would thus become their own children; and as the number of women was now      much greater than the number of men, they were permitted to marry even two or three or      four women. It would thus be clear that the permission to have more wives than one was      given under the peculiar circumstances of the Muslim society then existing, and the      Prophet’s action in marrying widows, as well as the example of many of his companions, corroborates this statement. Marriage with orphan girls is also sanctioned in this      passage, for there were the same difficulties in the case of orphan girls as in the case of      widows, and the words are general. See also 127a.      It may be added here that polygamy in Islåm is both in theory and in practice an      exception, not a rule, and as an exception it is a remedy for many of the evils especially      prevalent in Western society. It is not only the preponderance of females over males      that necessitates polygamy in certain cases, but there is a variety of other circumstances,      not only for the moral but also for the physical welfare of society. Prostitution, the great evil of civilization, which is a real canker, with its concomitant increase of bastardy, is      practically unknown to countries where polygamy is allowed as a remedial measure.\n\n3b. By that which your right hands possess are meant the females who were taken      prisoners in war. The Qur’ån sanctions marriage with them in this verse. As for the      conditions of that marriage, see 25a, where it is clearly laid down that marriage with a      prisoner of war is allowed only when one cannot afford to marry free believing women. \n\n4a. The word used here is ©aduqåt, pl. of ©aduqah (from ©idq, meaning truth), which      means dowry or a nuptial gift. ˝adaqah meaning charity is a different word from the      same root. Other words used for dowry are mahr and ©udåq. It is necessary that a      “dowry” should be given to every woman taken in marriage, whether she is a free      woman, an orphan girl, or a prisoner of war. So every woman begins her married life as      the owner of some property, and thus marriage is the means of raising her status, in      many respects elevating her to a plane of equality with her husband. The dowry must be      paid at the time of marriage, and it is the bride’s property. To show that she is a full      owner of it, it is laid down that she can give it to anyone she likes, and can give a portion of it even to her husband. The practice has, however, become more or less general      to recognize dowry as a debt which the husband owes to the wife and which she can      claim when she likes. \n\n5a. By your property is meant the property of the orphans which is under your      control as guardians. The verse lays down the principle of the Court of Wards. It      requires guardianship in the case of all who are weak of understanding, whether minors      or not. Qiyåm means a sustenance or that which maintains or supports. While on the      one hand the Qur’ån lays stress on the transitoriness of this life, on the other it teaches      that wealth is not a thing to be despised or wasted, because it is the means of support.\n\n5b. “Make it a means of sustaining them so that you trade with it and make it      profitable, and so that you may be able to defray their expenses from the profit and not      from the capital” (AH). Rz gives a similar explanation. There is also a saying of the      Prophet in this connection: “Whoever is the guardian of an orphan who has property      should trade with it and should not leave it undeveloped so that the zakåt should      consume it” (Msh. 6). \n\n5c. The words are generally rendered as meaning speak to them good words, but see      2:83e, where it is shown that the word qaul is used to express all kinds of deeds. After      speaking of the maintenance and clothing of the orphans in a befitting manner, the Holy Qur’ån now calls attention to another great need of theirs which is education. From the      first revelation, Islåm laid stress on knowledge, read and write (96: 1–5) being its very      first message, and the Prophet spoke of the acquisition of knowledge as being as great a      need of humanity as the acquisition of wealth: “There shall be no envy but in two: the      person whom Allåh has given wealth and the power to spend it in the service of truth      and the person whom Allåh has granted knowledge and he judges by it and teaches it”      (B. 3: 75). He laid stress even on the education of slave-girls. “The man shall have a      double reward,” he said, “who has a slave-girl and he trains her in the best manner and      he gives her the best education, then he sets her free and marries her” (B. 3: 31). It is      thus of the education of the orphans that the Holy Qur’ån speaks here, and the next verse      which enjoins the guardians to “test” their wards makes it clear.\n\n 6a. These words show further, that the guardian is not only responsible for the education of the wards as pointed out at the end of the last verse, but he is also required to      examine them and see what progress they have made. According to Ab∂ Ïanßfah, majority is attained at eighteen years, but if maturity of intellect is not attained at eighteen, the      limit may be extended. These words, moreover, show that marriage should be performed      at the age when a person has attained majority, for the age of marriage is spoken of as      being the age of attaining majority.\n\n6b. The meaning is: Do not hasten to spend the property of minors with a view to      wasting it before they attain their majority. \n\n6c. These words allow payment of reasonable wages to the manager of a ward’s      estate out of the ward’s property if the manager is not a rich man. The amount charged      must be reasonable, taking into consideration the value of the property and the work of      management. \n\n7a. Among the Arabs women and children had no share in inheritance, for they used      to say: “None shall inherit but he who smites with the spear” (Rz). The reason is to be      found in the fact that the normal condition in Arabia before Islåm was a continual state of      war, and only those who could go out to fight were taken into account. This great reform, by which the status of women was raised from the lowest condition to that of equality      with men, clearly indicated that the establishing of peace was one of the aims of Islåm.      The principle laid down in this verse is the basis of the Muslim law of inheritance.      Children and near relatives, or failing these, distant relatives, whether males or females,      are the lawful heirs, and the whole of the property does not go to the eldest son.      Whatever objection there may be to this principle on the ground of division of property      into parcels, there is not the least doubt that the rule is in accordance with the broad      principles of democracy and the brotherhood of man which Islåm seeks to establish. \n\n8a. By these are meant those distant relatives who for any reason are not entitled to      inherit.\n\n   11a. By females are here meant the female children. When the daughters are the soleheirs they are entitled to a share of two-thirds. The share of two-thirds to which “morethan two” daughters are entitled remains the same even when the daughters are twoonly; a single daughter being entitled to one-half as made clear further on. Compare v.176, where two sisters are mentioned but they include more than two.\n\n   11b. This is the second case, and it deals with the question of inheritance when thedeceased is survived by parents. In this case the parents first take their respective shares,and the residue goes to the children, if there are any, failing which, the share of theparents is increased. But in case the deceased has brothers, the mother receives the sameshare as she would have received if the deceased had children.It may be noted that in all cases the payment of bequests and debts takes precedenceof the shares of the heirs.\n\n12a. This is the third case, and it deals with the question when the deceased leaves ahusband or a wife with or without children. The husband or the wife takes his or hershare first, as in the case of parents, and the residue goes to the children.If there are parents as well as husband or wife and children, the first two would taketheir shares first, and the residue would go to the children, whether males alone orfemales alone or males and females mixed. The two-thirds share for two or more daughters can only be given when there are neither parents, nor husband or wife; otherwisethey take the residue, as in the case of sons or sons and daughters.Practice is against this, and brings in ‘aul to solve the difficulty. The ‘aul was firstlegalized by ‘Alß, the fourth Caliph, who, being questioned about the share of a wife, theother heirs being the two parents and two daughters, gave the answer “without premeditation” that the wife’s one-eighth had become one-ninth, for the two parents should takeone-third, the two daughters two-thirds, and the wife one-eighth, which make upnine-eighths, and hence ‘Alß decided that each of the heirs should take less than was due,so that the proportion might remain the same (T). The difficulty would not have arisen ifthere had been sons instead of daughters or sons along with daughters. If ‘Alß haddecided to give the residue to the two daughters after taking away the wife’s one-eighthand the parents’ one-third as he should have done in the case of two sons or a son and adaughter, the question of ‘aul would not have arisen.\n\n12b. Commentators are of opinion that by a brother or a sister here is meant abrother or a sister on the mother’s side and that the case of real brothers and sisters, orbrothers and sisters on the father’s side, is dealt with in v. 176 of this chapter. Thereason for this is that here as well as in v. 176, the property to be inherited is that of akalålah, and it is generally supposed that a kalålah is one who has neither parents norchildren. But as a matter of fact kalålah bears two meanings. It means the person whohas no children whether he has parents or not, and it also means the person who hasneither children nor parents. It is derived from kalla which means he became tired orfatigued, and therefore its primary significance would be the person who has no children. I‘Ab is reported to have explained this word as meaning one who does not leaveoffspring whether he leaves parents or not. ‘Umar also is reported to have said thatkalålah is one who has no children, that is all; see Gharå’ib al-Qur’ån. Hence it is morereasonable to take the kalålah spoken of here as being different from the kalålah spokenof in v. 176. The kalålah in the present case is one who has no children but has parents,and therefore the brothers and sisters are not the only heirs and their share is onlyone-sixth, while the kalålah spoken of in v. 176 is one who leaves neither children norparents, and therefore the brothers and the sisters take the whole of the inheritance. \n\n12c. As in the case of those who have no children there is much likelihood of theirburdening the estate with unnecessary debts, or even admitting debts that have not reallybeen contracted, and of making bequests that would leave nothing for legal heirs, thewords not injuring others are added, to make it clear that debts and bequests in such acase shall not prejudice the rights of the legal heirs.\n\n15a. Al-fåƒishah signifies anything exceeding the bounds of rectitude (gross,immodest, lewd, obscene) (Mgh, LL). See further 19c, where it is shown that fåƒishahincludes hatred and desertion, refractoriness, etc. Though the word is used sometimesas meaning fornication, the context shows that here it is used to signify immoral conductshort of fornication, for the punishment of fornication is given in 24:2. The words of theverse that follows, referring to a similar immoral act with the indefinite nature of punishment, support this conclusion, for punishment in the case of an act short of fornicationwould vary with the nature of the crime. Thus women guilty of immoral conduct arecurtailed of their liberty. If they mend their ways, or being unmarried they get married, away is opened for them by Allåh, and they regain their liberty; if they do not, the curtailment should be extended till they die. There is no proof for Palmer’s assertion that“women taken in adultery or fornication were, at the beginning of Islåm, literallyimmured”.\n\n16a. The crime spoken of in this verse is the same as that in the previous verse. Thecommitters are two, and though the masculine gender is used, it does not imply that theyare both necessarily males. Slight punishment is explained by Qatådah as meaningreproving with the tongue (AH). Islåm requires the utmost modesty in sexual relations.The reference to repentance in connection with the mention of fåƒishah is furtherproof that f åƒishah does not here mean fornication, but some immorality short of that,for fornication is punishable criminally, and penitence on the part of those guilty of itcannot avert the punishment. \n\n18a. Verses 17 and 18 show that repentance, according to the Holy Qur’ån, impliesan actual change in the course of one’s life, not the mere utterance of words. In fact, thelaw stated here shows how repentance does away with sins. When the very course of aman’s life is changed in respect of a particular sin, the tendency to that sin is uprooted.But those who continue their evil courses until death overtakes them cannot obtain thebenefit of repentance, because there is no time left for them to improve themselves.\n\n19a. Among the pre-Islamic Arabs, when a man died his elder son or other relationshad a right to possess his widow or widows, marrying them themselves if they pleased,without settling a dowry on them, or marrying them to others, or prohibiting them frommarriage altogether (B. 65: iv,      6).\n\n19b.  This passage remedies another evil. Those husbands who were dissatisfiedwith their wives were wont to give them trouble in order that they should be forced toclaim a divorce and remit the dowry (Rz). This is disallowed. If the judge finds that thefault lies actually with the husband, he will not allow the dowry to be remitted in hisfavour. \n\n19c. The exception is in reference to taking part of the dowry, the meaning beingthat part of the dowry can only be taken back if the woman is guilty of immoral conduct.The manifest indecency spoken of here is hatred and desertion of the husband,refractoriness, and doing harm to the husband and his family (Rz). In such cases, whenthe fault is with the woman, she may be required to return her dowry wholly or in part.\n\n20a. “It is narrated that when a (married) man among them wanted to marry anotherwife in place of the first, he used to accuse the latter of adultery or other gross immorality, thus compelling her to obtain a divorce by paying a large sum of money” (Rz).Having one wife in place of another signifies the divorcing of the first and marrying another. This verse further shows that there is no limit to the dowry which may be settled on a wife; even a heap of gold may be given to her as dowry if the husband has gotthe means. When ‘Umar desired to ban big dowries, it was with the recitation of thisverse that a woman in the audience silenced him, and he had to take back his orderssaying that “the women of Madßnah had more understanding than ‘Umar”.\n\n21a. Marriage is here called a mßthåq or a covenant or agreement between the husband and the wife. As there can be no agreement unless both parties give their consent toit, marriage in Islåm can only be contracted with the free consent of the two parties.\n\n22a. As already pointed out, when a man died his widows were the property of theeldest son, and he could marry any of them that he liked. This immoral practice wasabolished by this verse. \n\n23a. For prohibited marriage relations in the Mosaic law see Lev. 18: 16–18.\n\n24a. It is thus forbidden to a man that he should marry a woman who is alreadymarried. An exception is made, however, regarding those whom your right handspossess, by which expression are generally meant in the Holy Qur’ån those who aretaken prisoners in war. It sometimes happened that such prisoners became converts toIslåm, and therefore they could not be sent back. Such women it was lawful to take inmarriage, even though they might not have been divorced formally by their formerhusbands. The words må malakat aimånu-kum may, however, also mean those whomyou have lawfully taken in marriage, because lawful possession is clearly implied in theword aimån, which signifies covenant, marriage also being a covenant. The meaning ofthe passage may therefore be that all free women are prohibited to you except thosewhom you have lawfully married. \n\n24b. The husband and the wife are free to increase or decrease the amount of dowryfixed at the time of marriage by agreement among themselves. It should also be notedthat Islåm does not allow temporary marriage. It recognizes only iƒ©ån, taking a womanin permanent marriage, from the root ƒa©una, it (a place) was inaccessible, or (a woman)was chaste or married (LL), iƒ©ån thus meaning fortifying a place or marrying.Whatever sexual relations are outside iƒ©ån are denounced as musåfiƒat or giving oneself up to debauchery, from the root safƒ, meaning spilling. Iƒ©ån gives rise to certainrights and obligations, which are established for life, but such rights and obligations donot arise in musåfiƒat or fornication and mut‘ah which was a temporary marriagerecognized in Arabia before the advent of Islåm. It seems that resort was had to mut‘ahin one or two battles by some Muslims but it was expressly prohibited by the Prophet inthe battle of Khaibar (B. 64: 40).\n\n25a. This verse lays down the conditions under which those taken prisoners in warmay be taken in marriage. I do not find any verse in the Holy Qur’ån or any instance inthe Prophet’s life, sanctioning what is called concubinage. On more occasions than one,when the establishment of conjugal relations with slave-girls is mentioned, their takingin marriage is clearly laid down as a condition as in v. 3, v. 24, and this verse. Heremarriage with those taken prisoners in war is allowed under certain circumstances, thefirst of these being that they should be believing women or Muslims. There are twomore conditions: (1) that a man has not the means to marry a free woman as the openingwords show, and (2) that he fears to fall into evil as stated in the concluding words. If,then, even marriage with her is allowed under exceptional circumstances, it is quiteunreasonable to suppose that her master is allowed to have conjugal relations with herwithout taking her for a wife. She was no doubt placed on a lower level in Arab societythan a free woman, but that is all. Perhaps the strictness of the rules regarding marriagewith a female slave is due to the consideration that he who seeks her in marriage mayfirst have her freed from slavery.It may be said that this verse speaks of others than the masters of the slave-girls,because it requires the permission of the masters. The only right the master could reasonably claim is that he does not require the permission of anybody else, yet he must still takeher as a wife, not as a paramour. But see the Prophet’s ƒadßth quoted in 5c, according towhich the master is required to educate the slave girl, giving her the best education, thenset her free and then marry her. One more point arising out of this verse may be noted. It isplainly laid down here that if a married slave-girl commits adultery, her punishment is halfof the punishment prescribed for the free married woman who commits adultery. Thisshows that the Holy Qur’ån never contemplated stoning as the punishment for adulterybecause it could not be halved, and as a matter of fact the Holy Book nowhere speaks ofstoning; the only punishment for adultery that it speaks of is a hundred stripes (24: 2).\n\n28a. Not only is the rigour of the Jewish and other previous laws greatly modified inIslåm, but all principles of right action are stated with such completeness, devoid ofunnecessary details, that the real burden of man is actually much more lightenedin Islåm than in any other religion. It, moreover, points out the right way for man’sfreedom from the bondage of sin, and thus reduces his burden, not by false assurance,but by actually saving him from falling into evil ways.\n\n28b. These verses speak of Allåh’s great mercy in having shown man the way totruth and guidance, for man, being created weak, could not chalk out a way for himselfwhich was free from error. That is all that man’s weakness here signifies. \n\n29a.  In the first part of this verse all illegal methods of acquiring property areforbidden, but the seeking of gain one from another by trading, which implies mutualconsent, is allowed, being a legal method. Though the words are general, the passage isparticularly directed to guard women’s right to property, because it was women’s andorphans’ property that was generally devoured aggressively and unjustly.The second part forbids the killing of anfusa-kum, which means your people oryourselves. In the first case, the significance is that life must also be protected; in thesecond case, it is an injunction against suicide which according to the law of Islåm is agrave sin. \n\n31a. Sayyi’ah or s∂’ signifies an evil deed as well as an evil affection (LL). The context requires the latter significance to be adopted here. All that is meant is that if a manavoids the commission of sins, the evil inclinations within him die also. Division of sininto kabßrah and ©aghßrah is unwarranted. \n\n33a. Mawålß is plural of maulå, which conveys a number of significances, such aslord or chief, a cousin, a freed man, a slave, an heir. The last of these significances isadopted here by the best authorities (B. 65: iv,      7), and only this suits the context.\n\n33b. In the pre-Islamic days, people were accustomed to enter into covenants onewith another, by which they undertook to defend and inherit one another; and when oneof them died, the other was considered entitled to one-sixth of the property of thedeceased (AH). When the Muslims fled to Madßnah, the Prophet made every Makkanemigrant enter into a close relationship of brotherhood with one of the Madßnah citizens,so that under the old custom one of them would have become an heir to the other on hisdecease. Inheritance was abolished by this verse, and the words give them their duemean the rendering of assistance in general, doing acts of kindness and the giving ofgood advice, while something may be settled by testament (B. 39: 2). \n\n34a. Qåma-l-rajulu ‘ala-l-mar’ati means he maintained her and managed heraffair, having charge of her affair; hence he is said to be her qawwåm, i.e. maintainer(T). Similarly, qåma bi-l-yatßmi means he maintained the orphan (LL). Hence by themen being qawwåm∂n is only meant that they are the maintainers of women with thatwhich Allåh has made some to excel others.\n\n34b. Obedience here signifies obedience to Allåh. This significance of the word ismade clear by a comparison with 33: 31,      33: 35, and 66:5. \n\n34c. Guarding the unseen is a euphemism for guarding the husband’s rights. Thetwo qualifications of a good wife as given here are her piety or obedience to God andchastity.\n\n34d. The meaning is that their guarding the husband’s rights is really a favour fromAllåh as it is Allåh that guards them. Or the meaning may be, Allåh has guarded theirrights. \n\n34e. The word nush∂z, which I have translated as desertion, primarily means rising,and as spoken of a woman in connection with her husband it means her rising against herhusband. This is explained in a number of ways; according to one of these explanations itmeans her leaving the husband’s place and taking up an abode which he does not like(AH). LL quotes various authorities showing that nush∂z on the part of the woman meansthat the wife resisted her husband and hated him (S, Q) and deserted him (T).The remedy pointed out in the case of the wife’s desertion is threefold. At first she isonly to be admonished. If she desists, the evil is mended, but if she persists in the wrongcourse, her bed is to be separated. If she still persists, chastisement is permitted as a lastresort (Rz). Regarding this last remedy two things must, however, be borne in mind.Firstly it is a mere permission, and sayings of the Prophet make it clear that, thoughallowed, it was discouraged in practice. Thus the Prophet is reported to have said, on thecomplaint of certain women as to the ill-treatment of their husbands: “You will not findthese men as the best among you” (AD. 12: 42). According to Shåfi‘ß, it is preferable notto resort to chastisement of the wife (Rz). In fact, as the injunctions of the Qur’ån arewide in their scope, the example of the Holy Prophet and his constant exhortations forkind treatment towards women, so much so that he made a man’s good treatment of hiswife the gauge of his goodness in general — the best of you is he who is best to his wife— show clearly that this permission is meant only for that type of men and women whobelong to a low grade of society. Secondly, even this permission cannot be adoptedindiscriminately, for sayings of the Holy Prophet make it quite evident that chastisement, when resorted to in extreme cases, must be very slight. I‘Ab says it may be with atoothbrush or something like it (AH). The Prophet is reported to have said: “You have aright in the matter of your wives that they do not allow anyone whom you do not like tocome into your houses; if they do this, chastise them in such a manner that it should notleave an impression” (Tr. 10: 11). Thus very slight chastisement was allowed only inextreme cases.\n\n35a.  This verse lays down the procedure to be adopted when a case for divorcearises. It is not for the husband to put away his wife; it is the business of the judge todecide the case. Nor should divorce cases be made too public. The judge is required toappoint two arbiters, one belonging to the wife’s family and the other to the husband’s.These two arbiters will find out the facts, but their objective must be to effect a reconciliation between the parties. If all hopes of reconciliation fail, a divorce is allowed, but thefinal decision for divorce rests with the judge who is legally entitled to pronounce adivorce. Cases were decided in accordance with the directions contained in this verse inthe early days of Islåm. See an instance quoted by Rz regarding ‘Alß’s decision in a caseof breach. The husband was told in plain words that he must abide by the judgment ofthe arbiters appointed under this verse.\n\n36a. The neighbour of kin may mean a neighbour who is a relative or a Muslimneighbour, and the alien neighbour is either a neighbour not related or a neighbour ofan alien religion (AH). The latter phrase (the qualifying word being derived from janb,meaning a side) signifies, according to lexicologists, the person who is one’s neighbourbut who belongs to another people (LL). Thus the charity of Islåm is not limited to one’sown people or one’s own co-religionists, but is extended to aliens also.\n\n36b. By those whom your right hands possess are meant all those with whose care aman is entrusted, so that it includes even animals over which a man has control (AH,Rz). While dealing with the rights of women, the Qur’ån generalizes the law of doinggood to others, so much so that it requires goodness to be extended even to a fellowtraveller or to a mere wayfarer. If even companions whose company is so short-lived areto be treated generously, how generous must a man be to her who is the companion ofhis whole life!\n\n40a. Such is the ever-recurring description of the preponderance of mercy in Divinenature: good is always multiplied and evil nullified. The constant multiplication of goodshows no doubt that good must ultimately preponderate in the universe, and thus theDivine laws working in nature point to the fact that the universe is moving towards thegoal of ultimate good.\n\n41a. The prophet sent to a people is frequently spoken of as being a witness(Ar. shahßd) in respect of them, and by these are here meant the followers of the HolyProphet, or the community of Muƒammad. It is stated in the ƒadßth that this chapter wasbeing recited before the Prophet and when the reciter came to this verse, tears flowedfrom the eyes of the Prophet and he said; “My Lord, I can bear witness about thoseamong whom I am living, but what about those whom I have not seen?” (Ibn Kathßr).From this it appears that the people spoken of here are Muslims who disobey theProphet, and hence the Prophet’s anxiety for the later generations of his followers. Thisis in fact made clear in the verse that follows in the words those who disbelieved anddisobeyed the Messenger. Disobedience amounts to disbelief in practice.\n\n43a. There is some difference of opinion as to what is meant by sukårå here.Literally, the singular sakarån signifies one intoxicated, but while some consider themeaning here to be intoxicated with drink, others think it to be intoxicated with sleep,(T, LL). And sakr, no doubt, may be applied in the latter sense, for its literal significanceis stopping up (LL). The word is also applied to confusion of judgment (LL). The HolyQur’ån speaks of sakrat al-maut (50: 19) or the condition when one loses his senses atthe approach of death. Sakrat al-hamma means the condition in which a person loses hissenses on account of extreme grief. Sakrat al-naum is the condition when on account ofthe oppressive sensation of sleep one is not in full possession of one’s senses. The wordas used here may carry any of these senses.The prohibition against praying when intoxicated was a step towards the totalprohibition of drink, for the necessity of going to prayer five times a day would affordlittle opportunity for indulgence in drink. The verse makes it further clear that one mustknow the significance of what one says when praying to God. \n\n43b. The word junub (from janb, meaning a side) should not be translatedas impure or polluted; it is a purely technical term, and means one who is under anobligation to perform a total ablution or bathing (LL). The connection with theroot-meaning is that the person under such obligation is on a side or remote from prayer(R). When one such person, a junub, described himself as najs (polluted or defiled) inthe presence of the Prophet, the latter corrected him, saying: “Glory to Allåh! A believeris not najs (or defiled)” (B. 5: 23). The necessity to perform a total ablution arises in caseof emission of seminal fluid due to sexual intercourse or pollutio nocturna. \n\n43c. Going near prayer may signify going into mosques (I‘Ab-Rz), and themeaning in that case would be unless you pass (through the mosques) as by a way. \n\n43d. The touching of women is a euphemism for sexual intercourse. Many of thefine phrases used in the Holy Qur’ån to express this delicate relation were unknown tothe Arabs; words and forms were adopted which would not shock the most delicate ears. \n\n43e. ˝a‘ßd means high or elevated ground, hence generally land or ground or surfaceof the earth, whether it be dust or earth or otherwise (LL). Tayammum (from amma, meaning he repaired) means striking both hands on pure earth, or anything containing puredust, and then passing the hands over the face and the backs of the hands. When water isnot found, or is likely to do harm, tayammum suffices instead of ablution before prayer.\n\n46a.  The corruption of the previous books is constantly referred to in the HolyQur’ån, and, as the words clearly show, it implies a corruption of the text as well as afalse rendering of it. The subject of the perversion of “holy writ” is specially dealt within 2: 75–79,      5: 13,      41, and here; see 2: 79a. The verification referred to in v. 47 andelsewhere implies only a verification of the general principles and particularly of theprophecies contained in those books.\n\n46b. See 2: 104a.\n\n47a. The word wuj∂h (sing., wajh) may mean either faces or chiefs and leaders (R,under Δams) while Δams means obliteration or destruction (R). The obliteration of facesis evidently a metaphorical expression meaning depriving them of greatness andprosperity and bringing on them disgrace and adversity (Bd). The same idea is intensified in turning them on their backs. The reference here is supposed to be to their ultimate banishment from Arabia.The second form of punishment is their being overtaken by the curse whichovertook the Sabbath-breakers, for which see 2: 65b.\n\n48a. Shirk or setting up partners with Allåh is spoken of as the gravest sin. A man’swrong belief does not in any way detract from the glory of God, but a belief in falsedeities lowers the dignity of man. Man is made to rule nature itself and all creatures, butwhen he lowers himself before creatures lower than himself whom he was really made torule, he sets at naught the very purpose of his creation. It should be noted that shirk orsetting up gods with God does not only mean idol-worship or worship of the forces ofnature or a belief in the Divinity of mortals, but also includes the blind obedience whichis rendered to great men; see 9: 31a and also the next footnote. It should be furtherremembered that the forgiveness spoken of here relates to those who die while guilty ofshirk, but even they will be received into the mercy of God after suffering the consequences of their deeds. If a man is guilty of shirk and repents of it before his death all hissins including shirk are washed off and forgiven because he gives a new turn to his life. \n\n49a. Fatßl means originally pellicle of a date stone or dirt of the skin rolled betweenthe fingers; hence a very small thing (LL). The reference in those who attribute purity tothemselves is to such doctors of law and monks (9: 31) (as also to ‘ulamå’ or pßrs to bemet with among Muslims) who consider themselves to be above their votaries fromwhom they demand blind obedience to themselves. Hence such people are spoken of inconnection with the mention of setting up partners with God in the previous verse. \n\n50a. Laying claim to purity for themselves is here called a manifest sin. \n\n51a.  Jibt means an idol or idols (LL): ‘Umar said, it means sorcery (B.65:iv,      10).Some consider it to be the same word as jibs, which means a worthless thing (Rz), or athing in which there is no good. For Δågh∂t see 2: 256b. Here it is explained as meaningkåhin or diviner: Jåbir said that every tribe had its own diviner (B. 65: iv,      10). It is related that in making a compact with the Quraish the Jews worshipped their idols (Rz). Butthe words seem to refer to the general debasement of the Jews, who believed in all kinds of enchantment, divination, and sorcery, and had long bidden farewell in practice to thepure monotheism of Moses. \n\n53a. The reference is apparently to the temporal and spiritual kingdom which waspromised to Abraham’s seed, as clearly stated in the next verse. The Jews had beendeprived of both. Love of wealth had debased them to such an extent that they were notfit for even temporal kingdom which could not be granted to a people who would notdeal liberally with others. \n\n54a. By the people are meant the Arabs. The promised kingdom was still inAbraham’s seed, but was now transferred from the descendants of Israel to those ofIshmael, in accordance with the covenant made with Abraham; see 2: 124a.\n\n55a. The children of Abraham, among whom were the Jews, are meant.\n\n55b. The personal pronoun is for the Holy Prophet Muƒammad, who was now thetrue exponent of Abraham’s religion.\n\n56a. The form used signifies the continuance of the torment in accordance with themetaphor of fire.\n\n57a. Òill implies mightiness and inaccessibility and also a state of ease: the wordsare used here in allusion to happiness and pleasantness of life (R).\n\n58a. This section deals with the granting of kingdom to the Muslims, who are hererequired to entrust the affairs of State to people who are worthy of this responsibility.The words that follow, requiring judges to be just, corroborate this significance, thewhole verse stating the reciprocal duties of the governed and the governors. Explainingthe word amånat (sing. of amånåt, the word occurring here and translated trusts), I‘Absaid that it means duties (LA). The Prophet himself explained the word amånat asmeaning Government or affairs of State. “The Prophet said, When the amånat (trust) iswasted, wait for the så‘ah, i.e. the hour or the doom. It was said, How will the trustbe wasted, O Messenger of Allåh? He said, When Government is entrusted to thoseunworthy of it, then wait for the doom” (B. 81: 35).\n\n59a. This verse lays down three important rules of guidance in matters relating tothe welfare of the Muslim community and especially in those relating to affairs of State.These are obedience to God and His Messenger in the first place; secondly, obedience tothose in authority from among the Muslims; and thirdly, referring matters to God andHis Messenger in cases of dispute with those in authority. God and His Messenger arethus the final authority. This is explained in the Ïadßth. “To hear and obey,” said theProphet, “is binding so long as one is not commanded to disobey God; when one iscommanded to disobey God, he shall not hear or obey (the authorities)” (B. 56: 108).The words ulu-l-amr, meaning those in authority, have a wide significance, so that indifferent matters relating to the life of man different persons would be in authority. Thusthe commander of a section of the army was considered as one in authority (B. 65: iv,      11).Temporal authorities are to be obeyed in secular matters while religious authorities mustbe obeyed in religious matters. It is especially in matters religious that differences would arise, in which case it would be necessary to refer the matter to God and His Messenger;in other words to the Qur’ån and Ïadßth. The great Imåm Ab∂ Ïanßfah is himself reported to have said: “Give up my word for the Word of Allåh; give up my word for the wordof the Messenger of Allåh”.As regards the secular authorities, the rule is laid down in the Ïadßth that “the authority of those entrusted with it should not be disputed, unless,” the Prophet added, “you seean act of open disbelief in which you have a clear argument from Allåh” (B. 93: 2).The words of the verse speak only of those in authority from among you, and thequestion therefore arises, what should the Muslims do in case they have to live undernon-Muslim authority? In such a case the Prophet’s own example in his relations withAbyssinia is a sufficient guide. About a hundred of the companions were advised by theProphet to seek shelter in the Christian kingdom of Abyssinia where they lived for aboutten years subject to the laws of the land. The rule is, however, laid down in clear wordsas already quoted that “when one is commanded to disobey God, he shall not hear orobey the authorities”. \n\n59b. Ta’wßl (from åla, he returned) signifies interpretation, because the words arereturned to their sense. But from the same original sense of returning follows its use inthe sense of marja‘, i.e. final sequel, and ‘åqibah, i.e. issue, end, results (LL), and this isthe significance which suits the context here.\n\n60a. For Δagh∂t see 2: 256b. The people spoken of here are the hypocrites as madeclear in the verse that follows. The reference here is said to be to Ka‘b, son of Ashraf, aJew; others think it is to Ab∂ Bardah, a diviner; others consider the Δagh∂t here to be aparticular idol or idols generally, to whom disputes were taken to be decided by divination (Rz). The hypocrites inclined to idols, or the diviners who, being their leaders indevil-worship, are called devils.\n\n63a. A person is said to be balßgh (from balagha, meaning he attained the utmostpoint to which he directed his course) who is chaste in speech or effective or penetratingin tongue. Applied to a saying, it also signifies an effectual speech or a speech producing an effect (LL).\n\n66a. The companions of the Prophet had to lay down their lives in defence of theirfaith, and had to leave their homes for the sake of their religion. But the hypocrites atMadßnah were too weak of heart to undergo such hardships. They were only required tocontribute to the struggle which was being carried on for national defence and to obeythe Prophet’s orders which was a far easier task, but they did not do even this.\n\n69a. Those upon whom Allåh has bestowed favours are spoken of as belonging tofour classes: (1) The prophets. (2) The truthful — the original word ©iddßq literallymeans one who is always truthful and in the religious language one who is true in hissaying and his belief, and who confirms his truth by his deed or acting (LL). (3) Thefaithful — the original word shahßd means one who bears witness to the truth of thereligion of Allåh, both by his words and deeds, and one slain in defence of his religion isincluded because he too gives evidence of the truth of religion by laying down his life.(4) The righteous or those who stick to the right course in all their deeds, come whatmay.Those who obey Allåh and the Messenger are here told that they are with the perfectones who belong to the four classes, the prophets, the truthful, the faithful and the righteous. The significance is clear. They have not attained to the perfection of these fourclasses of the perfect ones, yet they are with them, i.e., they will be in their company inthe life to come. The Prophet’s sayings make it clear. He is reported to have said; “Thetruthful and honest merchant is with the prophets, the truthful and the faithful” (Tr.12: 4). It does not mean that an honest merchant becomes a prophet, but that he is in thecompany of the prophets. According to another ƒadßth, the Prophet was asked about aperson who loves a people but is not one of them, and he replied that a man is with thosewhom he loves (B. 78: 96). And Anas is reported to have said: “I love the Messenger ofAllåh and I love Ab∂ Bakr and ‘Umar and I hope that Allåh will raise me with them,though I have not done the deeds which they did” (B. 62: 6). Thus this verse promises tothose who have not attained to perfection the company of those who have attained toperfection when the former have done their best to obey God and His Messenger.At any rate none can become a prophet by obeying the Prophet. If this were true, notonly would all the truthful and the faithful and the righteous be prophets, because theyperfectly obeyed Allåh and His Messenger, but even all those who tried to follow themwould have been raised to the dignity of prophethood which is absurd on the face of it.And to talk of some people becoming prophets after the door to prophethood has beenclosed is sheer ignorance of the basic principles laid down by the Holy Book. \n\n75a. This verse explains what is meant by fighting in the way of Allåh. While mostof the believers who had the means had escaped from Makkah, which is here spoken ofas the city whose people are oppressors, there remained those who were weak andunable to undertake a journey. These were still persecuted and oppressed by theMakkans, as is clearly shown by the words of the verse, and not only men, but evenwomen and young children, were persecuted. Fighting to deliver them from the persecution of the oppressors was really fighting in the way of Allåh. The next verse shows thatthese very oppressors are spoken of as fighting in the way of the devil.\n\n76a. This is a prophecy that those who are siding with the devil and are fightingagainst the Truth will ultimately be vanquished.\n\n77a. The injunction to fight was distasteful, and more particularly so to those whowere weak in faith. Had there been any hope of plunder to animate the ranks ofMuslims, those who loved this world most (who are here called the hypocrites) wouldhave been foremost in fighting; but as they knew that they were fighting against odds,they considered the execution of this order as equivalent to courting death, and requested to be granted a respite until they died a natural death. \n\n79a. Good and evil, or benefits and misfortunes, proceed from Allåh; but while Hesends benefits from Himself, i.e. out of His beneficence, no evil or misfortune afflicts aman unless his own hands have called for it. There is no discrepancy in the two statements, the one made at the end of the last verse — All is from Allåh — and the othermade here. The previous verse states that the hypocrites attributed their misfortunes tothe Prophet; they are told that misfortunes were sent by Allåh. This verse tells them that,though sent by Allåh, the immediate cause of these misfortunes was to be found in theirown doings. \n\n81a. The reference here is to the secret counsels of the hypocrites, who were alwaysplotting against the Prophet while they kept an appearance of obedience to him. \n\n82a. The Qur’ån was not written out and given on one occasion, but it continued tobe delivered in small portions during twenty-three years under the most varying circumstances. From the solitary recluse of the cave of Ïirå’, the Prophet had to pass throughsuch a variety of circumstances to be the sole monarch and legislator of the whole ofArabia, that the life of no other individual human being affords us such a varying study.It is quite true that the earlier revelation deals mostly with such problems as DivineUnity and Majesty and the responsibility of human actions in general, while the laterrevelation had to deal with a large number of questions relating to the social and moralwell-being of society; but what strikes one throughout the entire revelation is that itkeeps up one and the same strain — absolute submission to Allåh, entire trust in Him,perfect confidence of future success, a liberal view of humanity, an attitude of charitytowards all nations and religions, and goodness to all alike. The spirit of the revelationsto the solitary, persecuted, and rejected preacher of Makkah does not differ in these anda hundred other particulars from the spirit of the revelations to the sole temporal andspiritual monarch of Arabia. There are no discrepancies even in the details of narratives— such, for instance, as are met with in the Bible — and this is especially true of thenumerous prophecies which were uttered by the Prophet when an absolutely helpless man. Had they not proceeded from the Omniscient Being, Who knows the future as Heknows the past, they could certainly not have been free from numerous discrepancies.\n\n83a. Divine grace and mercy were manifested by raising a prophet who deliveredthem from the bondage of sin and from the slavery of the devil.\n\n84a. These words show how great was the confidence of the Prophet in the ultimatetriumph of the noble cause with which he was entrusted. The primary duty to defendIslåm lay on him alone, as against all the hosts of Arabia. This shows that he never putany trust in the prowess of his followers, and his confidence was based solely on Divinehelp. With no material resources, he was sure not only that he would be able to restrainthe fighting of his powerful opponents, but also that they would meet with condignpunishment at his hands.\n\n85a. The meaning is that he who joins himself to another and assists him, andbecomes to him as one of a pair or an intercessor in doing good or evil, and thus aidshim and strengthens him, partakes with him the benefit or the harm of it (R). It is alsoheld by some that shafå‘at here implies “that one institutes for another a way of good ora way of evil, which the other imitates, and thus becomes to him as if he were one of apair” (LL). The connection is clear; the Prophet made himself an example of good forothers to imitate or to aid him. For the meaning of shafå‘at, see 2: 48b.\n\n86a. A greeting is a prayer for the good of another, taƒiyyah being originally a prayerfor one’s long life. The Islamic greeting is al-salåmu ‘alai-kum, which means peace be toyou, so that when two Muslims meet they are required to pray for one another’s good. Theminimum requirement is that a greeting must be returned in the same words. Hence theother party says wa ‘alaikum al-salåm, meaning and to you be peace. But it is recommended that the greeting should be returned in better words, and hence, to the words of thereply are added the words wa raƒmatu-llåhi wa barakåtuh, i.e. and the mercy of Allåh andHis blessings. But what is really aimed at is that a Muslim should always wish good for, ordo good to, his brother, and the other is required to do greater good in return. \n\n88a. Clearly those waverers are implied here who went back to disbelief after theyaccepted Islåm, and thus again joined the disbelievers. As to their identity, there are sixdifferent conjectures, and I need not puzzle the reader with these.\n\n90a. This verse explains the previous one, showing clearly that even waverers werenot to be killed or fought against if they refrained from fighting, though they may havegone over to disbelief after accepting Islåm. The commentators agree that the personsreferred to in this verse were disbelievers and not Muslims, and they are generallysupposed to have been the Banß Mudlaj (Bd). Note also that we have here the clearinjunction that if any people offered peace, they were not to be fought against. \n\n91a. By mischief, or fitnah, is meant war with the Muslims (Rz). Two tribes, Asadand GhaΔfån, came to the Muslims and showed an inclination to remain at peace, butwhen they went back and their people invited them to join them in fighting with theMuslims, they responded to the call. Such people could not be trusted. The importanceof these directions in time of war, when the Muslims were hemmed in on all sides byenemies, can hardly be overestimated.\n\n92a. This verse and the one following it show that the man who killed a believerintentionally could not be a believer. In the state of warfare which then existed in Arabia,disbelievers often made use of ruses, professing a firm belief in Islåm and thus temptingthe Muslims to go over to them as religious teachers, and afterwards murdering them.\n\n93a.  The commentators are agreed that this verse speaks of a disbeliever whomurders a believer. In fact, the word intentionally stands here for murdering a manbecause he is a believer, as this was what the disbelievers often did.\n\n94a. The original word for salutation is salåm (meaning peace). The first word of theMuslim salutation stands therefore for the Muslim salutation. The Muslims were surrounded by enemies on all sides, yet they were told not to presume that every Arab tribebelonged to the enemy camp but were to make an investigation first, whether the tribewas really hostile to Islåm. Even when a man belonging to an enemy tribe offered theMuslim salutation, to show that he was a Muslim, he was to be taken as a brother Muslimand could not be dealt with as an enemy. I‘Ab relates a case in which the Muslims whilesearching for the enemy came upon a man who was tending his goats. The man offeredthem the Muslim salutation but was killed as he gave no other indication of being aMuslim (B. 65: iv,      18). It was to stop such cases that the revelation came. Incidentally, itlays down the principle that no Muslim can be called a kåfir; not even the man whoseclaim to Islåm is borne out only by offering the Muslim salutation. The general tendencyamong the Muslims to declare each other kåfir is, however, so strong that even the plaininjunction of this verse is set at naught under the pretext that no Jew or Christian orHindu can be called a Muslim simply because he offers the Muslim salutation. What theverse lays down is not when a person known to us as a Jew or a Christian or a Hindu canbe declared to have become a Muslim, but that a Muslim cannot be called a kåfir if hegives indication of his being a Muslim simply by offering the Muslim salutation.\n\n94b. The Muslims were forbidden to kill a man merely because he was a disbeliever. This is made clear in Section 12, where it is laid down that only those disbelieverscould be killed who fought against the Muslims. But even when a people fought againstthe Muslims, a man from among them was not to be killed if he gave the slightestindication that he was a Muslim. \n\n97a. By those who were unjust to themselves are meant persons who wereconvinced of the truth of Islåm, but chose to remain among the disbelievers, who did notallow them to give expression to their beliefs, notwithstanding that they had the meansto join the Muslims and avow Islåm openly.\n\n101a. It is agreed that the prayer service on a journey is shorter than the ordinaryprayer service in the ˚uhr, ‘a©r and ‘ishå’ prayers and consists of two rak‘ahs far˙ insteadof four. It is further clear from reports that this was so before the revelation of this verse.According to ‘Å’ishah, prayer as instituted from the first consisted of two rak‘ahs only,whether one was journeying or not, and later on ordinary service in these three prayerswas increased to four (B. 8: 1). According to I‘Ab, prayer as enjoined from the first consisted of four rak‘ahs in these three prayers ordinarily, and two rak‘ahs when journeying(Ms. 6: 5). According to both these views, the shortening of prayer as mentioned in thisverse is quite different from the ordinary shorter service of the journey, and its details aregiven in the next verse. According to ‘Umar, however, the shortening on a journey was aresult of the revelation of this verse, and though originally this shortening was allowedonly when there was danger from the enemy, it was later on allowed on every journey,whether there was any danger or not. When a question was put to him why prayer wasbeing shortened on a journey when there was no longer any danger, there being peace allaround, he replied that he put the same question to the Prophet of God and was told thatthe shortening “was a ©adaqah (or charitable gift) of God, so accept His gift” (AD. 4: 1).\n\n102a.  This verse and the previous one show the importance of prayer in Islåm,which could not be neglected even when facing the enemy. The soldiers of Islåm werenot men with whom fighting was a primary occupation; the chief object of their lives, asthese verses show, was to hold communion with the Diving Being, forgetting even theirimminent danger, when the time of holding such communion arrived.According to what is stated in this verse, the congregation performed only onerak‘ah of prayer with the Prophet who was leading the prayer and said two rak‘ahs, butwe are told in a ƒadßth that the other rak‘ah was said by each part of the congregationseparately (B. 12: 1). This shows the importance of offering prayer in congregationwhich could not be neglected even on the field of battle.\n\n103a. By kitåb mauq∂t, or a timed ordinance, is meant an ordinance regulated as totime, or ordained to be performed at fixed times. The hours of prayer were thereforefixed by the Prophet under Divine guidance, and the observance of the hours of prayer isan essential part of the due observance of prayer. It is this feature of the Islamic prayerwhich makes it a unique force in the unification of the human race.\n\n105a. With a little difference in details, the commentators agree that the occasion ofthe revelation of these verses was a dispute between a Muslim and a Jew, in which judgment was given by the Prophet against the Muslim. Ôa‘mah ibn Ubairaq had stolen acoat of mail, and having hidden it at a Jew’s, afterwards accused the Jew of the theft,while his tribe supported him. The Prophet, notwithstanding the open enmity of theJews, cleared the Jew of the charge. It was a time when every Muslim hand was sorelyneeded for the defence of Islåm, and a verdict against a man supported by his wholetribe meant the loss of that tribe. But such considerations did not carry any weight withthe Prophet. Thus these verses lay down the broad principle that dishonesty must bepunished, and the balance of justice must be held equal between Muslims and nonMuslims and between friends and foes.\n\n106a. The injunction in this as well as the previous verse is meant for every Muslimwho is called upon to act as a judge. He must be strictly just as between his own peopleand aliens, and must further ask the protection of Allåh from being guilty of an act ofinjustice, even unknowingly, for it is only through Divine protection, that a man in thisposition can avoid partiality.\n\n108a. Those who supported the guilty man are spoken of here. All such persons arecondemned as hypocrites. The same subject is continued in the verses that follow.\n\n113a. A˙alla-h∂ is the equivalent of ahlaka-h∂, he destroyed him or brought him toperdition (LL).\n\n115a. This verse clearly speaks of the hypocrites, who followed a way other thanthe way of the believers. Only a distortion of the words could make them signify that itwas a sin to differ with the majority of the Muslims on any question of religion. \n\n117a. Inåth has two significances, either of which may be adopted. (1) It signifiesinanimate things, as trees and stones and wood. (2) It also means idols, because theynamed the idols as females, for instance Låt, ‘Uzzå, Manåt, (LL). Ïasan says every oneof the Arabian tribes had an idol, which they called the unthå (lit., female) of such atribe (Rz). Hence the word may also be translated as feminine divinities.\n\n117b. Marßd and mårid have both the same significances, viz., one devoid of allgood (R). According to LL the significance of marßd is insolent or rebellious.\n\n119a. The practice of slitting or cutting off the ear of certain animals was a prevalent form of polytheism in Arabia, for such an animal was looked upon as devoted tocertain idols. See further 5: 103a.\n\n119b. A comparison with 30: 30 will show clearly that by Allåh’s creation is heremeant the religion of Allåh, because the true religion is the natural religion of man. In30: 30 we have: “So set thy face for religion, being upright, the nature made by Allåh inwhich He has created men. There is no altering Allåh’s creation. That is the right religion — but most people know not”. By the devil’s changing the creation of Allåh istherefore meant the changing of the natural religion of man which requires obedience toAllåh and His laws. Some commentators understand by changing the creation of Allåhthe using of His created things for an object other than that for which they were created,and worshipping objects such as the sun, etc., which were really created to be subservient to man.\n\n123a.  The vain desires of the idolaters were that they would not be raised afterdeath: “And they say: There is nothing but our life of this world, and we shall not beraised again” (6: 29). As regards the People of the Book: “And the Jews and theChristians say: We are the sons of Allåh and His beloved ones” (5: 18). The true law —the law of nature — is described in what follows, that evil or good has its own reward.\n\n127a. The reference in the words, that which is recited to you in the Book, is to v. 3,see 3a. There is almost a consensus of opinion on this point. Yatåma-l-niså’i meansorphans of women; also women having no husbands or widows (LA). The doing of goodto women and orphans is stressed in the Holy Qur’ån again and again. What is stated hereis that a decision regarding the doing of good to women, to weak children and to orphanshas already been given. The words, and that which is recited to you in the Book is concerning widowed women, whom you give not what is appointed for them, while you arenot inclined to marry them, are parenthetical, being a reference to v. 3. Whatever significance of the words yatåma-l-niså’i is adopted, the meaning of the parenthetical passage isthat the order given in v. 3 in the words if you fear that you cannot do justice to orphansmarry such women as seem good to you, relates to orphans of the women (or to widows)whom their share in inheritance was denied, both their share and the share of their orphanchildren, nor were people inclined to marry them owing to the burden which they broughtwith them in the shape of their children. So the permission was given that they maymarry such women, even up to four. It is an admitted fact that widows and their orphanedchildren received no share of inheritance. The Qur’ån brought about a great change: itrequired the giving of inheritance to both women and their orphaned children, and it alsorecommended that such women should be taken in marriage. The reference to v. 3 ismade further clear in v. 129 which speaks of justice between wives.\n\n128a. There are two words, nush∂z and i‘rå˙, used here. The former literally meansrising, and nush∂z on the part of the wife has already been explained in 34e. Nush∂z onthe part of the husband signifies treating her unjustly, being unkind to her or dislikingand hating her (LL), and hence it is rendered here as ill-usage or cruelty. I‘rå˙ is literally turning away, avoiding, shunning or leaving a thing. Hence I render it as desertion.\n\n135a. The meaning is that you should not be partial to the rich man on account ofsome favour that you may expect from him or some harm that you fear from him, norshould you state other than the truth when the person against whom you bear witness isa poor man, on account of compassion for him. Allåh has a better right over them meansthat they should be dealt with justly. Thus, neither ties of kinship and love nor considerations of fear, favour, or compassion should make one swerve a hair’s breadth from thetruth. \n\n137a. There were some waverers who again and again went over to disbelief. Themention in v. 136 of the Book “which He revealed before”, shows clearly that the Jewsare meant, among whom there were many hypocrites.\n\n137b.  Allåh’s not guiding them is the consequence of their own actions. Theywavered first but in the end became firm in disbelief.\n\n138a. Tabshßr (related to bushrah, i.e. complexion) originally denotes the announcing of an event which produces a change in the complexion. In common acceptance it isused with regard to the news which rejoices a man, but is sometimes used for theannouncement of an event which grieves a man (LL). \n\n140a. See 6: 68 which was revealed at Makkah. The Muslims are told to leave theassembly where truth is derided. Criticism is quite a different thing and a Muslim shouldalways be ready to meet any criticism of his religion.\n\n142a. For the meaning of khada‘a and khåda‘a see 2: 9a. Khådi‘u-hum means herethe requiter to them of their deceit (LL). A comparison of this passage with the similarpassage occurring in 2: 9 makes the meaning perfectly clear.\n\n143a. Mudhabdhab, lit., much driven away, has the same significance as mudhabdhib, i.e., wavering or vacillating between two things or affairs (LL). Thereference in that and this is to belief and disbelief, which is made clear by the words thatfollow — belonging neither to these nor to those, which refer to the believers anddisbelievers spoken of in the concluding words of v. 141. \n\n145a.  Insincerity in religion is the worst of all sins. Hence the hypocrites arespoken of as being in the lowest depths of the Fire. The most important question forevery believer is: Are his actions in accordance with his avowed beliefs? Does he dowhat he says? If not, there is a tinge of hypocrisy in him. Elsewhere it is said: “O youwho believe, why say you that which you do not? It is most hateful in the sight of Allåhthat you say that which you do not” (61: 2,      3). The next verse makes a pointedreference to this — God will not punish the Muslims if they are true to their beliefs.\n\n147a. The word shåkir when used as an attribute of the Divine Being signifies OneWho gives large reward for small works or in Whose estimation small works performedby His servants increase, and Who multiplies His rewards to them (T, LL). \n\n148a. The use of defamatory speech of every kind regarding others is strictly forbidden, but justification for it may exist in case a person has in some way been wronged. \n\n149a. If you pardon the evil which anyone has done to you, Allåh will pardon yourevils, and grant you even good reward; He is not only Pardoning, but also Powerful togrant good reward. \n\n152a. To make distinction between Allåh and His messengers means to believe in oneand not in the other. Islåm requires the acceptance of all prophets who were raised for theregeneration of men, and hence a denial of any one of the prophets named in the HolyQur’ån takes a man out of the category of believers and places him among the disbelievers.\n\n155a. The incidents referred to in vv. 153–155 have been mentioned in detail in sections 6-8 of ch. 2, see the footnotes there.\n\n156a. The calumny referred to was that Mary was guilty of fornication (Rz). Jewishtradition in this connection mentions Panther (Jewish Life of Jesus). \n\n157a. The words må ©alab∂-hu do not negative Jesus’ being nailed to the cross; theynegative his having expired on the cross as a result of being nailed to it. ˝alb is a well-known way of killing (T, LA). ˝alaba-h∂ means he put him to death in a certain wellknown manner (LL). That Jesus died a natural death is plainly stated in 5: 117: “and I wasa witness of them so long as I was among them, but when Thou didst cause me to die,Thou wast the Watcher over them”. See 5: 117a. The Gospels contain clear testimonyshowing that Jesus Christ escaped death on the cross. The following points may be noted:(1) Jesus remained on the cross for a few hours only (Mark 15: 25; John 19: 14) but deathby crucifixion was always tardy. (2) The two men crucified with Jesus were still alivewhen taken down from the cross; the presumption is that Jesus too was alive. (3) Thebreaking of legs was resorted to in the case of the two criminals, but dispensed with in thecase of Jesus (John 19: 32,      33). (4) The side of Jesus being pierced, blood rushed out andthis was a certain sign of life. (5) Even Pilate did not believe that Jesus actually died in soshort a time (Mark 15: 44). (6) Jesus was not buried like the two criminals, but was giveninto the charge of a wealthy disciple of his, who lavished care on him and put him in aspacious tomb hewn in the side of a rock (Mark 15: 46). (7) When the tomb was seen onthe third day, the stone was found to have been removed from its mouth (Mark 16: 4),which would not have been the case if there had been a supernatural rising. (8) Mary,when she saw him, took him for the gardener (John 20: 15), which shows that Jesus haddisguised himself as a gardener. (9) Such disguise would not have been needed if Jesushad risen from the dead. (10) It was in the same body of flesh that the disciples saw Jesus,and the wounds were still there deep enough for a man to thrust his hand in (John 20: 25–28). (11) He still felt hunger and ate as his disciples ate (Luke 24: 39– 43).(12) Jesus Christ undertook a journey to Galilee with two of his disciples walking side byside with him (Matt. 28: 10), which shows that he was fleeing for refuge; a journey toGalilee was not necessary to rise to heaven. (13) In all post-crucifixion appearances Jesusis found hiding himself as if he feared being discovered. (14) Jesus Christ prayed thewhole night before his arrest to be saved from the accursed death on the cross, and healso asked his disciples to pray for him; the prayers of a righteous man in distress andaffliction are always accepted. He seems to have even received a promise from God to besaved, and it was to this promise that he referred when he cried out on the cross: “MyGod, my God, why hast Thou forsaken me?” Heb. 5: 7 makes the matter still more clear,for there it is plainly stated that the prayer of Jesus was accepted: “When he had offeredup prayers and supplications with strong crying and tears unto Him that was able to savehim from death, and was heard in that he feared”.The statements made in the Qur’ån corroborate the above statements quoted fromthe Gospels. Jesus did not die on the cross, nor was he killed as were the two thieves,but to the Jews he appeared as if he were dead. \n\n157b. The words shubbiha la-hum may bear two interpretations: he was made to belike (it) or to resemble (it); or the matter was made dubious or obscure (LL). The R∂ƒal-Ma‘ånß says the meaning may be that the matter became dubious to them. The storythat someone else was made to resemble Jesus is not borne out by the words of theQur’ån, which could only mean, if an object were mentioned, that Jesus was made toresemble someone, not that someone was made to resemble Jesus.\n\n158a. For the significance of raf‘ see 3: 55b. Being exalted in the Divine presencewas opposed to being killed on the cross. Deut. 21: 23 explains this, for there we have,he that is hanged is accursed of God. If Jesus had died on the cross he would have beenaccursed; hence the statement made here — he was not killed on the cross and accursedbut he was exalted in the Divine presence.\n\n159a. Both the Jews and the Christians necessarily believe in the death of Jesus onthe cross, while according to the Holy Qur’ån they have really no sure knowledge of it.The Jews reject his claim to Messiahship on the basis of Deut. 21: 23: “He that is hangedis accursed of God”. Their belief is that since Jesus died on the cross he was accursed,and no one who is accursed of God can be a prophet. Following quite a different line ofargument, a Christian believes that Jesus died on the cross and was accursed. He admitsthe truth of Deut. 21: 23, but he says that unless Jesus were accursed he could not takeaway the sins of those that believe in him. As in Gal. 3: 13: “Christ hath redeemed usfrom the curse of the law, being made a curse for us; for it is written, Cursed is everyone that hangeth on a tree”. Hence the fundamental principle of the belief of both Jewsand Christians is that Jesus died on the cross, and the meaning of the verse is clear, viz.,every Jew and Christian, notwithstanding that he has no sure knowledge at all, mustbelieve before his death that Jesus died on the cross.\n\n164a. The prophets spoken of here all belong to the Israelite race. Abraham and hisimmediate descendants are mentioned first; then follow the three prophets of Israel whosuffered great tribulations, viz. Jesus, Job, and Jonah. The next group is that of the fourwho were both rulers and prophets, viz. Moses, Aaron, David and Solomon. But asDavid and Moses stand in a special relation to the Holy Prophet, the former singing hispraises throughout his Psalms and the latter prophesying his advent in the clearestwords, they are spoken of separately at the end. The good news which they broughtrelates as much to the peace and happiness which is granted to the righteous as to theadvent of one who, coming at the end, should unite the qualifications of all the prophetsin his own person, and accordingly make the nations of the earth as one nation.\n\n171a. Kalimah, or word, is here equivalent to prophecy, in which sense the word isfrequently used in the Holy Qur’ån. Jesus is called a prophecy because he was born inaccordance with a prophecy from Allåh, just as in a saying the Holy Prophet speaks ofhimself as “the prayer of my father Abraham”, the significance being that he appeared infulfilment of Abraham’s prayer. For a fuller explanation see 3: 45a. And the significanceof ilqå’ varies according to its object. When its object is a tangible thing, it implies theact of throwing or casting. But you say alqaitu ilai-hi khair-an, i.e., I did good to him,and alqaitu ilai-hi-l-mawaddata, i.e., I offered love to him (T, LL), and alqå ilayyasirra-h∂, i.e., he revealed to me his secret (T in art. sirr), and alqaitu ilai-hi-l-qaulawhich corresponds to what is said here, the object of the verb being kalimah instead ofqaul, both having the same meaning, must be rendered I communicated to him thesaying. Sale’s and Rodwell’s conveying into Mary and Palmer’s casting into Mary, as ifthe object were a tangible one, are foreign to the real sense of the word.\n\n171b. Rauƒ and r∂ƒ both mean mercy of Allåh, according to Az (LL under rauƒ), thisbeing the proper significance of the word in the passage under discussion. R∂ƒ also signifies inspiration or Divine revelation (T, LL). If this significance is adopted, it would bean explanation of what is said in the foregoing words, i.e. His prophecy which He communicated to Mary. The passage would thus mean that the advent of Jesus was in accordancewith a prophecy and an inspiration from the Divine Being. Even if we take spirit to be the meaning of the word r∂ƒ, it does in no way carry Jesus a step beyond the limits of mortality, for of Adam also it has been said, I breathed My spirit into him (15: 29). In fact, according to the Holy Qur’ån the spirit of God is breathed into every man: “Then He made himcomplete and breathed into him of His spirit and gave you ears and eyes and hearts”(32: 9). Further we have a saying referred to by LL under rauƒ, aƒya al-nåsa bi-r∂ƒi-hß,where the correct reading is r∂ƒ, and not rauƒ, meaning He (God) has quickened all menwith His spirit. And r∂ƒ-un min-hu, which could only mean a spirit from Him, is furtherevidence that even in this sense the word is not exclusively applicable to Jesus, for he isnot the word of God or the spirit from Him, but only a word or a spirit.\n\n171c. The doctrine of Trinity is plainly rejected here. There are not three persons inGodhead, but only one: Allåh is only one God. The Holy Qur’ån nowhere says that theChristian Trinity is formed of Jesus, Mary, and God, although it no doubt refers to theRoman Catholic doctrine of the worship of Mary in 5: 116, for which see 5: 116a.\n\n176a.  The rule given here supplements the law of inheritance as given at thecommencement of this chapter, and is said to have been revealed very late. As explainedin 12b, the kalålah spoken of here is different from the kalålah spoken of in v. 12. Herethere are neither children nor parents and therefore the whole of the inheritance goes tothe brothers and the sisters. Reversion to the law of inheritance just after speaking of Jesus Christ has perhaps adeeper meaning. It is a fact that no prophet appeared among the Israelites after JesusChrist, and therefore his death really left Israel without a spiritual head who should rise tothe eminence of prophethood. The spiritual kingdom which was promised to Abrahamand which hitherto remained in the house of Israel, was now taken from the Israelites andmade over to the brother nation, the Ishmaelites. This would also explain the wordsaddressed to Moses: “God will raise up unto thee a Prophet from the midst of thee, of thybrethren, like unto me” (Deut. 18: 15), where the spiritual inheritance is clearly made todevolve on the brethren of the Israelites, i.e., the Ishmaelites, and thus from the midst ofthee is clearly explained as meaning from the midst of thy brethren. Moses saw clearlythat the Israelites would lose their title to the inheritance of the spiritual kingdom beforethe advent of the Prophet who was to be his like. And Jesus made the same clear in different words when he said, addressing the Israelites: “The kingdom of God shall be takenfrom you and given to a nation bringing forth the fruits thereof” (Matt. 21: 43)"      
    }
  ]
}
