{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "ق ۚ وَالْقُرْآنِ الْمَجِيدِ",
      "verseStringB": "Almighty (God)!ᵃ By the glorious Qur’ān!ᵇ"
    },
    {
      "verseNumber": 2,
      "verseString": "بَلْ عَجِبُوا أَنْ جَاءَهُمْ مُنْذِرٌ مِنْهُمْ فَقَالَ الْكَافِرُونَ هَٰذَا شَيْءٌ عَجِيبٌ",
      "verseStringB": "Nay, they wonder that a warner has come to them from among themselves; so the disbelievers say: This is a wonderful thing!"
    },
    {
      "verseNumber": 3,
      "verseString": "أَإِذَا مِتْنَا وَكُنَّا تُرَابًا ۖ ذَٰلِكَ رَجْعٌ بَعِيدٌ",
      "verseStringB": "When we die and become dust — that is a far return."
    },
    {
      "verseNumber": 4,
      "verseString": "قَدْ عَلِمْنَا مَا تَنْقُصُ الْأَرْضُ مِنْهُمْ ۖ وَعِنْدَنَا كِتَابٌ حَفِيظٌ",
      "verseStringB": "We know indeed what the earth diminishes of them and with Us is a book that preserves.ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "بَلْ كَذَّبُوا بِالْحَقِّ لَمَّا جَاءَهُمْ فَهُمْ فِي أَمْرٍ مَرِيجٍ",
      "verseStringB": "Nay, they reject the Truth when it comes to them, so they are in a state of confusion.ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "أَفَلَمْ يَنْظُرُوا إِلَى السَّمَاءِ فَوْقَهُمْ كَيْفَ بَنَيْنَاهَا وَزَيَّنَّاهَا وَمَا لَهَا مِنْ فُرُوجٍ",
      "verseStringB": "Do they not look at the sky above them? — how We have made it and adorned it and it has no gaps."
    },
    {
      "verseNumber": 7,
      "verseString": "وَالْأَرْضَ مَدَدْنَاهَا وَأَلْقَيْنَا فِيهَا رَوَاسِيَ وَأَنْبَتْنَا فِيهَا مِنْ كُلِّ زَوْجٍ بَهِيجٍ",
      "verseStringB": "And the earth, We have spread it out, and cast therein mountains, and We have made to grow therein of every beautiful kind —"
    },
    {
      "verseNumber": 8,
      "verseString": "تَبْصِرَةً وَذِكْرَىٰ لِكُلِّ عَبْدٍ مُنِيبٍ",
      "verseStringB": "To give sight and as a reminder to every servant who turns (to Allāh)."
    },
    {
      "verseNumber": 9,
      "verseString": "وَنَزَّلْنَا مِنَ السَّمَاءِ مَاءً مُبَارَكًا فَأَنْبَتْنَا بِهِ جَنَّاتٍ وَحَبَّ الْحَصِيدِ",
      "verseStringB": "And We send down from the clouds water abounding in good, then We cause to grow thereby gardens and the grain that is reaped,"
    },
    {
      "verseNumber": 10,
      "verseString": "وَالنَّخْلَ بَاسِقَاتٍ لَهَا طَلْعٌ نَضِيدٌ",
      "verseStringB": "And the tall palm-trees having flower spikes piled one above another —"
    },
    {
      "verseNumber": 11,
      "verseString": "رِزْقًا لِلْعِبَادِ ۖ وَأَحْيَيْنَا بِهِ بَلْدَةً مَيْتًا ۚ كَذَٰلِكَ الْخُرُوجُ",
      "verseStringB": "A sustenance for the servants, and We give life thereby to a dead land. Thus is the rising.ᵃ"
    },
    {
      "verseNumber": 12,
      "verseString": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَأَصْحَابُ الرَّسِّ وَثَمُودُ",
      "verseStringB": "Before them the people of Noah rejected (the Truth) and (so did) the dwellers of al-Rass and Tham∂d"
    },
    {
      "verseNumber": 13,
      "verseString": "وَعَادٌ وَفِرْعَوْنُ وَإِخْوَانُ لُوطٍ",
      "verseStringB": "And ‘ād and Pharaoh and Lot’s brethren,"
    },
    {
      "verseNumber": 14,
      "verseString": "وَأَصْحَابُ الْأَيْكَةِ وَقَوْمُ تُبَّعٍ ۚ كُلٌّ كَذَّبَ الرُّسُلَ فَحَقَّ وَعِيدِ",
      "verseStringB": "And the dwellers of the grove and the people of Tubba‘.ᵃ They all rejected the messengers, so My threat came to pass."
    },
    {
      "verseNumber": 15,
      "verseString": "أَفَعَيِينَا بِالْخَلْقِ الْأَوَّلِ ۚ بَلْ هُمْ فِي لَبْسٍ مِنْ خَلْقٍ جَدِيدٍ",
      "verseStringB": "Were We then fatigued with the first creation? Yet they are in doubt about a new creation.ᵃ"
    },
    {
      "verseNumber": 16,
      "verseString": "وَلَقَدْ خَلَقْنَا الْإِنْسَانَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِ نَفْسُهُ ۖ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ",
      "verseStringB": "And certainly We created man, and We know what his mind suggests to him — and We are nearer to him than his life-vein."
    },
    {
      "verseNumber": 17,
      "verseString": "إِذْ يَتَلَقَّى الْمُتَلَقِّيَانِ عَنِ الْيَمِينِ وَعَنِ الشِّمَالِ قَعِيدٌ",
      "verseStringB": "When the two receivers receive, sitting on the right and on the left,"
    },
    {
      "verseNumber": 18,
      "verseString": "مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ",
      "verseStringB": "He utters not a word but there is by him a watcher at hand.ᵃ"
    },
    {
      "verseNumber": 19,
      "verseString": "وَجَاءَتْ سَكْرَةُ الْمَوْتِ بِالْحَقِّ ۖ ذَٰلِكَ مَا كُنْتَ مِنْهُ تَحِيدُ",
      "verseStringB": "And the stupor of death comes in truth; that is what thou wouldst shun."
    },
    {
      "verseNumber": 20,
      "verseString": "وَنُفِخَ فِي الصُّورِ ۚ ذَٰلِكَ يَوْمُ الْوَعِيدِ",
      "verseStringB": "And the trumpet is blown. That is the day of threatening."
    },
    {
      "verseNumber": 21,
      "verseString": "وَجَاءَتْ كُلُّ نَفْسٍ مَعَهَا سَائِقٌ وَشَهِيدٌ",
      "verseStringB": "And every soul comes, with it a driver and a witness.ᵃ"
    },
    {
      "verseNumber": 22,
      "verseString": "لَقَدْ كُنْتَ فِي غَفْلَةٍ مِنْ هَٰذَا فَكَشَفْنَا عَنْكَ غِطَاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ",
      "verseStringB": "Thou wast indeed heedless of this, but now We have removed from thee thy veil, so thy sight is sharp this day.ᵃ"
    },
    {
      "verseNumber": 23,
      "verseString": "وَقَالَ قَرِينُهُ هَٰذَا مَا لَدَيَّ عَتِيدٌ",
      "verseStringB": "And his companion will say: This is what is ready with me.ᵃ"
    },
    {
      "verseNumber": 24,
      "verseString": "أَلْقِيَا فِي جَهَنَّمَ كُلَّ كَفَّارٍ عَنِيدٍ",
      "verseStringB": "Cast into hell every ungrateful, rebellious one,ᵃ"
    },
    {
      "verseNumber": 25,
      "verseString": "مَنَّاعٍ لِلْخَيْرِ مُعْتَدٍ مُرِيبٍ",
      "verseStringB": "Forbidder of good, exceeder of limits, doubter,"
    },
    {
      "verseNumber": 26,
      "verseString": "الَّذِي جَعَلَ مَعَ اللَّهِ إِلَٰهًا آخَرَ فَأَلْقِيَاهُ فِي الْعَذَابِ الشَّدِيدِ",
      "verseStringB": "Who sets up another god with Allāh, so cast him into severe chastisement."
    },
    {
      "verseNumber": 27,
      "verseString": "قَالَ قَرِينُهُ رَبَّنَا مَا أَطْغَيْتُهُ وَلَٰكِنْ كَانَ فِي ضَلَالٍ بَعِيدٍ",
      "verseStringB": "His companion will say: Our Lord, I did not cause him to rebel but he himself went far in error."
    },
    {
      "verseNumber": 28,
      "verseString": "قَالَ لَا تَخْتَصِمُوا لَدَيَّ وَقَدْ قَدَّمْتُ إِلَيْكُمْ بِالْوَعِيدِ",
      "verseStringB": "He will say: Dispute not in My presence, and indeed I gave you warning beforehand."
    },
    {
      "verseNumber": 29,
      "verseString": "مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ وَمَا أَنَا بِظَلَّامٍ لِلْعَبِيدِ",
      "verseStringB": "My sentence cannot be changed, nor am I in the least unjust to the servants."
    },
    {
      "verseNumber": 30,
      "verseString": "يَوْمَ نَقُولُ لِجَهَنَّمَ هَلِ امْتَلَأْتِ وَتَقُولُ هَلْ مِنْ مَزِيدٍ",
      "verseStringB": "On the day when We say to hell: Art thou filled up? And it will say: Are there any more?ᵃ"
    },
    {
      "verseNumber": 31,
      "verseString": "وَأُزْلِفَتِ الْجَنَّةُ لِلْمُتَّقِينَ غَيْرَ بَعِيدٍ",
      "verseStringB": "And the Garden is brought near for those who guard against evil — (it is) not distant.ᵃ"
    },
    {
      "verseNumber": 32,
      "verseString": "هَٰذَا مَا تُوعَدُونَ لِكُلِّ أَوَّابٍ حَفِيظٍ",
      "verseStringB": "This is what you are promised — for everyone turning (to Allāh), keeping (the limits) —"
    },
    {
      "verseNumber": 33,
      "verseString": "مَنْ خَشِيَ الرَّحْمَٰنَ بِالْغَيْبِ وَجَاءَ بِقَلْبٍ مُنِيبٍ",
      "verseStringB": "Who fears the Beneficent in secret, and comes with a penitent heart:"
    },
    {
      "verseNumber": 34,
      "verseString": "ادْخُلُوهَا بِسَلَامٍ ۖ ذَٰلِكَ يَوْمُ الْخُلُودِ",
      "verseStringB": "Enter it in peace. That is the day of abiding."
    },
    {
      "verseNumber": 35,
      "verseString": "لَهُمْ مَا يَشَاءُونَ فِيهَا وَلَدَيْنَا مَزِيدٌ",
      "verseStringB": "For them therein is all they wish, and with Us is yet more.ᵃ"
    },
    {
      "verseNumber": 36,
      "verseString": "وَكَمْ أَهْلَكْنَا قَبْلَهُمْ مِنْ قَرْنٍ هُمْ أَشَدُّ مِنْهُمْ بَطْشًا فَنَقَّبُوا فِي الْبِلَادِ هَلْ مِنْ مَحِيصٍ",
      "verseStringB": "And how many a generation We destroyed before them who were mightier in prowess than they! So they went about in the lands. Is there a place of refuge?"
    },
    {
      "verseNumber": 37,
      "verseString": "إِنَّ فِي ذَٰلِكَ لَذِكْرَىٰ لِمَنْ كَانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وَهُوَ شَهِيدٌ",
      "verseStringB": "Surely there is a reminder in this for him who has a heart or he gives ear and is a witness."
    },
    {
      "verseNumber": 38,
      "verseString": "وَلَقَدْ خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِي سِتَّةِ أَيَّامٍ وَمَا مَسَّنَا مِنْ لُغُوبٍ",
      "verseStringB": "And certainly We created the heavens and the earth and what is between them in six periods, and no fatigue touched Us.ᵃ"
    },
    {
      "verseNumber": 39,
      "verseString": "فَاصْبِرْ عَلَىٰ مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ الْغُرُوبِ",
      "verseStringB": "So bear with what they say, and celebrate the praise of thy Lord before the rising of the sun and before the setting."
    },
    {
      "verseNumber": 40,
      "verseString": "وَمِنَ اللَّيْلِ فَسَبِّحْهُ وَأَدْبَارَ السُّجُودِ",
      "verseStringB": "And glorify Him in the night and after prostration.ᵃ"
    },
    {
      "verseNumber": 41,
      "verseString": "وَاسْتَمِعْ يَوْمَ يُنَادِ الْمُنَادِ مِنْ مَكَانٍ قَرِيبٍ",
      "verseStringB": "And listen on the day when the crier cries from a near place —"
    },
    {
      "verseNumber": 42,
      "verseString": "يَوْمَ يَسْمَعُونَ الصَّيْحَةَ بِالْحَقِّ ۚ ذَٰلِكَ يَوْمُ الْخُرُوجِ",
      "verseStringB": "The day when they hear the cry in truth. That is the day of coming forth.ᵃ"
    },
    {
      "verseNumber": 43,
      "verseString": "إِنَّا نَحْنُ نُحْيِي وَنُمِيتُ وَإِلَيْنَا الْمَصِيرُ",
      "verseStringB": "Surely We give life and cause to die, and to Us is the eventual coming—"
    },
    {
      "verseNumber": 44,
      "verseString": "يَوْمَ تَشَقَّقُ الْأَرْضُ عَنْهُمْ سِرَاعًا ۚ ذَٰلِكَ حَشْرٌ عَلَيْنَا يَسِيرٌ",
      "verseStringB": "The day when the earth cleaves asunder from them, hastening forth. That is a gathering easy to Us."
    },
    {
      "verseNumber": 45,
      "verseString": "نَحْنُ أَعْلَمُ بِمَا يَقُولُونَ ۖ وَمَا أَنْتَ عَلَيْهِمْ بِجَبَّارٍ ۖ فَذَكِّرْ بِالْقُرْآنِ مَنْ يَخَافُ وَعِيدِ",
      "verseStringB": "We know best what they say, and thou art not one to compel them. So remind by means of the Qur’ān him who fears My threat.ᵃ"
    }
  ],
  "nameEnglish": "Qaf",
  "nameTrans": "Qaf",
  "nameArabic": "ق",
  "chapterNumber": 50,
  "nVerses": 45,
  "footnotes": [
    {
      "note": "1a. The letter Qåf stands for the name Qådir (or Qadßr) of the Divine Being, meaning Omnipotent or All-Powerful, or for al-Qiyåmat, the Resurrection.\n\n1b. An expression of wonder at the disbelief of people. The whole of the Qur’ån is spoken of as one book even at this early period. Here the Qur’ån is called majßd or glorious;elsewhere it is called karßm or bounteous (56:77) and ƒakßm or full of wisdom (36:2).\n\n4a. What the earth diminishes is the body, dust going to dust. The book that preserves is the record of the deeds which a man has done. The consequences of deeds arepreserved in their entirety and out of them grows a new life in the Resurrection.\n\n5a. Their confusion is due to the rejection of truth. They were in a state of confusionas to what name to give the Prophet — they called him first a dreamer, then a poet, thena madman, then an enchanter, then a forger and liar, and so on.\n\n11a. The khur∂j, or rising, here includes both the spiritual resurrection of a deadpeople in this life and also the greater Resurrection in a life after death.\n\n14a. For the dwellers of al-Rass, see 25:38a; for dwellers of the grove, 15:78a; forTubba‘, 44:37a.\n\n15a. The meaning is that Allåh did not lack power in dealing with the former generations so that they should doubt His power in dealing with a new one. Or, the first creation is the physical creation of man, and the second creation his spiritual regeneration.\n\n18a. The three verses impress upon man that all his deeds and words bear fruit, thatnothing is said or done in vain. The yamßn, or the right side, represents the good, and theshimål, or the left side, the evil (T).\n\n21a. The driver signifies the impeller to evil, and the witness the caller to Truth.\n\n22a. This verse shows clearly that the consequences of evil actions which remain hidden from the eye of man in this life are made manifest after death. This is the significanceof the sight being made sharp, so that man will then see what he is unable to see here. Suchis hell, according to the teachings of the Qur’ån, viz., the hidden consequences of evildeeds, when made manifest to a man, become his hell.\n\n23a. By qarßn, or the companion, is meant the evil companion, or the devil, at whosesuggestion man commits evil deeds. What is ready is the record of man’s evil deeds,which will be palpably manifest to him on the day of Resurrection.\n\n24a. The dual form used in alqiyå (“cast”) is either due to the address being to thetwo, the driver and the witness of v. 21, or the dual is used simply to give emphasis tothe order, as if it conveyed a repetition of the order (Kf ).\n\n30a. It is a metaphorical expression. One people after another continue in theirwickedness without taking a lesson from the fate of the previous people. It is also anexpression of man’s desire to have more and more of wealth and material comfort.\n\n31a. If man used his inner sight, he could see that the keeping from evil and thedoing of good brought him nearer and nearer to true happiness, for which the Gardenstands here, in this very life.\n\n35a. This is to show that the doing of good gives man all that he desires. But as hisdesires are limited, he is told that God will give him more than he desires. This isexplained by some as meaning the sight of the Divine Being, which is the highest blessing of the next life.\n\n38a. The Bible says: “And He rested on the seventh day from all His work whichHe had made” (Gen. 2:2). The act of taking rest applies to one who is tired, and hencethe Qur’ån negatives any such idea in relation to God, Who does not stand in need ofrest; hence it says: No fatigue touched Us. For the creation of the heavens and the earthin six periods or six days, see 7:54a.\n\n40a. Suj∂d or prostration here stands for prayer. The significance is that one shouldnot get tired of glorifying God; prayer is in its entirety a glorification of God, but evenafter prayer, one should continue the glorification of God.\n\n42a. The munåd, or the crier, is the Prophet: see 3:193, where the Prophet is plainlyspoken of as being the crier: “Our Lord, surely we have heard a Crier calling to theFaith, saying: Believe in your Lord”. This cry was a distant cry at first, but, as we aretold in the previous verse, it will be a cry from a near place in the end, so that peoplewill listen to it in truth, as we are told here. Note that the spiritual resurrection to bebrought about in this life by the Prophet is spoken of in the whole of this chapter, alongwith the greater Resurrection of the next life.\n\n45a. The words, thou art not one to compel them, refer plainly to the spiritual resurrection, which the Prophet desired to see immediately; he is told that he will see the dead coming to life but he could not compel people to accept the truth. The cleaving asunder of theearth in the previous verse and their hastening forth to life spiritual and their gathering inIslåm were all witnessed in the lifetime of the Prophet, and may be witnessed again in thenear future. Note that this spiritual resurrection does not mean that there would be noResurrection after death. On the other hand, it is treated as an evidence of the greaterResurrection, and that is the reason why both resurrections are spoken of in the same words."
    }
  ]
}
