{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "وَالذَّارِيَاتِ ذَرْوًا",
      "verseStringB": "By those scattering broadcast!"
    },
    {
      "verseNumber": 2,
      "verseString": "فَالْحَامِلَاتِ وِقْرًا",
      "verseStringB": "And those bearing the load!"
    },
    {
      "verseNumber": 3,
      "verseString": "فَالْجَارِيَاتِ يُسْرًا",
      "verseStringB": "And those running easily!"
    },
    {
      "verseNumber": 4,
      "verseString": "فَالْمُقَسِّمَاتِ أَمْرًا",
      "verseStringB": "And those distributing the Affair!—"
    },
    {
      "verseNumber": 5,
      "verseString": "إِنَّمَا تُوعَدُونَ لَصَادِقٌ",
      "verseStringB": "What you are promised is surely true,"
    },
    {
      "verseNumber": 6,
      "verseString": "وَإِنَّ الدِّينَ لَوَاقِعٌ",
      "verseStringB": "And the Judgment will surely come to pass.ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "وَالسَّمَاءِ ذَاتِ الْحُبُكِ",
      "verseStringB": "By the heaven full of paths!ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "إِنَّكُمْ لَفِي قَوْلٍ مُخْتَلِفٍ",
      "verseStringB": "Surely you are of varying opinion —"
    },
    {
      "verseNumber": 9,
      "verseString": "يُؤْفَكُ عَنْهُ مَنْ أُفِكَ",
      "verseStringB": "He is turned away from it who would be turned away.ᵃ"
    },
    {
      "verseNumber": 10,
      "verseString": "قُتِلَ الْخَرَّاصُونَ",
      "verseStringB": "Cursed be the liars!"
    },
    {
      "verseNumber": 11,
      "verseString": "الَّذِينَ هُمْ فِي غَمْرَةٍ سَاهُونَ",
      "verseStringB": "Who are in an abyss, neglectful;"
    },
    {
      "verseNumber": 12,
      "verseString": "يَسْأَلُونَ أَيَّانَ يَوْمُ الدِّينِ",
      "verseStringB": "They ask: When is the day of Judgment?"
    },
    {
      "verseNumber": 13,
      "verseString": "يَوْمَ هُمْ عَلَى النَّارِ يُفْتَنُونَ",
      "verseStringB": "(It is) the day when they are tried at the Fire."
    },
    {
      "verseNumber": 14,
      "verseString": "ذُوقُوا فِتْنَتَكُمْ هَٰذَا الَّذِي كُنْتُمْ بِهِ تَسْتَعْجِلُونَ",
      "verseStringB": "Taste your persecution! This is what you would hasten on.ᵃ"
    },
    {
      "verseNumber": 15,
      "verseString": "إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَعُيُونٍ",
      "verseStringB": "Surely the dutiful are amidst Gardens and fountains,"
    },
    {
      "verseNumber": 16,
      "verseString": "آخِذِينَ مَا آتَاهُمْ رَبُّهُمْ ۚ إِنَّهُمْ كَانُوا قَبْلَ ذَٰلِكَ مُحْسِنِينَ",
      "verseStringB": "Taking that which their Lord gives them. Surely they were before that the doers of good."
    },
    {
      "verseNumber": 17,
      "verseString": "كَانُوا قَلِيلًا مِنَ اللَّيْلِ مَا يَهْجَعُونَ",
      "verseStringB": "They used to sleep but little at night."
    },
    {
      "verseNumber": 18,
      "verseString": "وَبِالْأَسْحَارِ هُمْ يَسْتَغْفِرُونَ",
      "verseStringB": "And in the morning they asked (Divine) protection."
    },
    {
      "verseNumber": 19,
      "verseString": "وَفِي أَمْوَالِهِمْ حَقٌّ لِلسَّائِلِ وَالْمَحْرُومِ",
      "verseStringB": "And in their wealth there was a due share for the beggar and for one who is denied (good).ᵃ"
    },
    {
      "verseNumber": 20,
      "verseString": "وَفِي الْأَرْضِ آيَاتٌ لِلْمُوقِنِينَ",
      "verseStringB": "And in the earth are signs for those who are sure,"
    },
    {
      "verseNumber": 21,
      "verseString": "وَفِي أَنْفُسِكُمْ ۚ أَفَلَا تُبْصِرُونَ",
      "verseStringB": "And in yourselves — do you not see?ᵃ"
    },
    {
      "verseNumber": 22,
      "verseString": "وَفِي السَّمَاءِ رِزْقُكُمْ وَمَا تُوعَدُونَ",
      "verseStringB": "And in the heavens is your sustenance and that which you are promised.ᵃ"
    },
    {
      "verseNumber": 23,
      "verseString": "فَوَرَبِّ السَّمَاءِ وَالْأَرْضِ إِنَّهُ لَحَقٌّ مِثْلَ مَا أَنَّكُمْ تَنْطِقُونَ",
      "verseStringB": "So by the Lord of the heavens and the earth! it is surely the truth, just as you speak.ᵃ"
    },
    {
      "verseNumber": 24,
      "verseString": "هَلْ أَتَاكَ حَدِيثُ ضَيْفِ إِبْرَاهِيمَ الْمُكْرَمِينَ",
      "verseStringB": "Has the story of Abraham’s honoured guests reached thee?ᵃ"
    },
    {
      "verseNumber": 25,
      "verseString": "إِذْ دَخَلُوا عَلَيْهِ فَقَالُوا سَلَامًا ۖ قَالَ سَلَامٌ قَوْمٌ مُنْكَرُونَ",
      "verseStringB": "When they came to him, they said: Peace! Peace! Said he. Strangers!"
    },
    {
      "verseNumber": 26,
      "verseString": "فَرَاغَ إِلَىٰ أَهْلِهِ فَجَاءَ بِعِجْلٍ سَمِينٍ",
      "verseStringB": "Then he turned aside to his family and brought a fat calf."
    },
    {
      "verseNumber": 27,
      "verseString": "فَقَرَّبَهُ إِلَيْهِمْ قَالَ أَلَا تَأْكُلُونَ",
      "verseStringB": "So he placed it before them. He said: Will you not eat?"
    },
    {
      "verseNumber": 28,
      "verseString": "فَأَوْجَسَ مِنْهُمْ خِيفَةً ۖ قَالُوا لَا تَخَفْ ۖ وَبَشَّرُوهُ بِغُلَامٍ عَلِيمٍ",
      "verseStringB": "So he conceived a fear of them. They said: Fear not. And they gave him the good news of a boy possessing knowledge."
    },
    {
      "verseNumber": 29,
      "verseString": "فَأَقْبَلَتِ امْرَأَتُهُ فِي صَرَّةٍ فَصَكَّتْ وَجْهَهَا وَقَالَتْ عَجُوزٌ عَقِيمٌ",
      "verseStringB": "Then his wife came up in grief, and she smote her face and said: A barren old woman!"
    },
    {
      "verseNumber": 30,
      "verseString": "قَالُوا كَذَٰلِكِ قَالَ رَبُّكِ ۖ إِنَّهُ هُوَ الْحَكِيمُ الْعَلِيمُ",
      "verseStringB": "They said: Thus says thy Lord. Surely He is the Wise, the Knowing."
    },
    {
      "verseNumber": 31,
      "verseString": "قَالَ فَمَا خَطْبُكُمْ أَيُّهَا الْمُرْسَلُونَ",
      "verseStringB": "He said: what is your errand, O messengers!"
    },
    {
      "verseNumber": 32,
      "verseString": "قَالُوا إِنَّا أُرْسِلْنَا إِلَىٰ قَوْمٍ مُجْرِمِينَ",
      "verseStringB": "They said: We have been sent to a guilty people"
    },
    {
      "verseNumber": 33,
      "verseString": "لِنُرْسِلَ عَلَيْهِمْ حِجَارَةً مِنْ طِينٍ",
      "verseStringB": "That we may send upon them stones of clay,"
    },
    {
      "verseNumber": 34,
      "verseString": "مُسَوَّمَةً عِنْدَ رَبِّكَ لِلْمُسْرِفِينَ",
      "verseStringB": "Marked from thy Lord for the prodigal.ᵃ"
    },
    {
      "verseNumber": 35,
      "verseString": "فَأَخْرَجْنَا مَنْ كَانَ فِيهَا مِنَ الْمُؤْمِنِينَ",
      "verseStringB": "Then We brought forth such believers as were there."
    },
    {
      "verseNumber": 36,
      "verseString": "فَمَا وَجَدْنَا فِيهَا غَيْرَ بَيْتٍ مِنَ الْمُسْلِمِينَ",
      "verseStringB": "And We found there but a (single) house of Muslims.ᵃ"
    },
    {
      "verseNumber": 37,
      "verseString": "وَتَرَكْنَا فِيهَا آيَةً لِلَّذِينَ يَخَافُونَ الْعَذَابَ الْأَلِيمَ",
      "verseStringB": "And We left therein a sign for those who fear the painful chastisement."
    },
    {
      "verseNumber": 38,
      "verseString": "وَفِي مُوسَىٰ إِذْ أَرْسَلْنَاهُ إِلَىٰ فِرْعَوْنَ بِسُلْطَانٍ مُبِينٍ",
      "verseStringB": "And in Moses, when We sent him to Pharaoh with clear authority."
    },
    {
      "verseNumber": 39,
      "verseString": "فَتَوَلَّىٰ بِرُكْنِهِ وَقَالَ سَاحِرٌ أَوْ مَجْنُونٌ",
      "verseStringB": "But he turned away on account of his might and said: An enchanter or a madman!"
    },
    {
      "verseNumber": 40,
      "verseString": "فَأَخَذْنَاهُ وَجُنُودَهُ فَنَبَذْنَاهُمْ فِي الْيَمِّ وَهُوَ مُلِيمٌ",
      "verseStringB": "So We seized him and his hosts and hurled them into the sea, and he was blameable."
    },
    {
      "verseNumber": 41,
      "verseString": "وَفِي عَادٍ إِذْ أَرْسَلْنَا عَلَيْهِمُ الرِّيحَ الْعَقِيمَ",
      "verseStringB": "And in ‘ād, when We sent upon them the destructive wind."
    },
    {
      "verseNumber": 42,
      "verseString": "مَا تَذَرُ مِنْ شَيْءٍ أَتَتْ عَلَيْهِ إِلَّا جَعَلَتْهُ كَالرَّمِيمِ",
      "verseStringB": "It spared naught that it came against, but it made it like ashes."
    },
    {
      "verseNumber": 43,
      "verseString": "وَفِي ثَمُودَ إِذْ قِيلَ لَهُمْ تَمَتَّعُوا حَتَّىٰ حِينٍ",
      "verseStringB": "And in Tham∂d, when it was said to them: Enjoy yourselves for a while."
    },
    {
      "verseNumber": 44,
      "verseString": "فَعَتَوْا عَنْ أَمْرِ رَبِّهِمْ فَأَخَذَتْهُمُ الصَّاعِقَةُ وَهُمْ يَنْظُرُونَ",
      "verseStringB": "But they revolted against the commandment of their Lord, so the punishment overtook them, while they saw.ᵃ"
    },
    {
      "verseNumber": 45,
      "verseString": "فَمَا اسْتَطَاعُوا مِنْ قِيَامٍ وَمَا كَانُوا مُنْتَصِرِينَ",
      "verseStringB": "So they were unable to rise up, nor could they defend themselves;"
    },
    {
      "verseNumber": 46,
      "verseString": "وَقَوْمَ نُوحٍ مِنْ قَبْلُ ۖ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ",
      "verseStringB": "And the people of Noah before. Surely they were a transgressing people."
    },
    {
      "verseNumber": 47,
      "verseString": "وَالسَّمَاءَ بَنَيْنَاهَا بِأَيْدٍ وَإِنَّا لَمُوسِعُونَ",
      "verseStringB": "And the heaven, We raised it high with power, and We are Makers of the vast extent."
    },
    {
      "verseNumber": 48,
      "verseString": "وَالْأَرْضَ فَرَشْنَاهَا فَنِعْمَ الْمَاهِدُونَ",
      "verseStringB": "And the earth, We have spread it out. How well We prepared it!"
    },
    {
      "verseNumber": 49,
      "verseString": "وَمِنْ كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ لَعَلَّكُمْ تَذَكَّرُونَ",
      "verseStringB": "And of everything We have created pairs that you may be mindful."
    },
    {
      "verseNumber": 50,
      "verseString": "فَفِرُّوا إِلَى اللَّهِ ۖ إِنِّي لَكُمْ مِنْهُ نَذِيرٌ مُبِينٌ",
      "verseStringB": "So flee to Allāh. Surely I am a plain warner to you from Him."
    },
    {
      "verseNumber": 51,
      "verseString": "وَلَا تَجْعَلُوا مَعَ اللَّهِ إِلَٰهًا آخَرَ ۖ إِنِّي لَكُمْ مِنْهُ نَذِيرٌ مُبِينٌ",
      "verseStringB": "And do not set up with Allāh another god. Surely I am a plain warner to you from Him."
    },
    {
      "verseNumber": 52,
      "verseString": "كَذَٰلِكَ مَا أَتَى الَّذِينَ مِنْ قَبْلِهِمْ مِنْ رَسُولٍ إِلَّا قَالُوا سَاحِرٌ أَوْ مَجْنُونٌ",
      "verseStringB": "Thus there came not a messenger to those before them but they said: An enchanter or a madman!"
    },
    {
      "verseNumber": 53,
      "verseString": "أَتَوَاصَوْا بِهِ ۚ بَلْ هُمْ قَوْمٌ طَاغُونَ",
      "verseStringB": "Have they charged each other with this? Nay, they are an inordInᵃ te people."
    },
    {
      "verseNumber": 54,
      "verseString": "فَتَوَلَّ عَنْهُمْ فَمَا أَنْتَ بِمَلُومٍ",
      "verseStringB": "So turn away from them, for thou art not to blame;ᵃ"
    },
    {
      "verseNumber": 55,
      "verseString": "وَذَكِّرْ فَإِنَّ الذِّكْرَىٰ تَنْفَعُ الْمُؤْمِنِينَ",
      "verseStringB": "And remind, for reminding profits the believers."
    },
    {
      "verseNumber": 56,
      "verseString": "وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ",
      "verseStringB": "And I have not created the jinn and the men except that they should serve Me."
    },
    {
      "verseNumber": 57,
      "verseString": "مَا أُرِيدُ مِنْهُمْ مِنْ رِزْقٍ وَمَا أُرِيدُ أَنْ يُطْعِمُونِ",
      "verseStringB": "I desire no sustenance from them, nor do I desire that they should feed Me."
    },
    {
      "verseNumber": 58,
      "verseString": "إِنَّ اللَّهَ هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ",
      "verseStringB": "Surely Allāh is the Bestower of sustenance, the Lord of Power, the Strong."
    },
    {
      "verseNumber": 59,
      "verseString": "فَإِنَّ لِلَّذِينَ ظَلَمُوا ذَنُوبًا مِثْلَ ذَنُوبِ أَصْحَابِهِمْ فَلَا يَسْتَعْجِلُونِ",
      "verseStringB": "Surely the lot of the wrongdoers is as was the lot of their companions, so let them not ask Me to hasten on."
    },
    {
      "verseNumber": 60,
      "verseString": "فَوَيْلٌ لِلَّذِينَ كَفَرُوا مِنْ يَوْمِهِمُ الَّذِي يُوعَدُونَ",
      "verseStringB": "Woe, then, to those who disbelieve because of that day of theirs which they are promised!"
    }
  ],
  "nameEnglish": "The Spreaders",
  "nameTrans": "adh-Dhariyat",
  "nameArabic": "الذاريات",
  "chapterNumber": 51,
  "nVerses": 60,
  "footnotes": [
    {
      "note": "6a. In the first four verses of this chapter attention is called to certain facts by meansof what is generally understood to be an oath, for which see 37:1a, while the two versesthat follow indicate the conclusion to which those facts lead. It is generally consideredthat by “those scattering broadcast” are meant the winds that raise up dust before thecoming of a cloud; by the “bearers of the load” the clouds that carry rain; by the “easyrunners” the winds that carry the clouds along, and by the “distributors” the winds thatdistribute the rain. Attention is drawn in this description to a similar arrangement in thespiritual world by which Truth gradually advances. The seed of Truth is scattered broadcast in the first stage, while the bearing of the load or becoming pregnant with Truth isthe second stage, the third being the strong desire to accept it, which makes one run forit without difficulty, while the fourth is its distribution to others.But we may as well say that attention is herein drawn to more manifest facts, to thescattering of Truth broadcast through the Holy Prophet and his faithful followers, whichled to some bearing the load of it as if they had become pregnant with Truth, while others ran easily towards the acceptance of Truth. But they were not satisfied with mereacceptance; they went to and fro to deliver to others the Truth and the Light, which theyhad received. In the existence of these groups of workers in the cause of Truth there wasa clear sign that the triumph of Islåm would soon be established in the land.\n\n7a. The description of heaven as full of paths is a scientific truth certainly unknown tothe world 1,300 years ago. The paths in the heavens are the orbits of the various planets,and of the stars themselves; compared 36:40, where it is stated that “all float on in an orbit”.\n\n9a. Only those are turned away from the Truth who themselves turn away.\n\n14a. For fitnah meaning persecution, see 2:191c. Tasting of persecution signifiesreceiving punishment for their persecution of the Muslims.\n\n19a. The word ma√r∂m is understood by some to mean a poor man who does not beg,and by others, one who has not the faculty of speech, like the dog and the cat (LL). Notethat the poor are here spoken of as having a share in the wealth of the rich. The State isbound to take that share and make it over to the poor. But it is only a share, not the whole.\n\n21a. They could see signs showing that Truth was gaining ground.\n\n22a. That which is promised may mean the spiritual sustenance as contrasted withrizq or the physical sustenance. Or, it may refer to the Judgment, of which they werewarned again and again.\n\n23a. Note the high degree of certainty, the unshakable faith in the ultimate triumphof the Truth at this early period. Just as men’s speaking to each other is a reality, even sois God’s speaking to man.\n\n24a. See 11:69a, 70a.\n\n34a. For the punishment sent on Lot’s people, see 7:84a. The stones were marked,i.e., they were destined for them.\n\n36a. It is said to be the house of Lot himself. A Muslim is one who submits himselfto God, and in this sense all prophets and their righteous followers were Muslims.\n\n44a. See 7:78a; it was an earthquake.\n\n54a. Turning away from them means to pay no heed to their abuses and to disregardtheir reviling. The words that follow make this clear, for the Prophet is enjoined to continue to remind, for there will be some who will believe, and these will profit by thereminder."
    }
  ]
}
