{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "وَالنَّجْمِ إِذَا هَوَىٰ",
      "verseStringB": "By the star when it sets!ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "مَا ضَلَّ صَاحِبُكُمْ وَمَا غَوَىٰ",
      "verseStringB": "Your companion errs not, nor does he deviate.ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "وَمَا يَنْطِقُ عَنِ الْهَوَىٰ",
      "verseStringB": "Nor does he speak out of desire."
    },
    {
      "verseNumber": 4,
      "verseString": "إِنْ هُوَ إِلَّا وَحْيٌ يُوحَىٰ",
      "verseStringB": "It is naught but revelation that is revealeda —"
    },
    {
      "verseNumber": 5,
      "verseString": "عَلَّمَهُ شَدِيدُ الْقُوَىٰ",
      "verseStringB": "One Mighty in Power has taught him,ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "ذُو مِرَّةٍ فَاسْتَوَىٰ",
      "verseStringB": "The Lord of Strength. So he attained to perfection,ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "وَهُوَ بِالْأُفُقِ الْأَعْلَىٰ",
      "verseStringB": "And he is in the highest part of the horizon.ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "ثُمَّ دَنَا فَتَدَلَّىٰ",
      "verseStringB": "Then he drew near, drew nearer yet,ᵃ"
    },
    {
      "verseNumber": 9,
      "verseString": "فَكَانَ قَابَ قَوْسَيْنِ أَوْ أَدْنَىٰ",
      "verseStringB": "So he was the measure of two bows or closer still.ᵃ"
    },
    {
      "verseNumber": 10,
      "verseString": "فَأَوْحَىٰ إِلَىٰ عَبْدِهِ مَا أَوْحَىٰ",
      "verseStringB": "So He revealed to His servant what He revealed.ᵃ"
    },
    {
      "verseNumber": 11,
      "verseString": "مَا كَذَبَ الْفُؤَادُ مَا رَأَىٰ",
      "verseStringB": "The heart was not untrue in seeing what he saw."
    },
    {
      "verseNumber": 12,
      "verseString": "أَفَتُمَارُونَهُ عَلَىٰ مَا يَرَىٰ",
      "verseStringB": "Do you then dispute with him as to what he saw?ᵃ"
    },
    {
      "verseNumber": 13,
      "verseString": "وَلَقَدْ رَآهُ نَزْلَةً أُخْرَىٰ",
      "verseStringB": "And certainly he saw Him in another descent,"
    },
    {
      "verseNumber": 14,
      "verseString": "عِنْدَ سِدْرَةِ الْمُنْتَهَىٰ",
      "verseStringB": "At the farthest lote-tree.ᵃ"
    },
    {
      "verseNumber": 15,
      "verseString": "عِنْدَهَا جَنَّةُ الْمَأْوَىٰ",
      "verseStringB": "Near it is the Garden of Abode."
    },
    {
      "verseNumber": 16,
      "verseString": "إِذْ يَغْشَى السِّدْرَةَ مَا يَغْشَىٰ",
      "verseStringB": "When that which covers covered the lote-tree;"
    },
    {
      "verseNumber": 17,
      "verseString": "مَا زَاغَ الْبَصَرُ وَمَا طَغَىٰ",
      "verseStringB": "The eye turned not aside, nor did it exceed the limit."
    },
    {
      "verseNumber": 18,
      "verseString": "لَقَدْ رَأَىٰ مِنْ آيَاتِ رَبِّهِ الْكُبْرَىٰ",
      "verseStringB": "Certainly he saw of the greatest signs of his Lord."
    },
    {
      "verseNumber": 19,
      "verseString": "أَفَرَأَيْتُمُ اللَّاتَ وَالْعُزَّىٰ",
      "verseStringB": "Have you then considered Lāt and ‘Uzzā,"
    },
    {
      "verseNumber": 20,
      "verseString": "وَمَنَاةَ الثَّالِثَةَ الْأُخْرَىٰ",
      "verseStringB": "And another, the third, Manāt?"
    },
    {
      "verseNumber": 21,
      "verseString": "أَلَكُمُ الذَّكَرُ وَلَهُ الْأُنْثَىٰ",
      "verseStringB": "Are the males for you and for Him the females?ᵃ"
    },
    {
      "verseNumber": 22,
      "verseString": "تِلْكَ إِذًا قِسْمَةٌ ضِيزَىٰ",
      "verseStringB": "This indeed is an unjust division!"
    },
    {
      "verseNumber": 23,
      "verseString": "إِنْ هِيَ إِلَّا أَسْمَاءٌ سَمَّيْتُمُوهَا أَنْتُمْ وَآبَاؤُكُمْ مَا أَنْزَلَ اللَّهُ بِهَا مِنْ سُلْطَانٍ ۚ إِنْ يَتَّبِعُونَ إِلَّا الظَّنَّ وَمَا تَهْوَى الْأَنْفُسُ ۖ وَلَقَدْ جَاءَهُمْ مِنْ رَبِّهِمُ الْهُدَىٰ",
      "verseStringB": "They are naught but names which you have named, you and your fathers — Allāh has sent no authority for them. They follow but conjecture and what (their) souls desire. And certainly the guidance has come to them from their Lord."
    },
    {
      "verseNumber": 24,
      "verseString": "أَمْ لِلْإِنْسَانِ مَا تَمَنَّىٰ",
      "verseStringB": "Or shall man have what he wishes?"
    },
    {
      "verseNumber": 25,
      "verseString": "فَلِلَّهِ الْآخِرَةُ وَالْأُولَىٰ",
      "verseStringB": "But for Allāh is the Hereafter and the former (life)."
    },
    {
      "verseNumber": 26,
      "verseString": "وَكَمْ مِنْ مَلَكٍ فِي السَّمَاوَاتِ لَا تُغْنِي شَفَاعَتُهُمْ شَيْئًا إِلَّا مِنْ بَعْدِ أَنْ يَأْذَنَ اللَّهُ لِمَنْ يَشَاءُ وَيَرْضَىٰ",
      "verseStringB": "And how many angels are in the heavens, whose intercession avails naught except after Allāh gives permission to whom He pleases and chooses."
    },
    {
      "verseNumber": 27,
      "verseString": "إِنَّ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ لَيُسَمُّونَ الْمَلَائِكَةَ تَسْمِيَةَ الْأُنْثَىٰ",
      "verseStringB": "Surely those who believe not in the Hereafter name the angels with female names.ᵃ"
    },
    {
      "verseNumber": 28,
      "verseString": "وَمَا لَهُمْ بِهِ مِنْ عِلْمٍ ۖ إِنْ يَتَّبِعُونَ إِلَّا الظَّنَّ ۖ وَإِنَّ الظَّنَّ لَا يُغْنِي مِنَ الْحَقِّ شَيْئًا",
      "verseStringB": "And they have no knowledge of it. They follow but conjecture, and surely conjecture avails naught against Truth."
    },
    {
      "verseNumber": 29,
      "verseString": "فَأَعْرِضْ عَنْ مَنْ تَوَلَّىٰ عَنْ ذِكْرِنَا وَلَمْ يُرِدْ إِلَّا الْحَيَاةَ الدُّنْيَا",
      "verseStringB": "So shun him who turns his back upon Our Reminder, and desires nothing but this world’s life."
    },
    {
      "verseNumber": 30,
      "verseString": "ذَٰلِكَ مَبْلَغُهُمْ مِنَ الْعِلْمِ ۚ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ وَهُوَ أَعْلَمُ بِمَنِ اهْتَدَىٰ",
      "verseStringB": "That is their goal of knowledge. Surely thy Lord knows best him who strays from His path and He knows best him who goes aright."
    },
    {
      "verseNumber": 31,
      "verseString": "وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ لِيَجْزِيَ الَّذِينَ أَسَاءُوا بِمَا عَمِلُوا وَيَجْزِيَ الَّذِينَ أَحْسَنُوا بِالْحُسْنَى",
      "verseStringB": "And Allāh’s is whatever is in the heavens and whatever is in the earth, that He may reward those who do evil for that which they do, and reward those who do good with goodness."
    },
    {
      "verseNumber": 32,
      "verseString": "الَّذِينَ يَجْتَنِبُونَ كَبَائِرَ الْإِثْمِ وَالْفَوَاحِشَ إِلَّا اللَّمَمَ ۚ إِنَّ رَبَّكَ وَاسِعُ الْمَغْفِرَةِ ۚ هُوَ أَعْلَمُ بِكُمْ إِذْ أَنْشَأَكُمْ مِنَ الْأَرْضِ وَإِذْ أَنْتُمْ أَجِنَّةٌ فِي بُطُونِ أُمَّهَاتِكُمْ ۖ فَلَا تُزَكُّوا أَنْفُسَكُمْ ۖ هُوَ أَعْلَمُ بِمَنِ اتَّقَىٰ",
      "verseStringB": "Those who avoid the great sins and the indecencies, but the passing ideaa— surely thy Lord is Liberal in Forgiving. He knows you best when He brings you forth from the earth and when you are embryos in the wombs of your mothers; so ascribe not purity to yourselves. He knows him best who guards against evil."
    },
    {
      "verseNumber": 33,
      "verseString": "أَفَرَأَيْتَ الَّذِي تَوَلَّىٰ",
      "verseStringB": "Seest thou him who turns back,"
    },
    {
      "verseNumber": 34,
      "verseString": "وَأَعْطَىٰ قَلِيلًا وَأَكْدَىٰ",
      "verseStringB": "And gives a little, then withholds?"
    },
    {
      "verseNumber": 35,
      "verseString": "أَعِنْدَهُ عِلْمُ الْغَيْبِ فَهُوَ يَرَىٰ",
      "verseStringB": "Has he the knowledge of the unseen so that he can see?"
    },
    {
      "verseNumber": 36,
      "verseString": "أَمْ لَمْ يُنَبَّأْ بِمَا فِي صُحُفِ مُوسَىٰ",
      "verseStringB": "Or has he not been informed of what is in the scriptures of Moses,"
    },
    {
      "verseNumber": 37,
      "verseString": "وَإِبْرَاهِيمَ الَّذِي وَفَّىٰ",
      "verseStringB": "And (of) Abraham who fulfilled (commandments)?"
    },
    {
      "verseNumber": 38,
      "verseString": "أَلَّا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ",
      "verseStringB": "That no bearer of burden bears another’s burden:"
    },
    {
      "verseNumber": 39,
      "verseString": "وَأَنْ لَيْسَ لِلْإِنْسَانِ إِلَّا مَا سَعَىٰ",
      "verseStringB": "And that man can have nothing but what he strives for:"
    },
    {
      "verseNumber": 40,
      "verseString": "وَأَنَّ سَعْيَهُ سَوْفَ يُرَىٰ",
      "verseStringB": "And that his striving will soon be seen."
    },
    {
      "verseNumber": 41,
      "verseString": "ثُمَّ يُجْزَاهُ الْجَزَاءَ الْأَوْفَىٰ",
      "verseStringB": "Then he will be rewarded for it with the fullest reward:"
    },
    {
      "verseNumber": 42,
      "verseString": "وَأَنَّ إِلَىٰ رَبِّكَ الْمُنْتَهَىٰ",
      "verseStringB": "And that to thy Lord is the goal:"
    },
    {
      "verseNumber": 43,
      "verseString": "وَأَنَّهُ هُوَ أَضْحَكَ وَأَبْكَىٰ",
      "verseStringB": "And that He it is Who makes (men) laugh and makes (them) weep:"
    },
    {
      "verseNumber": 44,
      "verseString": "وَأَنَّهُ هُوَ أَمَاتَ وَأَحْيَا",
      "verseStringB": "And that He it is Who causes death and gives life:"
    },
    {
      "verseNumber": 45,
      "verseString": "وَأَنَّهُ خَلَقَ الزَّوْجَيْنِ الذَّكَرَ وَالْأُنْثَىٰ",
      "verseStringB": "And that He creates pairs, the male and the female:"
    },
    {
      "verseNumber": 46,
      "verseString": "مِنْ نُطْفَةٍ إِذَا تُمْنَىٰ",
      "verseStringB": "From the small life-germ when it is adapted:ᵃ"
    },
    {
      "verseNumber": 47,
      "verseString": "وَأَنَّ عَلَيْهِ النَّشْأَةَ الْأُخْرَىٰ",
      "verseStringB": "And that He has ordained the second bringing forth:"
    },
    {
      "verseNumber": 48,
      "verseString": "وَأَنَّهُ هُوَ أَغْنَىٰ وَأَقْنَىٰ",
      "verseStringB": "And that He it is Who gives wealth and contentment:"
    },
    {
      "verseNumber": 49,
      "verseString": "وَأَنَّهُ هُوَ رَبُّ الشِّعْرَىٰ",
      "verseStringB": "And that He is the Lord of Sirius:"
    },
    {
      "verseNumber": 50,
      "verseString": "وَأَنَّهُ أَهْلَكَ عَادًا الْأُولَىٰ",
      "verseStringB": "And that He destroyed the first ‘ād:ᵃ"
    },
    {
      "verseNumber": 51,
      "verseString": "وَثَمُودَ فَمَا أَبْقَىٰ",
      "verseStringB": "And Tham∂d, so He spared not:"
    },
    {
      "verseNumber": 52,
      "verseString": "وَقَوْمَ نُوحٍ مِنْ قَبْلُ ۖ إِنَّهُمْ كَانُوا هُمْ أَظْلَمَ وَأَطْغَىٰ",
      "verseStringB": "And the people of Noah before. Surely they were most iniquitous and inordInᵃ te."
    },
    {
      "verseNumber": 53,
      "verseString": "وَالْمُؤْتَفِكَةَ أَهْوَىٰ",
      "verseStringB": "And the overthrown cities, He hurled down:"
    },
    {
      "verseNumber": 54,
      "verseString": "فَغَشَّاهَا مَا غَشَّىٰ",
      "verseStringB": "So there covered them that which covered."
    },
    {
      "verseNumber": 55,
      "verseString": "فَبِأَيِّ آلَاءِ رَبِّكَ تَتَمَارَىٰ",
      "verseStringB": "Which, then, of thy Lord’s benefits wilt thou dispute?"
    },
    {
      "verseNumber": 56,
      "verseString": "هَٰذَا نَذِيرٌ مِنَ النُّذُرِ الْأُولَىٰ",
      "verseStringB": "This is a warner of the warners of old."
    },
    {
      "verseNumber": 57,
      "verseString": "أَزِفَتِ الْآزِفَةُ",
      "verseStringB": "The near Event draws nigh.ᵃ"
    },
    {
      "verseNumber": 58,
      "verseString": "لَيْسَ لَهَا مِنْ دُونِ اللَّهِ كَاشِفَةٌ",
      "verseStringB": "There is none besides Allāh to remove it."
    },
    {
      "verseNumber": 59,
      "verseString": "أَفَمِنْ هَٰذَا الْحَدِيثِ تَعْجَبُونَ",
      "verseStringB": "Wonder you then at this announce ment?"
    },
    {
      "verseNumber": 60,
      "verseString": "وَتَضْحَكُونَ وَلَا تَبْكُونَ",
      "verseStringB": "And do you laugh and not weep,"
    },
    {
      "verseNumber": 61,
      "verseString": "وَأَنْتُمْ سَامِدُونَ",
      "verseStringB": "While you sport?"
    },
    {
      "verseNumber": 62,
      "verseString": "فَاسْجُدُوا لِلَّهِ وَاعْبُدُوا ۩",
      "verseStringB": "So bow down in prostration before Allāh and serve (Him).ᵃ"
    }
  ],
  "nameEnglish": "The Star",
  "nameTrans": "an-Najm",
  "nameArabic": "الـنجـم",
  "chapterNumber": 53,
  "nVerses": 62,
  "footnotes": [
    {
      "note": "1a. The words may be interpreted variously, according to the meaning of najm andhawå that is adopted. The best-known significance of najm is star, and when used as aproper noun it signifies the Pleiades, and hawå may signify, going down low (R). TheArabs believed that when al-Najm (the Pleiades) rose in the morning, disasters and calamities came to an end. Thus we have under the word najm: “The Arabs believed that betweenits rising in the morning and its disappearance there are diseases and plagues and calamities for men and camels and fruits” (R). In the setting of the star the opponents are warnedof the calamities which would soon overtake them; their star of fortune was about to set.There is, however, a less-known significance of the word najm. It sometimes meansa portion of the Qur’ån (Bd, Rz, Kf). Kf says: “Or najm indicates one of the portions ofthe Qur’ån, and it was revealed in portions, during twenty years. Hawå means when itdescends or is revealed”. R gives the following interpretation: “And it is said that bythis (i.e., najm) is meant the Qur’ån as revealed in portions, one part after another. Andby His saying hawå is meant its revelation; and the same interpretation must be adoptedin His saying bi-mawåqi‘l-nuj∂m” (56:75). The meaning is that every portion of theQur’ån when it is revealed is an evidence that the Prophet errs not — he is in the right.Thus there is a reference here to the internal evidence which is offered in every portionof the Qur’ån that it is the Truth.\n\n2a. By your companion is meant the Prophet, who had led among this very people alife of unblemished purity. There are two statements made here; erring on his part isnegatived in the first to show that he had a true knowledge or he did not err in theory,and deviation from the right course is negatived in the second to show that he actedaccording to that knowledge, or his practice accorded with the theory. This verse is aconclusive proof that according to the Holy Qur’ån the Prophet was perfectly sinless.\n\n4a. The personal pronoun huwa (it) occurring here refers to the najm or portion ofthe Qur’ån spoken of in the first verse. The Qur’ån was not his word, for he spoke not ofhis own desire; it was the word of God.\n\n5a. It is not correct to take the One Mighty in Power as meaning Gabriel. The OneWho taught him was God Himself as plainly stated elsewhere: “The Beneficent (has)taught the Qur’ån” (55:1, 2).\n\n6a. Istawå means he became full-grown and mature in body and intellect, or heattained the completion of his make and intellect (LL). There is no mention of Gabriel; thepersonal pronoun, therefore, does not refer to him. It is the Holy Prophet that is spoken ofhere as having attained to perfection because the Almighty Himself was his Teacher.\n\n7a. The Prophet’s being in the highest part of the horizon is in reference to theresplendence of his light, which was to illuminate all corners of the world — a prophecy, in fact, that he will shine out in the full brilliance of his light as the midday sun.8a. Tadallå signifies he was lowly or humble (LL), but it also means al-dunuww orbeing near (R). According to LA, the meaning is zåda fi-l-qurb, he increased in nearness. The verse points out that the Prophet attained the utmost nearness unto God whichit is possible for man to attain.\n\n9a. The qåb of a qaus is the portion of a bow that is between the part that is graspedby the hand and the curved extremity (LL). According to Qatådah, its meaning is fromone extremity of the bow to the other extremity (AH). According to Ïasan and Mujåhid,the qåb is from the chord to the middle of the bow near the place grasped by the hand(AH). N and LA favour measure (qadr) as the meaning of qåb, and the latter quotes theArab proverb baina-humå qåba qausain, i.e., between them two is the measure of a bow,which is a proverb to indicate close relationship between two persons. There is anotherproverb, ramau-nå ‘an qaus-in wå√id-in, meaning they shot at us from one bow, denoting agreement (LL). Whatever significance of the word qåb may be adopted, the mention of a single qåb for two bows indicates close union. The two bows seem to indicatethe Holy Prophet’s twofold perfection, i.e., his nearness to the Divine Being and hishumility in his relations with men. The commentators generally understand the phrase asonly indicating the distance of two bows.\n\n10a. The må (what) in må au√å (i.e., what He revealed) is according to all commentators for the purpose of tafkhßm, i.e., to indicate that a mighty revelation was given to him.\n\n12a. That is, what he saw was a certain truth and not an imaginary picture.\n\n14a. The sidrah, or the lote-tree, is, in Arabia, the tree in the shade of which peoplealight and rest (LL), or in the shade of which people gather together (Bd). The wordoccurs elsewhere in the Qur’ån as indicating a tree in paradise (56:28), and R thusexplains the word: “And the shade of it is sought, and thus it is made to serve as a parable for the shade of paradise and its blessings in the words f ß sidr-in makh˙∂d-in onaccount of the ampleness of its shadow”. As for its meaning in this verse, the sameauthority takes it either as meaning a place in which the Holy Prophet (may peace andthe blessings of Allåh be upon him!) was chosen for Divine favours and great blessings,or as signifying the tree under which the companions of the Holy Prophet took thepledge at Ïudaibiyah to defend him with their lives, the mention in the latter case beingprophetical. The qualification of sidrah by the word al-muntahå shows that it is a placebeyond which human knowledge does not go, one of the explanations given by Kfbeing, “the knowledge of angels and others ends there, and no one knows what isbeyond it”. Hence the significance conveyed by the words is that the Prophet’s knowledge of things Divine was the utmost which could be vouchsafed to man. According tosome it conveys the same significance as ‘illiyy∂n in 83:18 (LL), for which see 83:18a.\n\n21a. Verses 19 –21 are made the basis of the false story of what is called the “Lapseof Mu√ammad” or “Compromise with idolatry” by Christian writers. Certain reportsnarrated by Wåqidß and Ôabarß are the sole authority for this charge against that incessant preacher against idolatry, every incident of whose life condemns it as a bare falsehood. Muir asserts that “Pious Muhammadans of after-days, scandalized at the lapse oftheir Prophet into so flagrant a concession, would reject the whole story,” as if the earlier Muslims were not as pious as the latter. The fact is that the story was quite unknownto the earlier Muslims. There is not a single trustworthy √adßth that lendssupport to this story. Mu√ammad ibn Is√åq, who died as early as 151 A.H., does notmention the incident, while Muir’s earliest authority, Wåqidß, was born more than fortyyears later. It is stated in the Ba√rain that when questioned about it, Ibn Is√åq called it afabrication of the zindeeqs. And the famous Bukhårß, the most trustworthy authority onthe sayings of the Holy Prophet, was Wåqidß’s contemporary, and his collection ofsayings contains no mention of the story. As regards Wåqidß, all competent authoritiesentertain a very low opinion of his trustworthiness. The Mßzån al-I‘tidål, a critical workon the lives and characters of the reporters of Ïadßth, speaks of Wåqidß as unreliable andeven as a fabricator of reports. As regards Ôabarß, Muir himself represents him as guiltyof “indiscriminate reception”. As against these two unreliable authorities, “those whoreject this story are highly learned men” (R∂√ al-Ma‘ånß). The six collections of reportsknown as the ˝i√å√ Sittah (or the Six Reliable Works) do not mention it at all, and contain instead a report which essentially contradicts the story of the so-called compromise.Internal evidence, too, is wholly against the story. We are told that instead of v. 21 theProphet read the words: Tilk al-gharånßq al-‘ulå wa inna shafå‘ata-hunna la-turtajå,i.e., “These are exalted females whose intercession is to be sought”. But the insertion ofthese few words in a chapter which is wholly directed against idolatry is quite out ofplace: v. 23 condemns idols; v. 26 denies their intercession; v. 28 condemns the givingof names of female deities to angels, and so on. It is further asserted that 22:52 wasrevealed in connection with this change, but it should be noted that a period of at leasteight years must have elapsed between the revelation of this verse and that of 22:52.Moreover, if the Prophet had made any such compromise, it could not have been a sudden event, and traces of it would have been met with in other chapters revealed about thesame time. But a perusal of these shows clearly that the Qur’ån’s condemnation of idolatry was never marked by the slightest change. See further 62a.\n\n27a. The Arabs called the angels daughters of Allåh.\n\n32a. Lamam is from almamtu bi-kadhå, meaning I alighted at it and approached itwithout falling into it (R). Hence I render the word as a passing idea which leaves noimpression on the mind. Such an idea is forgiven, for a mortal cannot be proof against it.But this by no means amounts to an intention or an attempt to commit a sin.\n\n46a. Tumnå means, according to R, tuqaddaru, i.e., adapted to circumstances. Andaccording to LL, manå is also synonymous with qadr.\n\n50a. The tribe of ‘Åd is sometimes referred to as the first ‘Åd, in contrast withTham∂d, who are called the second ‘Åd.\n\n57a. The near Event is the doom of the Quraish, the overthrow of their power,which was now being utilized against Islåm.\n\n62a. Here is a command to prostrate oneself, which is literally obeyed by all Muslimswhen reciting the Qur’ån or hearing it recited; see 7:206a. This chapter, when firstrevealed, was read in a large assembly, containing Muslims as well as disbelievers. Whenthe Holy Prophet prostrated himself in obedience to the command, not only did theMuslims prostrate themselves, but even the idolaters were so overawed that they also prostrated themselves, with the exception only of Umayyah ibn Khalf, who raised some gravelto his forehead. This man was afterwards killed, dying a disbeliever, says the report, evidently implying that all the others were gradually converted to Islåm (B. 17:1). It shouldbe further borne in mind that the idolaters did not deny the existence of God the Supreme,Whom they believed to be above their idols, who were recognized only as minor deities,and therefore there is nothing strange in their joining the Muslims in their prostration.It is this simple incident which is connected with the story of the so-called “lapse” andis adduced as proof of its truth. But it will be seen that the prostration was made in obedience to the direct Divine command of prostration and had nothing to do with the worship ofidols. The incidents narrated before it, relating to the grandeur and majesty of Allåh and tothe destruction of the wicked, are so impressive that the idolaters could not resist prostratingthemselves. It is possible that the story of the prostration reached the Abyssinian exiles,some of whom might have returned under the impression that the disbelievers no longeropposed the movement."
    }
  ]
}
