{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "اقْتَرَبَتِ السَّاعَةُ وَانْشَقَّ الْقَمَرُ",
      "verseStringB": "The hour drew nigh and the moon was rent asunder.ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "وَإِنْ يَرَوْا آيَةً يُعْرِضُوا وَيَقُولُوا سِحْرٌ مُسْتَمِرٌّ",
      "verseStringB": "And if they see a sign, they turn away and say: Strong enchantment!ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "وَكَذَّبُوا وَاتَّبَعُوا أَهْوَاءَهُمْ ۚ وَكُلُّ أَمْرٍ مُسْتَقِرٌّ",
      "verseStringB": "And they deny and follow their low desires; and every affair is settled.ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "وَلَقَدْ جَاءَهُمْ مِنَ الْأَنْبَاءِ مَا فِيهِ مُزْدَجَرٌ",
      "verseStringB": "And certainly narratives have come to them, which should deter a—"
    },
    {
      "verseNumber": 5,
      "verseString": "حِكْمَةٌ بَالِغَةٌ ۖ فَمَا تُغْنِ النُّذُرُ",
      "verseStringB": "Consummate wisdom — but warnings avail not;"
    },
    {
      "verseNumber": 6,
      "verseString": "فَتَوَلَّ عَنْهُمْ ۘ يَوْمَ يَدْعُ الدَّاعِ إِلَىٰ شَيْءٍ نُكُرٍ",
      "verseStringB": "So turn away from them. On the day when the Inviter invites them to a hard task —"
    },
    {
      "verseNumber": 7,
      "verseString": "خُشَّعًا أَبْصَارُهُمْ يَخْرُجُونَ مِنَ الْأَجْدَاثِ كَأَنَّهُمْ جَرَادٌ مُنْتَشِرٌ",
      "verseStringB": "Their eyes cast down, they will go forth from their graves as if they were scattered locusts,"
    },
    {
      "verseNumber": 8,
      "verseString": "مُهْطِعِينَ إِلَى الدَّاعِ ۖ يَقُولُ الْكَافِرُونَ هَٰذَا يَوْمٌ عَسِرٌ",
      "verseStringB": "Hastening to the Inviter. The disbelievers will say: This is a hard day!ᵃ"
    },
    {
      "verseNumber": 9,
      "verseString": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ فَكَذَّبُوا عَبْدَنَا وَقَالُوا مَجْنُونٌ وَازْدُجِرَ",
      "verseStringB": "Before them the people of Noah rejected — they rejected Our servant and called (him) mad, and he was driven away."
    },
    {
      "verseNumber": 10,
      "verseString": "فَدَعَا رَبَّهُ أَنِّي مَغْلُوبٌ فَانْتَصِرْ",
      "verseStringB": "So he called upon his Lord: I am overcome, so do Thou help."
    },
    {
      "verseNumber": 11,
      "verseString": "فَفَتَحْنَا أَبْوَابَ السَّمَاءِ بِمَاءٍ مُنْهَمِرٍ",
      "verseStringB": "Then We opened the gates of heaven with water pouring down,"
    },
    {
      "verseNumber": 12,
      "verseString": "وَفَجَّرْنَا الْأَرْضَ عُيُونًا فَالْتَقَى الْمَاءُ عَلَىٰ أَمْرٍ قَدْ قُدِرَ",
      "verseStringB": "And made water to flow forth in the land in springs, so the water gathered together according to a measure already ordained."
    },
    {
      "verseNumber": 13,
      "verseString": "وَحَمَلْنَاهُ عَلَىٰ ذَاتِ أَلْوَاحٍ وَدُسُرٍ",
      "verseStringB": "And We bore him on that which was made of planks and nails,"
    },
    {
      "verseNumber": 14,
      "verseString": "تَجْرِي بِأَعْيُنِنَا جَزَاءً لِمَنْ كَانَ كُفِرَ",
      "verseStringB": "Floating on, before Our eyes — a reward for him who was denied.ᵃ"
    },
    {
      "verseNumber": 15,
      "verseString": "وَلَقَدْ تَرَكْنَاهَا آيَةً فَهَلْ مِنْ مُدَّكِرٍ",
      "verseStringB": "And certainly We left it as a sign, but is there any that will mind?ᵃ"
    },
    {
      "verseNumber": 16,
      "verseString": "فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ",
      "verseStringB": "How (terrible) was then My chastisement and My warning!"
    },
    {
      "verseNumber": 17,
      "verseString": "وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ",
      "verseStringB": "And certainly We have made the Qur’ān easy to remember, but is there any one who will mind?"
    },
    {
      "verseNumber": 18,
      "verseString": "كَذَّبَتْ عَادٌ فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ",
      "verseStringB": "‘ād denied, so how terrible was My chastisement and My warning!"
    },
    {
      "verseNumber": 19,
      "verseString": "إِنَّا أَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا فِي يَوْمِ نَحْسٍ مُسْتَمِرٍّ",
      "verseStringB": "Surely We sent on them a furious wind in a day of bitter ill-luck,"
    },
    {
      "verseNumber": 20,
      "verseString": "تَنْزِعُ النَّاسَ كَأَنَّهُمْ أَعْجَازُ نَخْلٍ مُنْقَعِرٍ",
      "verseStringB": "Tearing men away as if they were the trunks of palm-trees torn up."
    },
    {
      "verseNumber": 21,
      "verseString": "فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ",
      "verseStringB": "How (terrible) was then My chastisement and My warning!"
    },
    {
      "verseNumber": 22,
      "verseString": "وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ",
      "verseStringB": "And certainly We have made the Qur’ān easy to remember, but is there any one who will mind?"
    },
    {
      "verseNumber": 23,
      "verseString": "كَذَّبَتْ ثَمُودُ بِالنُّذُرِ",
      "verseStringB": "Tham∂d rejected the warning."
    },
    {
      "verseNumber": 24,
      "verseString": "فَقَالُوا أَبَشَرًا مِنَّا وَاحِدًا نَتَّبِعُهُ إِنَّا إِذًا لَفِي ضَلَالٍ وَسُعُرٍ",
      "verseStringB": "So they said: What! A single mortal from among us! Shall we follow him? We shall then be in sure error and distress."
    },
    {
      "verseNumber": 25,
      "verseString": "أَأُلْقِيَ الذِّكْرُ عَلَيْهِ مِنْ بَيْنِنَا بَلْ هُوَ كَذَّابٌ أَشِرٌ",
      "verseStringB": "Has the reminder been sent to him from among us? Nay, he is an insolent liar!"
    },
    {
      "verseNumber": 26,
      "verseString": "سَيَعْلَمُونَ غَدًا مَنِ الْكَذَّابُ الْأَشِرُ",
      "verseStringB": "Tomorrow they will know who is the liar, the insolent one."
    },
    {
      "verseNumber": 27,
      "verseString": "إِنَّا مُرْسِلُو النَّاقَةِ فِتْنَةً لَهُمْ فَارْتَقِبْهُمْ وَاصْطَبِرْ",
      "verseStringB": "Surely We are going to send the she-camel as a trial for them; so watch them and have patience."
    },
    {
      "verseNumber": 28,
      "verseString": "وَنَبِّئْهُمْ أَنَّ الْمَاءَ قِسْمَةٌ بَيْنَهُمْ ۖ كُلُّ شِرْبٍ مُحْتَضَرٌ",
      "verseStringB": "And inform them that the water is shared between them; every share of the water shall be attended.ᵃ"
    },
    {
      "verseNumber": 29,
      "verseString": "فَنَادَوْا صَاحِبَهُمْ فَتَعَاطَىٰ فَعَقَرَ",
      "verseStringB": "But they called their companion, so he took (a sword) and hamstrung (her)."
    },
    {
      "verseNumber": 30,
      "verseString": "فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ",
      "verseStringB": "How (terrible) was then My chastise ment and My warning!"
    },
    {
      "verseNumber": 31,
      "verseString": "إِنَّا أَرْسَلْنَا عَلَيْهِمْ صَيْحَةً وَاحِدَةً فَكَانُوا كَهَشِيمِ الْمُحْتَظِرِ",
      "verseStringB": "Surely We sent upon them a single cry, so they were like the dry fragments of trees, which the maker of an enclosure collects.ᵃ"
    },
    {
      "verseNumber": 32,
      "verseString": "وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ",
      "verseStringB": "And certainly We have made the Qur’ān easy to remember, but is there any one who will mind?"
    },
    {
      "verseNumber": 33,
      "verseString": "كَذَّبَتْ قَوْمُ لُوطٍ بِالنُّذُرِ",
      "verseStringB": "The people of Lot treated the warning as a lie."
    },
    {
      "verseNumber": 34,
      "verseString": "إِنَّا أَرْسَلْنَا عَلَيْهِمْ حَاصِبًا إِلَّا آلَ لُوطٍ ۖ نَجَّيْنَاهُمْ بِسَحَرٍ",
      "verseStringB": "Surely We sent upon them a stone-storm,ᵃ except Lot’s followers; We saved them a little before daybreak —"
    },
    {
      "verseNumber": 35,
      "verseString": "نِعْمَةً مِنْ عِنْدِنَا ۚ كَذَٰلِكَ نَجْزِي مَنْ شَكَرَ",
      "verseStringB": "A favour from Us. Thus do We reward him who gives thanks."
    },
    {
      "verseNumber": 36,
      "verseString": "وَلَقَدْ أَنْذَرَهُمْ بَطْشَتَنَا فَتَمَارَوْا بِالنُّذُرِ",
      "verseStringB": "And certainly he warned them of Our violent seizure, but they disputed the warning."
    },
    {
      "verseNumber": 37,
      "verseString": "وَلَقَدْ رَاوَدُوهُ عَنْ ضَيْفِهِ فَطَمَسْنَا أَعْيُنَهُمْ فَذُوقُوا عَذَابِي وَنُذُرِ",
      "verseStringB": "And certainly they endeavoured to turn him from his guests, but We blinded their eyes; so taste My chastisement and My warning.ᵃ"
    },
    {
      "verseNumber": 38,
      "verseString": "وَلَقَدْ صَبَّحَهُمْ بُكْرَةً عَذَابٌ مُسْتَقِرٌّ",
      "verseStringB": "And certainly a lasting chastisement overtook them in the morning."
    },
    {
      "verseNumber": 39,
      "verseString": "فَذُوقُوا عَذَابِي وَنُذُرِ",
      "verseStringB": "So taste My chastisement and My warning."
    },
    {
      "verseNumber": 40,
      "verseString": "وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ",
      "verseStringB": "And certainly We have made the Qur’ān easy to remember, but is there any one who will mind?"
    },
    {
      "verseNumber": 41,
      "verseString": "وَلَقَدْ جَاءَ آلَ فِرْعَوْنَ النُّذُرُ",
      "verseStringB": "And certainly the warning came to Pharaoh’s people."
    },
    {
      "verseNumber": 42,
      "verseString": "كَذَّبُوا بِآيَاتِنَا كُلِّهَا فَأَخَذْنَاهُمْ أَخْذَ عَزِيزٍ مُقْتَدِرٍ",
      "verseStringB": "They rejected all Our signs, so We overtook them with the seizing of the Mighty, the Powerful."
    },
    {
      "verseNumber": 43,
      "verseString": "أَكُفَّارُكُمْ خَيْرٌ مِنْ أُولَٰئِكُمْ أَمْ لَكُمْ بَرَاءَةٌ فِي الزُّبُرِ",
      "verseStringB": "Are your disbelievers better than these, or have you an immunity in the scriptures?"
    },
    {
      "verseNumber": 44,
      "verseString": "أَمْ يَقُولُونَ نَحْنُ جَمِيعٌ مُنْتَصِرٌ",
      "verseStringB": "Or say they: We are a host allied together to help each other?"
    },
    {
      "verseNumber": 45,
      "verseString": "سَيُهْزَمُ الْجَمْعُ وَيُوَلُّونَ الدُّبُرَ",
      "verseStringB": "Soon shall the hosts be routed, and they will show (their) backs.ᵃ"
    },
    {
      "verseNumber": 46,
      "verseString": "بَلِ السَّاعَةُ مَوْعِدُهُمْ وَالسَّاعَةُ أَدْهَىٰ وَأَمَرُّ",
      "verseStringB": "Nay, the Hour is their promised time, and the Hour is most grievous and bitter.ᵃ"
    },
    {
      "verseNumber": 47,
      "verseString": "إِنَّ الْمُجْرِمِينَ فِي ضَلَالٍ وَسُعُرٍ",
      "verseStringB": "Surely the guilty are in error and distress."
    },
    {
      "verseNumber": 48,
      "verseString": "يَوْمَ يُسْحَبُونَ فِي النَّارِ عَلَىٰ وُجُوهِهِمْ ذُوقُوا مَسَّ سَقَرَ",
      "verseStringB": "On the day when they are dragged into the Fire upon their faces: Taste the touch of hell.ᵃ"
    },
    {
      "verseNumber": 49,
      "verseString": "إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ",
      "verseStringB": "Surely We have created everything according to a measure.ᵃ"
    },
    {
      "verseNumber": 50,
      "verseString": "وَمَا أَمْرُنَا إِلَّا وَاحِدَةٌ كَلَمْحٍ بِالْبَصَرِ",
      "verseStringB": "And Our command is but once, as the twinkling of an eye."
    },
    {
      "verseNumber": 51,
      "verseString": "وَلَقَدْ أَهْلَكْنَا أَشْيَاعَكُمْ فَهَلْ مِنْ مُدَّكِرٍ",
      "verseStringB": "And certainly We destroyed your fellows, but is there anyone who will mind?"
    },
    {
      "verseNumber": 52,
      "verseString": "وَكُلُّ شَيْءٍ فَعَلُوهُ فِي الزُّبُرِ",
      "verseStringB": "And everything they do is in the writings."
    },
    {
      "verseNumber": 53,
      "verseString": "وَكُلُّ صَغِيرٍ وَكَبِيرٍ مُسْتَطَرٌ",
      "verseStringB": "And everything small and great is written down."
    },
    {
      "verseNumber": 54,
      "verseString": "إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَنَهَرٍ",
      "verseStringB": "Surely the dutiful will be among Gardens and rivers,"
    },
    {
      "verseNumber": 55,
      "verseString": "فِي مَقْعَدِ صِدْقٍ عِنْدَ مَلِيكٍ مُقْتَدِرٍ",
      "verseStringB": "In the seat of truth, with a most Powerful King."
    }
  ],
  "nameEnglish": "The Moon",
  "nameTrans": "al-Qamar",
  "nameArabic": "الـقمـر",
  "chapterNumber": 54,
  "nVerses": 55,
  "footnotes": [
    {
      "note": "1a. The “rending asunder of the moon” in the time of the Holy Prophet is an incident related by a number of his companions; and the reports of this incident are classedas mashh∂r (well-known) (Rz), and are accepted as correct by Bukhårß and Muslim. IbnAthßr says: “The incident is narrated in mutawåtir (successively repeated) √adßth with©a√ß√ isnåd (sound transmission)”. While the main fact is thus undisputed, there aresome differences as to details. IMsd says that he saw the peak of Mount Ïirå’ interposing between the two parts. I‘Ab says that one of the two parts remained, while the otherdisappeared (Kf). Answering the objection to the possibility of such an unusual incident,Rz concludes from the different versions of the report that it was a kind of lunar eclipse,and the appearance of something in the form of half the moon in the firmament. The bestauthorities, however, agree that there is no reason to doubt the trustworthiness of thereport, and that the same incident is referred to here. In the whole history of miracles,this is the only miracle of which a contemporaneous record exists. It thus stands uniqueeven among the miracles of the Holy Prophet.Some commentators are, however, of opinion that the verse under discussion refersto the rending asunder of the moon at the approach of the day of Judgment. There is alsoa suggestion that inshaqqa-l-qamaru means the matter has become manifest, the reasongiven being that the Arabs used to set forth the example of the moon for an affairbecoming manifest, as the morning is spoken of as falaq, literally a split, fissure, or cleft(AH). R explains the phrase under the root shaqq as bearing any of the following threesignificances: “One explanation of the phrase is that the moon was rent asunder in theHoly Prophet’s time; another, that the rending would be brought about at the approachof the Judgment day; and a third, that the meaning is that the affair became manifest”.It may, thus, have been a particular kind of lunar eclipse, the moon appearing as if it werecloven into two, a part remaining bright and the other part darkening, this being the meaningof one part disappearing and the other remaining, or some great commotion might have takenplace in the moon or some other unusual phenomenon may have occurred, which might havebeen made apparent to the naked eye through the strong visionary power of the Prophet.\n\n2a. By calling it strong enchantment, they meant to indicate that it was a strongmagical illusion, not an actual occurrence. But the word mustamirr, which is here translated as strong, may also mean transient, i.e., a thing which has occurred and passedaway, or continuous in the sense that such things have been taking place of old.\n\n3a. According to Qatådah the meaning is those who deserve good will meet withgood, and those who deserve evil will meet with evil; or the meaning is that the truth willbe established, and become manifest, and falsehood will pass away (AH). Or, the wordsmean that every affair must draw to an end, the reference being to the opposition whichwas being offered to the Prophet.\n\n4a. The fate of the ancients, of whom narratives are recited, should have preventedthe opponents of Truth from following in their footsteps.\n\n8a. The commentators make all verses of this description apply to the life after death,but comparison with the fate of other people, whose stories are narrated by way of illustration, shows clearly that the punishment of this life is also meant. The hard day of troubleovertakes the opponents of Truth in this life as well, and the Hereafter only brings it in amore palpable, and therefore more terrible, form. The Inviter is the Prophet, who invitesthem to truth, and the graves as applying to this life may signify their homes because theywere spiritually dead.\n\n14a. The boat in which Noah and his companions were saved — spoken of in theprevious verse as a thing made of ordinary planks and nails — is here described as floating on before Our eyes, meaning that it was the mercy of God that saved the boat.\n\n15a. The fate of Noah’s people is a sign to the deniers of the Holy Prophet.Compare 51:37– 46, where a sign is said to be left in the people of Noah, in Moses’enemies, in ‘Åd and in Tham∂d. Of late, reports have been published in certain newspapers that parts of Noah’s ark have been discovered in the snowy regions of a certainmountain, but it is difficult to say what truth there is in these reports.\n\n28a. Water is here said to be shared between them, i.e., between the people themselves, as the word baina-hum shows, and not between the people and the she-camel.The concluding statement signifies that “every share of the water shall be attended” bythe she-camel, i.e., the water shall not be withheld from her on account of its division.These words, therefore, do not show that the she-camel had a whole day to herself, during which the people could not have a drink.\n\n31a. The punishment which overtook Tham∂d is called sometimes rajfah, i.e., theearthquake (7:78), sometimes ©å‘iqah, i.e., the scourge or punishment (41:13; 51:44),sometimes ©ai√ah as here, i.e., the cry, or the rumbling before an earthquake, and sometimes Δåghiyah (69:5), which is synonymous with ©å‘iqah; but its description here, as alsoin 27:52, shows that it was a severe earthquake, which destroyed the men and their houses.Mu√ta˚ir is the maker of a √a˚ßrah, which signifies an enclosure made of dry canes, etc., toconfine and protect sheep or camels, etc. (LL). Hashßm signifies the dry fragments of wood.\n\n34a. Ïå©ib signifies a thrower or a pelter of stones (T, LL), that being its primary significance; hence it also comes to signify a storm raining pebbles. As other occasions onwhich details of the punishment are given show that it was a volcanic eruption, I render theword as meaning stone-storm, because stones mixed with ashes were rained upon them.\n\n37a. They endeavoured to prevent him taking his guests into his house, but wereunable to see their way to it.\n\n45a. It is related by Ibn ‘Abbås that the Holy Prophet prayed within his tent on theday of Badr, saying: “O Lord, I beseech Thee according to Thy covenant and Thypromise; O Lord, if such is Thy will, Thou mayest not be served after this day”. Ab∂Bakr took his hand and said: “Allåh is sufficient for thee, O Messenger of Allåh”. Sohe went out and he recited: “Soon shall the hosts be routed, and they will show theirbacks; nay, the Hour is their promised time, and the Hour is most grievous and bitter”(B. 56:89). This shows how the Prophet and his companions read prophecies of thevanquishment of the opponents in words relating apparently to the Hereafter.\n\n46a. See the last note, which shows that the Holy Prophet understood the Hour tomean the hour or time of the discomfiture of the Quraish, and looked upon the battle ofBadr as fulfilling this prophecy.\n\n48a. The Quraish who were slain at Badr were removed to a pit for burial, and theProphet is reported as having addressed them thus: “Surely we have found true what ourLord promised us: have you too found true what your Lord promised you?” (IbnHishåm). The punishment of this life is called here a touch of hell.\n\n49a. So that even nations and people cannot go beyond a certain limit."
    }
  ]
}
