{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "Whatever is in the heavens and the earth declares the glory of Allāh, and He is the Mighty, the Wise."
    },
    {
      "verseNumber": 2,
      "verseString": "لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۖ يُحْيِي وَيُمِيتُ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "His is the kingdom of the heavens and the earth. He gives life and causes death; and He is Possessor of power over all things."
    },
    {
      "verseNumber": 3,
      "verseString": "هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ ۖ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ",
      "verseStringB": "He is the First and the Last and the Manifest and the Hidden,ᵃ and He is Knower of all things."
    },
    {
      "verseNumber": 4,
      "verseString": "هُوَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۚ يَعْلَمُ مَا يَلِجُ فِي الْأَرْضِ وَمَا يَخْرُجُ مِنْهَا وَمَا يَنْزِلُ مِنَ السَّمَاءِ وَمَا يَعْرُجُ فِيهَا ۖ وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "verseStringB": "He it is Who created the heavens and the earth in six periods, and He is established on the Throne of Power. He knows that which goes down into the earth and that which comes forth out of it, and that which comes down from heaven and that which goes up to it. And He is with you wherever you are. And Allāh is Seer of what you do."
    },
    {
      "verseNumber": 5,
      "verseString": "لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ",
      "verseStringB": "His is the kingdom of the heavens and the earth; and to Allāh are (all) affairs returned."
    },
    {
      "verseNumber": 6,
      "verseString": "يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ ۚ وَهُوَ عَلِيمٌ بِذَاتِ الصُّدُورِ",
      "verseStringB": "He causes the night to pass into the day, and causes the day to pass into the night. And He is Knower of what is in the hearts."
    },
    {
      "verseNumber": 7,
      "verseString": "آمِنُوا بِاللَّهِ وَرَسُولِهِ وَأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ ۖ فَالَّذِينَ آمَنُوا مِنْكُمْ وَأَنْفَقُوا لَهُمْ أَجْرٌ كَبِيرٌ",
      "verseStringB": "Believe in Allāh and His Messen - ger, and spend of that whereof He has made you heirs. So those of you who believe and spend — for them is a great reward."
    },
    {
      "verseNumber": 8,
      "verseString": "وَمَا لَكُمْ لَا تُؤْمِنُونَ بِاللَّهِ ۙ وَالرَّسُولُ يَدْعُوكُمْ لِتُؤْمِنُوا بِرَبِّكُمْ وَقَدْ أَخَذَ مِيثَاقَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ",
      "verseStringB": "And what reason have you that you believe not in Allāh? And the Mes sen - ger invites you to believe in your Lord, and He has indeed accepted your covenant, if you are believers.ᵃ"
    },
    {
      "verseNumber": 9,
      "verseString": "هُوَ الَّذِي يُنَزِّلُ عَلَىٰ عَبْدِهِ آيَاتٍ بَيِّنَاتٍ لِيُخْرِجَكُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ ۚ وَإِنَّ اللَّهَ بِكُمْ لَرَءُوفٌ رَحِيمٌ",
      "verseStringB": "He it is Who sends down clear messages to His servant, that he may bring you forth from darkness into light. And surely Allāh is Kind, Merciful to you."
    },
    {
      "verseNumber": 10,
      "verseString": "وَمَا لَكُمْ أَلَّا تُنْفِقُوا فِي سَبِيلِ اللَّهِ وَلِلَّهِ مِيرَاثُ السَّمَاوَاتِ وَالْأَرْضِ ۚ لَا يَسْتَوِي مِنْكُمْ مَنْ أَنْفَقَ مِنْ قَبْلِ الْفَتْحِ وَقَاتَلَ ۚ أُولَٰئِكَ أَعْظَمُ دَرَجَةً مِنَ الَّذِينَ أَنْفَقُوا مِنْ بَعْدُ وَقَاتَلُوا ۚ وَكُلًّا وَعَدَ اللَّهُ الْحُسْنَىٰ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ",
      "verseStringB": "And what reason have you that you spend not in Allāh’s way? And Allāh’s is the inheritance of the heavens and the earth. Those of you who spent before the Victorya and fought are not on a level (with others). They are greater in rank than those who spent and fought afterwards. And Allāh has promised good to all. And Allāh is Aware of what you do."
    },
    {
      "verseNumber": 11,
      "verseString": "مَنْ ذَا الَّذِي يُقْرِضُ اللَّهَ قَرْضًا حَسَنًا فَيُضَاعِفَهُ لَهُ وَلَهُ أَجْرٌ كَرِيمٌ",
      "verseStringB": "Who is he that will offer to Allāh a good gift, so He will double it for him, and he will have a generous reward."
    },
    {
      "verseNumber": 12,
      "verseString": "يَوْمَ تَرَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ يَسْعَىٰ نُورُهُمْ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ بُشْرَاكُمُ الْيَوْمَ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ ذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ",
      "verseStringB": "On that day thou wilt see the faithful men and the faithful women, their light gleaming before them and on their right hand.ᵃ Good news for you this day! — Gardens wherein rivers flow, to abide therein! That is the grand achievement."
    },
    {
      "verseNumber": 13,
      "verseString": "يَوْمَ يَقُولُ الْمُنَافِقُونَ وَالْمُنَافِقَاتُ لِلَّذِينَ آمَنُوا انْظُرُونَا نَقْتَبِسْ مِنْ نُورِكُمْ قِيلَ ارْجِعُوا وَرَاءَكُمْ فَالْتَمِسُوا نُورًا فَضُرِبَ بَيْنَهُمْ بِسُورٍ لَهُ بَابٌ بَاطِنُهُ فِيهِ الرَّحْمَةُ وَظَاهِرُهُ مِنْ قِبَلِهِ الْعَذَابُ",
      "verseStringB": "On the day when the hypocrites, men and women, will say to those who believe: Wait for us, that we may borrow from your light. It will be said: Turn back and seek a light. Then a wall, with a door in it, will be raised between them. Within it shall be mercy, and outside of it chastisement.ᵃ"
    },
    {
      "verseNumber": 14,
      "verseString": "يُنَادُونَهُمْ أَلَمْ نَكُنْ مَعَكُمْ ۖ قَالُوا بَلَىٰ وَلَٰكِنَّكُمْ فَتَنْتُمْ أَنْفُسَكُمْ وَتَرَبَّصْتُمْ وَارْتَبْتُمْ وَغَرَّتْكُمُ الْأَمَانِيُّ حَتَّىٰ جَاءَ أَمْرُ اللَّهِ وَغَرَّكُمْ بِاللَّهِ الْغَرُورُ",
      "verseStringB": "They will cry out to them: Were we not with you? They will say: Yea, but you caused yourselves to fall into temptation, and you waited a and doubted, and vain desires deceived you, till the threatened punishment b of Allāh came, and the arch-deceiver deceived you about Allāh."
    },
    {
      "verseNumber": 15,
      "verseString": "فَالْيَوْمَ لَا يُؤْخَذُ مِنْكُمْ فِدْيَةٌ وَلَا مِنَ الَّذِينَ كَفَرُوا ۚ مَأْوَاكُمُ النَّارُ ۖ هِيَ مَوْلَاكُمْ ۖ وَبِئْسَ الْمَصِيرُ",
      "verseStringB": "So this day no ransom will be accepted from you, nor from those who disbelieved. Your abode is the Fire; it is your patrona and evil is the resort."
    },
    {
      "verseNumber": 16,
      "verseString": "أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَنْ تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ اللَّهِ وَمَا نَزَلَ مِنَ الْحَقِّ وَلَا يَكُونُوا كَالَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلُ فَطَالَ عَلَيْهِمُ الْأَمَدُ فَقَسَتْ قُلُوبُهُمْ ۖ وَكَثِيرٌ مِنْهُمْ فَاسِقُونَ",
      "verseStringB": "Has not the time yet come for the believers that their hearts should be humble for the remembrance of Allāh and the Truth that is revealed, and (that) they should not be like those who were given the Book before, but time was prolonged for them, so their hearts hardened.ᵃ And most of them are transgressors."
    },
    {
      "verseNumber": 17,
      "verseString": "اعْلَمُوا أَنَّ اللَّهَ يُحْيِي الْأَرْضَ بَعْدَ مَوْتِهَا ۚ قَدْ بَيَّنَّا لَكُمُ الْآيَاتِ لَعَلَّكُمْ تَعْقِلُونَ",
      "verseStringB": "Know that Allāh gives life to the earth after its death.ᵃ Indeed, We have made the signs clear for you that you may understand."
    },
    {
      "verseNumber": 18,
      "verseString": "إِنَّ الْمُصَّدِّقِينَ وَالْمُصَّدِّقَاتِ وَأَقْرَضُوا اللَّهَ قَرْضًا حَسَنًا يُضَاعَفُ لَهُمْ وَلَهُمْ أَجْرٌ كَرِيمٌ",
      "verseStringB": "The men who give in charity and the women who give in charity and set apart for Allāh a goodly portion, it will be doubled for them, and theirs is a generous reward."
    },
    {
      "verseNumber": 19,
      "verseString": "وَالَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ أُولَٰئِكَ هُمُ الصِّدِّيقُونَ ۖ وَالشُّهَدَاءُ عِنْدَ رَبِّهِمْ لَهُمْ أَجْرُهُمْ وَنُورُهُمْ ۖ وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ الْجَحِيمِ",
      "verseStringB": "And those who believe in Allāh and His messengers, they are the truthful and the faithful ones with their Lord. They have their reward and their light. And those who disbelieve and reject Our messages, they are the inmates of hell."
    },
    {
      "verseNumber": 20,
      "verseString": "اعْلَمُوا أَنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ وَزِينَةٌ وَتَفَاخُرٌ بَيْنَكُمْ وَتَكَاثُرٌ فِي الْأَمْوَالِ وَالْأَوْلَادِ ۖ كَمَثَلِ غَيْثٍ أَعْجَبَ الْكُفَّارَ نَبَاتُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرًّا ثُمَّ يَكُونُ حُطَامًا ۖ وَفِي الْآخِرَةِ عَذَابٌ شَدِيدٌ وَمَغْفِرَةٌ مِنَ اللَّهِ وَرِضْوَانٌ ۚ وَمَا الْحَيَاةُ الدُّنْيَا إِلَّا مَتَاعُ الْغُرُورِ",
      "verseStringB": "Know that this world’s life is only sport and play and gaiety and boasting among yourselves and a vying in the multiplication of wealth and children.ᵃ It is as rain, whose causing the vegetation to grow pleases the husbandmen, then it withers away so that thou seest it turning yellow, then it becomes chaff.ᵇ And in the Hereafter is a severe chastisement, and (also) forgiveness from Allāh and (His) pleasure.ᶜ And this world’s life is naught but a source of vanity."
    },
    {
      "verseNumber": 21,
      "verseString": "سَابِقُوا إِلَىٰ مَغْفِرَةٍ مِنْ رَبِّكُمْ وَجَنَّةٍ عَرْضُهَا كَعَرْضِ السَّمَاءِ وَالْأَرْضِ أُعِدَّتْ لِلَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ ۚ ذَٰلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ ۚ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ",
      "verseStringB": "Vie one with another for forgiveness from your Lord and a Garden the extensiveness of which is as the extensiveness of the heaven and the eartha— it is prepared for those who believe in Allāh and His messengers. That is the grace of Allāh; He gives it to whom He pleases. And Allāh is the Lord of mighty grace."
    },
    {
      "verseNumber": 22,
      "verseString": "مَا أَصَابَ مِنْ مُصِيبَةٍ فِي الْأَرْضِ وَلَا فِي أَنْفُسِكُمْ إِلَّا فِي كِتَابٍ مِنْ قَبْلِ أَنْ نَبْرَأَهَا ۚ إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ",
      "verseStringB": "No disaster befalls in the earth, or in yourselves,ᵃ but it is in a book before We bring it into existence — surely that is easy to Allāh —"
    },
    {
      "verseNumber": 23,
      "verseString": "لِكَيْلَا تَأْسَوْا عَلَىٰ مَا فَاتَكُمْ وَلَا تَفْرَحُوا بِمَا آتَاكُمْ ۗ وَاللَّهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ",
      "verseStringB": "So that you grieve not for what has escaped you, nor exult in that which He has given you. And Allāh loves not any arrogant boaster:"
    },
    {
      "verseNumber": 24,
      "verseString": "الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ ۗ وَمَنْ يَتَوَلَّ فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ",
      "verseStringB": "Such as are niggardly and enjoin niggardliness on men. And whoever turns back, then surely Allāh is the Self-Sufficient, the Praised."
    },
    {
      "verseNumber": 25,
      "verseString": "لَقَدْ أَرْسَلْنَا رُسُلَنَا بِالْبَيِّنَاتِ وَأَنْزَلْنَا مَعَهُمُ الْكِتَابَ وَالْمِيزَانَ لِيَقُومَ النَّاسُ بِالْقِسْطِ ۖ وَأَنْزَلْنَا الْحَدِيدَ فِيهِ بَأْسٌ شَدِيدٌ وَمَنَافِعُ لِلنَّاسِ وَلِيَعْلَمَ اللَّهُ مَنْ يَنْصُرُهُ وَرُسُلَهُ بِالْغَيْبِ ۚ إِنَّ اللَّهَ قَوِيٌّ عَزِيزٌ",
      "verseStringB": "Certainly We sent Our messengers with clear arguments, and sent down with them the Book and the measure,ᵃ that men may conduct themselves with equity. And We sent down iron,ᵇ wherein is great violence and advan tages to men, and that Allāh may know who helps Him and His messengers, unseen. Surely Allāh is Strong, Mighty."
    },
    {
      "verseNumber": 26,
      "verseString": "وَلَقَدْ أَرْسَلْنَا نُوحًا وَإِبْرَاهِيمَ وَجَعَلْنَا فِي ذُرِّيَّتِهِمَا النُّبُوَّةَ وَالْكِتَابَ ۖ فَمِنْهُمْ مُهْتَدٍ ۖ وَكَثِيرٌ مِنْهُمْ فَاسِقُونَ",
      "verseStringB": "And certainly We sent Noah and Abraham, and We gave prophethood and the Book to their offspring; so among them is he who goes aright, but most of them are transgressors."
    },
    {
      "verseNumber": 27,
      "verseString": "ثُمَّ قَفَّيْنَا عَلَىٰ آثَارِهِمْ بِرُسُلِنَا وَقَفَّيْنَا بِعِيسَى ابْنِ مَرْيَمَ وَآتَيْنَاهُ الْإِنْجِيلَ وَجَعَلْنَا فِي قُلُوبِ الَّذِينَ اتَّبَعُوهُ رَأْفَةً وَرَحْمَةً وَرَهْبَانِيَّةً ابْتَدَعُوهَا مَا كَتَبْنَاهَا عَلَيْهِمْ إِلَّا ابْتِغَاءَ رِضْوَانِ اللَّهِ فَمَا رَعَوْهَا حَقَّ رِعَايَتِهَا ۖ فَآتَيْنَا الَّذِينَ آمَنُوا مِنْهُمْ أَجْرَهُمْ ۖ وَكَثِيرٌ مِنْهُمْ فَاسِقُونَ",
      "verseStringB": "Then We made Our messengers to follow in their footsteps, and We made Jesus son of Mary to follow, and We gave him the Gospel. And We put compassion and mercy in the hearts of those who followed him. And (as for) monkery, they innovated it — We did not prescribe it to them — only to seek Allāh’s pleasure, but they did not observe it with its due observance.ᵃ So We gave those of them who believed their reward, but most of them are transgressors."
    },
    {
      "verseNumber": 28,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَآمِنُوا بِرَسُولِهِ يُؤْتِكُمْ كِفْلَيْنِ مِنْ رَحْمَتِهِ وَيَجْعَلْ لَكُمْ نُورًا تَمْشُونَ بِهِ وَيَغْفِرْ لَكُمْ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ",
      "verseStringB": "O you who believe, keep your duty to Allāh and believe in His Messenger — He will give you two portions of His mercy,ᵃ and give you a light in which you shall walk, and forgive you. And Allāh is Forgiving, Merciful —"
    },
    {
      "verseNumber": 29,
      "verseString": "لِئَلَّا يَعْلَمَ أَهْلُ الْكِتَابِ أَلَّا يَقْدِرُونَ عَلَىٰ شَيْءٍ مِنْ فَضْلِ اللَّهِ ۙ وَأَنَّ الْفَضْلَ بِيَدِ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ ۚ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ",
      "verseStringB": "That the People of the Book may know that they control naught of the grace of Allāh, and that grace is in Allāh’s hand. He gives it to whom He pleases. And Allāh is the Lord of mighty grace.ᵃ"
    }
  ],
  "nameEnglish": "Iron",
  "nameTrans": "al-Hadid`",
  "nameArabic": "الحـديد",
  "chapterNumber": 57,
  "nVerses": 29,
  "footnotes": [
    {
      "note": "3a. The Holy Prophet has thus explained the four attributes of the Divine Beingmentioned here: “Thou art the First, so that there was nothing before Thee, and Thou artthe Last, so that there is nothing after Thee, and Thou art the Manifest, or the Ascendantover all, so that there is nothing above Thee, and Thou art the Hidden, the Knower of thehidden things, so that there is nothing hidden from Thee” (Ms. 48:13).\n\n8a. The believers, who are addressed, are exhorted to be true to their belief. Belief isthus not mere confession of the Truth but the upholding of it under trials.\n\n10a. By Victory here is meant the moral victory gained by the Ïudaibiyah truce, orthe conquest of Makkah, which made the Muslims virtually the masters of the whole ofArabia. The sacrifices made earlier had therefore a greater value on account of the trialswhich the Muslims had then to face.\n\n12a. The first part of this section speaks of the light — the light of faith — which wasgiven through the Prophet. This light will become manifest on the day of Resurrection.\n\n13a. Although the hypocrites remained mixed with the believers for a time, yet separation was brought about even in this life towards the close of the Prophet’s life. As theResurrection will bring hidden things to light, the hypocrites will find themselves devoidof light, because they did not possess the light of faith in this life.\n\n14a. The hypocrites hoped that the Muslims would be annihilated by their powerfulopponents.\n\n14b. Amr Allåh here signifies the threatened punishment of Allåh (LL).\n\n15a. The Fire is here called a maulå, or a friend or patron, of the disbelievers, thusshowing that it is for their good that they will have to undergo the suffering of fire. Infact, hell is elsewhere also represented to be a place or a state which will ultimately leadto the purification of man, as fire purifies gold of dross. Those who do not prepare themselves in this life for a life after death, will have to be purified in the next life, so thatthey may be fit to make the spiritual progress necessary for a heavenly life. The processof purification, which is in other words hell, is thus a necessary stage in the spiritual perfection of those who do not avail themselves of the opportunity granted to them in thislife. The keenness of the torments of that other life is due to the keener perception of thesoul, which is the necessary result of its separation from the earthly vessel. Bliss and torment therefore grow equally keener in that life.\n\n16a. Commenting on this verse, IJ quotes an earlier authority to the effect that thefirst thing that will be taken away from the people is khush∂‘ or humbleness of heart. Itis clear that this verse speaks of the Muslims of a later age, for it compares their case tothose who were given the scriptures before them and then a long time having passedover them, their hearts hardened. It is therefore the later generations of the Muslims thatare addressed in these words. They are reminded that after the passing of a long time,they will fall off from the high standard of the earlier generations, and their hearts willbe hardened like the hearts of the earlier people.\n\n17a.  Having spoken of the falling off of the Muslims of a later age, the good newsis here announced that, after that, the dead earth will be generated with a new life, thelife spiritual. The next verse then goes on to add that it will be through the sacrifices of apart of them that the Muslim nation will again be raised to eminence. These verses are aclear prophetic description of the present condition of Islåm. A generous reward ispromised to those who make these sacrifices, in the concluding words of v. 18.\n\n20a. This world’s life here stands for the material side of life. It is entirely a pursuitof unreality. Individuals as well as nations are, as it were, racing for the transitory goodsof this life, for means of adorning the outside, for riches and gaiety, to the utter neglectof the higher values of life which are pointed out in the next verse.\n\n20b. The word kuff år, which by the consensus of the opinion of all interpreters signifies here husbandmen, is the plural of kåfir, which has been used throughout the HolyQur’ån to signify a disbeliever. But the context here does not allow us to adopt that significance. Kafara literally means he covered, concealed or hid a thing (LL). The disbeliever iscalled a kåfir because he covers or conceals the benefit or favour conferred on him by God,the favour relating to the higher or moral side of life (LL). The husbandman is called akåfir because he conceals the seed under earth (LL). The material side of life is herelikened to the growth of vegetation which flourishes for a time and then decays. Even thuswe see individuals and nations rising to prosperity and then falling back on evil days.\n\n20c. Note how Divine forgiveness is constantly mentioned when punishment is spokenof, to show that the attribute of mercy is the predominant attribute of the Divine nature.\n\n21a. The Garden or the Paradise is here said to be as extensive as the heavens andthe earth, and a similar statement occurs in 3:133. These statements afford us the key toa right conception of paradise. The following incident is related under 3:133: “A messenger of Heraclius asked the Holy Prophet: ‘If paradise were as extensive as the heavens and the earth, where would be hell?’ The Prophet replied ‘Glory be to Allåh! Whereis the night when the day comes?’ ” (Rz). It shows clearly that heaven and hell are notthe names of two places, but are really two conditions, because if paradise were thename of a particular place, hell could not exist, as paradise would according to theseverses extend over the whole of space.\n\n22a. The book here means Divine knowledge. Disaster is here spoken of as befalling inthe earth or in yourselves, i.e., it either affects the people of the world generally or theMuslims in particular. Dailamß records a report from the Prophet: “A door of disasters willbe opened for my community (ummah) in the latter days, which you will be unable toclose, unless you meet the situation with this verse”. And then the Prophet recited thisverse. In view of what has already been stated in verse 16, relating to the lapse of a longtime and the hardening of the hearts of the Muslims, it is easy to see that the disasters whichare predicted as befalling the Muslims in the latter days are due to their own falling off fromthe high standard of life which they were required to follow, and hence the remedy suggested is again the making of sacrifices as pointed out in v. 18. The great World-wars, whichhave brought the heaviest disasters on humanity in general, and the disasters of the Muslimsin particular, are all spoken of in the Ïadßth, which it is difficult to quote in a footnote.\n\n25a. As to what is meant by mßzån, or the measure, see 55:7a. Here the measure isspoken of as being sent down with messengers of God along with the Book. Now theBook contains the Divine commandments or the moral code of life, and the measure istherefore clearly the example of the Prophet, who by carrying out the Divine commandments shows how the directions contained in the Book are to be followed.\n\n25b. Of all the metals, none has proved of greater utility than iron, and this metalhas played an all-important part in civilization. It should be noted that inzål (inf. ofanzala) not only signifies the sending down of a thing from above, but also means causing a thing to grow, or bringing the means of it into existence (Rz). Hence it is that inthe Holy Qur’ån we find the word used with reference to the clothes that man wears(7:26), and to cattle (39:6), etc.The mention of iron undoubtedly refers to the resistance against the enemy, whichas a last resort had to be effected with the sword. This is made clear by the addition ofthe words — that Allåh may know who helps Him and His messengers, unseen. Thishelp was rendered by the faithful by taking up the sword in defence of the faith.\n\n27a. There is no monkery in Islåm, is a well-known saying of the Holy Prophet,quite in accordance with this verse, which states that even among the Christiansmonkery is an institution which was introduced by themselves, not being a Divine ordinance. It is added, however, that their object in adopting this innovation was to seekDivine pleasure. The Muslims were now becoming a great nation, and as they werebrought up in the utmost simplicity, and were also enjoined to disdain the gaiety of thislife, they are told that their greatness as a nation depended upon the development of alltheir faculties, so that they, while retaining their simplicity of life, should not stoop topractices like that of monkery. They are thus first told that they should not run after thegaieties of the world and make the amassing of wealth the pursuit of their life (v. 20),and now they are reminded that they should neither go to the other extreme and give upworldly pursuits, and adopt such practices as monkery. They are thus required to keepthe balance between the material and moral sides of life.\n\n28a. By the two portions of mercy are meant their portion in this world and theirportion in the Hereafter. A Muslim is thus required to enjoy the worldly benefits but notto the neglect of his moral responsibilities, to take advantage of the material benefitswithout retarding his spiritual advancement. Islåm offers a contrast with Christian civilization, which started with monkery and has ended in engrossment in the world to theutter neglect of the spiritual side. The history of Islåm on the other hand shows temporaland spiritual advancement going hand in hand from the days of the Prophet. And it is tothis contrast that attention is called in these verses. In fact it is thus pointed out that theonly lasting civilization is the civilization of Islåm, which offers a middle course, andchalks out a way, by walking in which man can attain material along with spiritualadvancement. Hence the next verse speaks clearly of the People of the Book.\n\n29a. The People of the Book or the Christians are here told that they do not controlAllåh’s grace. They wanted first to control Allåh’s spiritual grace by their monkery, butfailed. Later, they have tried to control the material grace or the temporal bounties ofGod by their entire engrossment in worldly pursuits, but even their material advancement is leading to their ruin, because it is not being balanced by spiritual progress."
    }
  ]
}
