{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "Whatever is in the heavens and whatever is in the earth glorifies Allāh; and He is the Mighty, the Wise."
    },
    {
      "verseNumber": 2,
      "verseString": "هُوَ الَّذِي أَخْرَجَ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ مِنْ دِيَارِهِمْ لِأَوَّلِ الْحَشْرِ ۚ مَا ظَنَنْتُمْ أَنْ يَخْرُجُوا ۖ وَظَنُّوا أَنَّهُمْ مَانِعَتُهُمْ حُصُونُهُمْ مِنَ اللَّهِ فَأَتَاهُمُ اللَّهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوا ۖ وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ ۚ يُخْرِبُونَ بُيُوتَهُمْ بِأَيْدِيهِمْ وَأَيْدِي الْمُؤْمِنِينَ فَاعْتَبِرُوا يَا أُولِي الْأَبْصَارِ",
      "verseStringB": "He it is Who caused those who disbelieved of the People of the Book to go forth from their homes at the first banishment.ᵃ You deemed not that they would go forth, while they thought that their fortresses would defend them against Allāh. But Allāh came to them from a place they expected not and cast terror into their hearts — they demolished their houses with their own hands and the hands of the believers. So take a lesson, O you who have eyes!ᵇ"
    },
    {
      "verseNumber": 3,
      "verseString": "وَلَوْلَا أَنْ كَتَبَ اللَّهُ عَلَيْهِمُ الْجَلَاءَ لَعَذَّبَهُمْ فِي الدُّنْيَا ۖ وَلَهُمْ فِي الْآخِرَةِ عَذَابُ النَّارِ",
      "verseStringB": "And had it not been that Allāh had decreed for them the exile, He would certainly have chastised them in this world; and for them in the Hereafter is the chastisement of the Fire."
    },
    {
      "verseNumber": 4,
      "verseString": "ذَٰلِكَ بِأَنَّهُمْ شَاقُّوا اللَّهَ وَرَسُولَهُ ۖ وَمَنْ يُشَاقِّ اللَّهَ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ",
      "verseStringB": "That is because they were opposed to Allāh and His Messenger, and whoever is opposed to Allāh, surely Allāh is Severe in retribution."
    },
    {
      "verseNumber": 5,
      "verseString": "مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَىٰ أُصُولِهَا فَبِإِذْنِ اللَّهِ وَلِيُخْزِيَ الْفَاسِقِينَ",
      "verseStringB": "Whatever palm-tree you cut down or leave it standing upon its roots, it is by Allāh’s permission, and that He may abase the transgressors."
    },
    {
      "verseNumber": 6,
      "verseString": "وَمَا أَفَاءَ اللَّهُ عَلَىٰ رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ وَلَٰكِنَّ اللَّهَ يُسَلِّطُ رُسُلَهُ عَلَىٰ مَنْ يَشَاءُ ۚ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "And whatever Allāh restored to His Messenger from them, you did not press forward against it any horse or any riding-camel, but Allāh gives authority to His messengers against whom He pleases. And Allāh is Possessor of power over all things."
    },
    {
      "verseNumber": 7,
      "verseString": "مَا أَفَاءَ اللَّهُ عَلَىٰ رَسُولِهِ مِنْ أَهْلِ الْقُرَىٰ فَلِلَّهِ وَلِلرَّسُولِ وَلِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ كَيْ لَا يَكُونَ دُولَةً بَيْنَ الْأَغْنِيَاءِ مِنْكُمْ ۚ وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا ۚ وَاتَّقُوا اللَّهَ ۖ إِنَّ اللَّهَ شَدِيدُ الْعِقَابِ",
      "verseStringB": "Whatever Allāh restored to His Messenger from the people of the towns, it is for Allāh and for the Messenger, and for the near of kin and the orphans and the needy and the wayfarer, so that it be not taken by turns by the rich among you. And whatever the Messenger gives you, accept it, and whatever he forbids you, abstain (therefrom); and keep your duty to Allāh. Surely Allāh is Severe in retribution.ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "لِلْفُقَرَاءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِنْ دِيَارِهِمْ وَأَمْوَالِهِمْ يَبْتَغُونَ فَضْلًا مِنَ اللَّهِ وَرِضْوَانًا وَيَنْصُرُونَ اللَّهَ وَرَسُولَهُ ۚ أُولَٰئِكَ هُمُ الصَّادِقُونَ",
      "verseStringB": "(It is) for the poor who fled, who were driven from their homes and their possessions, seeking grace of Allāh and (His) pleasure, and helping Allāh and His Messenger. These it is that are the truthful.ᵃ"
    },
    {
      "verseNumber": 9,
      "verseString": "وَالَّذِينَ تَبَوَّءُوا الدَّارَ وَالْإِيمَانَ مِنْ قَبْلِهِمْ يُحِبُّونَ مَنْ هَاجَرَ إِلَيْهِمْ وَلَا يَجِدُونَ فِي صُدُورِهِمْ حَاجَةً مِمَّا أُوتُوا وَيُؤْثِرُونَ عَلَىٰ أَنْفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ ۚ وَمَنْ يُوقَ شُحَّ نَفْسِهِ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
      "verseStringB": "And those who made their abode in the City and in faith before them love those who have fled to them, and find in their hearts no need of what they are given, and prefer (them) before themselves, though poverty may afflict them.ᵃ And whoever is saved from the niggardliness of his soul, these it is that are the successful."
    },
    {
      "verseNumber": 10,
      "verseString": "وَالَّذِينَ جَاءُوا مِنْ بَعْدِهِمْ يَقُولُونَ رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ",
      "verseStringB": "And those who come after them say: Our Lord, forgive us and our brethren who had precedence of us in faith, and leave no spite in our hearts towards those who believe. Our Lord, surely Thou art Kind, Merciful.ᵃ"
    },
    {
      "verseNumber": 11,
      "verseString": "أَلَمْ تَرَ إِلَى الَّذِينَ نَافَقُوا يَقُولُونَ لِإِخْوَانِهِمُ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ لَئِنْ أُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلَا نُطِيعُ فِيكُمْ أَحَدًا أَبَدًا وَإِنْ قُوتِلْتُمْ لَنَنْصُرَنَّكُمْ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ",
      "verseStringB": "Hast thou not seen the hypocrites? They say to their brethren who disbelieve from among the People of the Book: If you are expelled, we certainly will go forth with you, and we will never obey anyone concerning you; and if you are fought against, we will certainly help you. And Allāh bears witness that they surely are liars.ᵃ"
    },
    {
      "verseNumber": 12,
      "verseString": "لَئِنْ أُخْرِجُوا لَا يَخْرُجُونَ مَعَهُمْ وَلَئِنْ قُوتِلُوا لَا يَنْصُرُونَهُمْ وَلَئِنْ نَصَرُوهُمْ لَيُوَلُّنَّ الْأَدْبَارَ ثُمَّ لَا يُنْصَرُونَ",
      "verseStringB": "If they are expelled, they will not go forth with them, and if they are fought against, they will not help them; and even if they help them, they will certainly turn (their) backs; then they shall not be helped."
    },
    {
      "verseNumber": 13,
      "verseString": "لَأَنْتُمْ أَشَدُّ رَهْبَةً فِي صُدُورِهِمْ مِنَ اللَّهِ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَفْقَهُونَ",
      "verseStringB": "Your fear in their hearts is indeed greater than Allāh’s. That is because they are a people who understand not."
    },
    {
      "verseNumber": 14,
      "verseString": "لَا يُقَاتِلُونَكُمْ جَمِيعًا إِلَّا فِي قُرًى مُحَصَّنَةٍ أَوْ مِنْ وَرَاءِ جُدُرٍ ۚ بَأْسُهُمْ بَيْنَهُمْ شَدِيدٌ ۚ تَحْسَبُهُمْ جَمِيعًا وَقُلُوبُهُمْ شَتَّىٰ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَعْقِلُونَ",
      "verseStringB": "They will not fight against you in a body save in fortified towns or from behind walls. Their fighting between them is severe. Thou wouldst think them united, but their hearts are divided. That is because they are a people who have no sense."
    },
    {
      "verseNumber": 15,
      "verseString": "كَمَثَلِ الَّذِينَ مِنْ قَبْلِهِمْ قَرِيبًا ۖ ذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "verseStringB": "Like those before them shortly:ᵃ they tasted the evil consequences of their conduct, and for them is a painful chastisement."
    },
    {
      "verseNumber": 16,
      "verseString": "كَمَثَلِ الشَّيْطَانِ إِذْ قَالَ لِلْإِنْسَانِ اكْفُرْ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ",
      "verseStringB": "Like the devil when he says to man: Disbelieve. But when he disbe lieves, he says: I am free of thee: surely I fear Allāh, the Lord of the worlds."
    },
    {
      "verseNumber": 17,
      "verseString": "فَكَانَ عَاقِبَتَهُمَا أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا ۚ وَذَٰلِكَ جَزَاءُ الظَّالِمِينَ",
      "verseStringB": "So the end of both of them is that they are both in the Fire to abide therein. And that is the reward of the wrongdoers."
    },
    {
      "verseNumber": 18,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنْظُرْ نَفْسٌ مَا قَدَّمَتْ لِغَدٍ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ",
      "verseStringB": "O you who believe, keep your duty to Allāh, and let every soul consider that which it sends forth for the morrow, and keep your duty to Allāh. Surely Allāh is Aware of what you do."
    },
    {
      "verseNumber": 19,
      "verseString": "وَلَا تَكُونُوا كَالَّذِينَ نَسُوا اللَّهَ فَأَنْسَاهُمْ أَنْفُسَهُمْ ۚ أُولَٰئِكَ هُمُ الْفَاسِقُونَ",
      "verseStringB": "And be not like those who forget Allāh, so He makes them forget their own souls. These are the transgressors."
    },
    {
      "verseNumber": 20,
      "verseString": "لَا يَسْتَوِي أَصْحَابُ النَّارِ وَأَصْحَابُ الْجَنَّةِ ۚ أَصْحَابُ الْجَنَّةِ هُمُ الْفَائِزُونَ",
      "verseStringB": "Not alike are the companions of the Fire and the owners of the Garden. The owners of the Garden are the achievers."
    },
    {
      "verseNumber": 21,
      "verseString": "لَوْ أَنْزَلْنَا هَٰذَا الْقُرْآنَ عَلَىٰ جَبَلٍ لَرَأَيْتَهُ خَاشِعًا مُتَصَدِّعًا مِنْ خَشْيَةِ اللَّهِ ۚ وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ",
      "verseStringB": "Had We sent down this Qur’ān on a mountain, thou wouldst certainly have seen it falling down, splitting asunder because of the fear of Allāh. And We set forth these parables to men that they may reflect."
    },
    {
      "verseNumber": 22,
      "verseString": "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ ۖ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ ۖ هُوَ الرَّحْمَٰنُ الرَّحِيمُ",
      "verseStringB": "He is Allāh besides Whom there is no God: The Knower of the unseen and the seen; He is the Beneficent, the Merciful.ᵃ"
    },
    {
      "verseNumber": 23,
      "verseString": "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ ۚ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ",
      "verseStringB": "He is Allāh, besides Whom there is no God; the King, the Holy, the Author of Peace, the Granter of Security, Guardian over all, the Mighty, the Supreme, the Possessor of greatness. Glory be to Allāh from that which they set up (with Him)!"
    },
    {
      "verseNumber": 24,
      "verseString": "هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "He is Allāh; the Creator, the Maker, the Fashioner: His are the most beautiful names. Whatever is in the heavens and the earth declares His glory; and He is the Mighty, the Wise."
    }
  ],
  "nameEnglish": "The Mobilization",
  "nameTrans": "al-Hashr",
  "nameArabic": "الـحـشـر",
  "chapterNumber": 59,
  "nVerses": 24,
  "footnotes": [
    {
      "note": "2a. The banishment spoken of here took place six months after the battle of Uƒud,when the Banß Na˙ßr, a Jewish tribe of Madßnah, who had at first entered into a covenantwith the Holy Prophet, showed signs of treachery and were punished with banishment(B). This is called the first banishment, to distinguish it from the second, which tookplace in the time of ‘Umar, when the Jews settled at Khaibar were banished to Syria, andwhich is prophetically referred to here. The following detailed account is given by Rz:The Banß Na˙ßr made a treaty with the Holy Prophet to stand neutral between him andhis enemies. When he was victorious at Badr, they said that he was the Prophetpromised in the Torah, on account of the victory, but when the Muslims suffered a losson the day of U√ud, they (i.e., the Banß Na˙ßr) repudiated their vow and broke the agreement. Ka‘b, son of Ashraf, went to Makkah with forty horsemen and made an alliancewith Ab∂ Sufyån. As a consequence, Ka‘b was murdered, and the Holy Prophet told thetribe to leave Madßnah. They wanted ten days for preparation, but ‘Abd Allåh ibn Ubayy(the head of the hypocrites) advised them not to leave Madßnah but to fight against theProphet, promising the help of his own men. He also assured them that, if they werecompelled to go forth, he would go with them. So they fortified themselves within theirstrongholds. After having remained besieged for twenty-one days, and having despairedof help from the hypocrites, they surrendered. The Prophet raised the siege on conditionthat they should depart from Madßnah. With the exception of two families that chose toremain at Khaibar, they all went to Syria.Dr. Prideaux says that the Prophet ordered a party of the Muslims to pursue the emigrants, and that thus they were all put to death. Sale has shown in his note on this versethat the incident from which Dr. Prideaux draws this strange conclusion relates really tothe murder in cold blood of seventy Muslims, who, being invited to preach Islåm, weretreacherously put to death by an Arab tribe.\n\n2b. The Banß Na˙ßr, being granted ten days in which to collect and take with themsuch of their property as they desired, devoted the time at their disposal to the destruction of their houses, lest they should be a source of strength to the Muslims. Whatremained of them was demolished by the Muslims.\n\n7a. This verse relates to property acquired in war, which is called fai’, being derivedfrom af å’a, which occurs in this verse, another kind, called ghanßmah, being mentionedin 8:41, for which see 8:41a. The word af å’a means, He restored to the Muslims, or gaveto them as spoil, the property of the disbelievers (LL). Hence fai’ comes to mean such ofthe possessions of the disbelievers as accrue to the Muslims without war, or such as areobtained from the believers in a plurality of gods after the laying down of arms (LL).The fai’ is not distributed among the warriors for the reason that there has been nofighting. It is described here as being for Allåh and for the Messenger, the near of kin, theorphans, the needy and the wayfarer. From this it will be seen that the whole of it was tobe distributed in exactly the same manner as the one-fifth of the ghanßmah, for which see8:41a. A reference to that note will show that the Prophet’s share was for the benefit ofthe Muslims. Bd states that there are three different opinions as to the Prophet’s shareafter his death. According to one it should go to the Imåm or the head; according to a second, it should be spent on the army and the fortification of the boundaries; and accordingto a third, it is for the benefit of the Muslims in general. The lives of the Holy Prophet andhis earlier successors — a conqueror like ‘Umar, before whom, wearing patched clothes,was brought all the hoarded wealth of Persia and Syria — are a sufficient testimony thatthe Prophet’s share was always spent for the benefit of the Muslims. In fact, this sharewas considered as a part of the Bait al-Mål, the public treasury, for when, after the HolyProphet’s death, his daughter FåΔimah claimed a share of Fidk, which was also a part offai’, Ab∂ Bakr refused it on the ground that it was not the personal property of the HolyProphet, and he decided in fact that a prophet does not leave any property to be inheritedby his heirs. The feud which thus arose has rent the Muslim world into two great schools.The prohibition contained in the words so that it be not taken by turns by the rich amongyou is directed against the Prophet’s share being inherited at all.It may be added that under modern conditions when the soldiers are paid by theState, all spoils of war may be treated as fai’.\n\n8a. It should be noted that the Refugees in general did not receive any share of thisproperty: it was only to the poor among them that something was given for maintenance,the reason for which is clearly stated in the verse, viz., they had lost everything and hadto leave their homes as well as their property. It is necessary to remember, moreover,that one of the important heads of expenditure in the Bait al-Mål was the help of thepoor and those who were unable to earn their own livelihood. It was under that head thatthe Refugees who had lost all their wealth and homes and were still so poor that theycould not carry on any business of their own, were to receive anything from what theBanß Na˙ßr left, all of which formed part of the public treasury.\n\n9a. By those who made their abode in the City and in faith are meant the An©år orthe Helpers, i.e., the Muslim residents of Madßnah. Dår means a house or a mansion aswell as a country, or a city or a town or village (LL), and with the article al, al-Dårmeans al-Madßnah or the City of the Prophet (LL). The meaning is that they made anabode in the city of the Prophet and the faith; the faith being likened to a place of abode.Before them signifies before their (i.e., the Refugees’) coming to Madßnah.When the Muslims fled from Makkah, they found a refuge in Madßnah, where theMuslim inhabitants received them as if they were their brothers, lodging them in theirown houses, and many of them were still living in the houses of their benefactors, whenthe banishment of the Banß Na˙ßr took place. On this the Holy Prophet asked the Helpersto consent to one of two proposals, i.e., to have a share of what was acquired from theBanß Na˙ßr and give part of their houses and wealth to the Refugees, or to let the (poor)Refugees alone have a share in that property, so that with it they might build their houses and make a start in some business or trade. The An©år replied that they were willingthat the Refugees alone should have a share, and, notwithstanding that, they might continue to lodge in their houses (Rz).\n\n10a. This verse contains two directions for all future Muslim generations, viz., topray for the forgiveness of earlier generations that have passed away before them and topray for their hearts to be free from all spite towards their living Muslim brethren.\n\n11a. The hypocrites deceived the Jews with false promises, and thus encouragedthem to fight against the Prophet.\n\n15a. According to some, this description applies to the Banß Qainuqå‘, and according to others, to the Quraish slain on the field of Badr.\n\n22a. From this verse to the end we have a most beautiful collection of the Divinenames."
    }
  ]
}
