{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ الْمَلِكِ الْقُدُّوسِ الْعَزِيزِ الْحَكِيمِ",
      "verseStringB": "Whatever is in the heavens and whatever is in the earth glorifies Allāh, the King, the Holy, the Mighty, the Wise."
    },
    {
      "verseNumber": 2,
      "verseString": "هُوَ الَّذِي بَعَثَ فِي الْأُمِّيِّينَ رَسُولًا مِنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِهِ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَإِنْ كَانُوا مِنْ قَبْلُ لَفِي ضَلَالٍ مُبِينٍ",
      "verseStringB": "He it is Who raised among the illiteratesa a Messenger from among themselves, who recites to them His messages and purifies them, and teaches them the Book and the Wisdom — although they were before certainly in manifest error —"
    },
    {
      "verseNumber": 3,
      "verseString": "وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا بِهِمْ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "And others from among them who have not yet joined them. And He is the Mighty, the Wise.ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "ذَٰلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ ۚ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ",
      "verseStringB": "That is Allāh’s grace; He grants it to whom He pleases. And Allāh is the Lord of mighty grace."
    },
    {
      "verseNumber": 5,
      "verseString": "مَثَلُ الَّذِينَ حُمِّلُوا التَّوْرَاةَ ثُمَّ لَمْ يَحْمِلُوهَا كَمَثَلِ الْحِمَارِ يَحْمِلُ أَسْفَارًا ۚ بِئْسَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِ اللَّهِ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ",
      "verseStringB": "The likeness of those who were charged with the Torah, then they observed it not, is as the likeness of the ass carrying books. Evil is the likeness of the people who reject the messages of Allāh. And Allāh guides not the iniquitous people."
    },
    {
      "verseNumber": 6,
      "verseString": "قُلْ يَا أَيُّهَا الَّذِينَ هَادُوا إِنْ زَعَمْتُمْ أَنَّكُمْ أَوْلِيَاءُ لِلَّهِ مِنْ دُونِ النَّاسِ فَتَمَنَّوُا الْمَوْتَ إِنْ كُنْتُمْ صَادِقِينَ",
      "verseStringB": "Say: O you who are Jews, if you think that you are the favourites of Allāh to the exclusion of other people, then invoke death, if you are truthful.ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "وَلَا يَتَمَنَّوْنَهُ أَبَدًا بِمَا قَدَّمَتْ أَيْدِيهِمْ ۚ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ",
      "verseStringB": "But they will never invoke it because of what their hands have sent before. And Allāh is Knower of the wrongdoers."
    },
    {
      "verseNumber": 8,
      "verseString": "قُلْ إِنَّ الْمَوْتَ الَّذِي تَفِرُّونَ مِنْهُ فَإِنَّهُ مُلَاقِيكُمْ ۖ ثُمَّ تُرَدُّونَ إِلَىٰ عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ",
      "verseStringB": "Say: The death from which you flee, that will surely overtake you; then you will be sent back to the Knower of the unseen and the seen, so He will inform you of that which you did."
    },
    {
      "verseNumber": 9,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نُودِيَ لِلصَّلَاةِ مِنْ يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَىٰ ذِكْرِ اللَّهِ وَذَرُوا الْبَيْعَ ۚ ذَٰلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ",
      "verseStringB": "O you who believe, when the call is sounded for prayer on Friday, hasten to the remembrance of Allāh and leave off traffic. That is better for you, if you know.ᵃ"
    },
    {
      "verseNumber": 10,
      "verseString": "فَإِذَا قُضِيَتِ الصَّلَاةُ فَانْتَشِرُوا فِي الْأَرْضِ وَابْتَغُوا مِنْ فَضْلِ اللَّهِ وَاذْكُرُوا اللَّهَ كَثِيرًا لَعَلَّكُمْ تُفْلِحُونَ",
      "verseStringB": "But when the prayer is ended, disperse abroad in the land and seek of Allāh’s grace, and remember Allāh much, that you may be successful."
    },
    {
      "verseNumber": 11,
      "verseString": "وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا ۚ قُلْ مَا عِنْدَ اللَّهِ خَيْرٌ مِنَ اللَّهْوِ وَمِنَ التِّجَارَةِ ۚ وَاللَّهُ خَيْرُ الرَّازِقِينَ",
      "verseStringB": "And when they see merchandise or sport, they break away to it, and leave thee standing.ᵃ Say: What is with Allāh is better than sport and merchandise. And Allāh is the best of Providers."
    }
  ],
  "nameEnglish": "Friday",
  "nameTrans": "al-Jumu'ah",
  "nameArabic": "الـجـمـعـة",
  "chapterNumber": 62,
  "nVerses": 11,
  "footnotes": [
    {
      "note": "2a. For the word Ummß, see 2:78a, 7:157a.\n\n3a. Ab∂ Hurairah says: “We were sitting with the Holy Prophet when the chapterentitled al-Jumu‘ah was revealed to him, and in it the words others from among themwho have not yet joined them. I asked the Holy Prophet: ‘Who are these?’ He gave noreply until I questioned him thrice. Salmån, the Persian, was sitting among us, and theHoly Prophet placed his hand on Salmån, and said, ‘Even if faith were near the Pleiades,a man from among these would surely find it’.” (B. 65:62, 1). This report would showthat the verse applies to a man of Persian descent. As other reports show that theMessiah would appear among the Muslims at a time when they would have the letter ofthe law with them but would not be true to its spirit, the reference in the report givenhere is particularly to the Messiah or to his time. The significance is that after a time,when the true spirit of Islåm should have been lost, a man would be raised who, againreceiving the light from the Holy Prophet, would spread the light of Islåm in the world.But some commentators understand that non-Arabs, or all Muslims coming after theProphet, are meant (Rz, JB). The Prophet would thus be the teacher forever, through hisdisciples, and no Israelite prophet would be sent as a teacher to the Muslim community.\n\n6a. The prayer for death spoken of here is the same as that in 2:94, for which see2:94a.\n\n9a. The word Jumu‘ah is derived from jama‘a, he gathered, and yaum al-Jumu‘ahmeans the day of Congregation. The time of the Jumu‘ah is just after noon, and the service, which consists only of two rak‘ahs instead of the four rak‘ahs of the early afternoonprayer, is preceded by a sermon. The words of this verse and those of the following showthat ordinary business may be carried on by a Muslim on Friday before or after theJumu‘ah prayer. Hence, unlike the Jewish and the Christian Sabbaths, it is not necessarilya day of rest. But attendance at the Jumu‘ah prayers is obligatory, and as soon as the call toprayer is sounded, every Muslim is bound to leave business of every kind and immediatelyhasten to the mosque. Every nation has a Sabbath, or a so-called day of Divine service setapart from the ordinary weekdays, but in practice, the whole day is never given to prayer.In fact, a Muslim, who is allowed to do his ordinary work on Friday, gives more time tohis prayers than the majority of those who recognize a seventh day as their Sabbath. Theidea underlying the Sabbath is, no doubt, a temporary cessation of the material and physical activities, to give place to spiritual exercise and to holding communion with the DivineBeing. Islåm, on the other hand, requires communion with the Divine Being to beobserved throughout the entire week, five times daily. Thus it gives a real chance to its followers for the exercise and development of the spiritual faculties, which in others lie quitedormant. The Islamic division of prayers is much more suited to elevate a man spiritually,affording true spiritual food to the soul than is to be discovered in any other form of worship.\n\n11a. Those spoken of here are apparently the hypocrites. The fact that the next chapter deals with the hypocrites corroborates this."
    }
  ]
}
