{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "يَا أَيُّهَا النَّبِيُّ إِذَا طَلَّقْتُمُ النِّسَاءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحْصُوا الْعِدَّةَ ۖ وَاتَّقُوا اللَّهَ رَبَّكُمْ ۖ لَا تُخْرِجُوهُنَّ مِنْ بُيُوتِهِنَّ وَلَا يَخْرُجْنَ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ ۚ وَتِلْكَ حُدُودُ اللَّهِ ۚ وَمَنْ يَتَعَدَّ حُدُودَ اللَّهِ فَقَدْ ظَلَمَ نَفْسَهُ ۚ لَا تَدْرِي لَعَلَّ اللَّهَ يُحْدِثُ بَعْدَ ذَٰلِكَ أَمْرًا",
      "verseStringB": "O Prophet, when you divorce women, divorce them for their prescribed period,ᵃ and calculate the period; and keep your duty to Allāh, your Lord. Turn them not out of their houses — nor should they themselves go forth — unless they commit an open indecency. And these are the limits of Allāh. And whoever goes beyond the limits of Allāh, he indeed wrongs his own soul. Thou knowest not that Allāh may after that bring about an event.ᵇ"
    },
    {
      "verseNumber": 2,
      "verseString": "فَإِذَا بَلَغْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَوْ فَارِقُوهُنَّ بِمَعْرُوفٍ وَأَشْهِدُوا ذَوَيْ عَدْلٍ مِنْكُمْ وَأَقِيمُوا الشَّهَادَةَ لِلَّهِ ۚ ذَٰلِكُمْ يُوعَظُ بِهِ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ۚ وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مَخْرَجًا",
      "verseStringB": "So when they have reached their prescribed time, retain them with kindness or dismiss them with kindness, and call to witness two just ones from among you, and give upright testimony for Allāh. With that is admonished he who believes in Allāh and the Latter Day. And whoever keeps his duty to Allāh, He ordains a way out for him,"
    },
    {
      "verseNumber": 3,
      "verseString": "وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ ۚ إِنَّ اللَّهَ بَالِغُ أَمْرِهِ ۚ قَدْ جَعَلَ اللَّهُ لِكُلِّ شَيْءٍ قَدْرًا",
      "verseStringB": "And gives him sustenance from whence he imagines not. And whoever trusts in Allāh, He is sufficient for him. Surely Allāh attains His purpose. Allāh indeed has appointed a measure for everything."
    },
    {
      "verseNumber": 4,
      "verseString": "وَاللَّائِي يَئِسْنَ مِنَ الْمَحِيضِ مِنْ نِسَائِكُمْ إِنِ ارْتَبْتُمْ فَعِدَّتُهُنَّ ثَلَاثَةُ أَشْهُرٍ وَاللَّائِي لَمْ يَحِضْنَ ۚ وَأُولَاتُ الْأَحْمَالِ أَجَلُهُنَّ أَنْ يَضَعْنَ حَمْلَهُنَّ ۚ وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مِنْ أَمْرِهِ يُسْرًا",
      "verseStringB": "And those of your women who despair of menstruation, if you have a doubt, their prescribed time is three months, and of those, too, who have not had their courses. And the pregnant women, their prescribed time is that they lay down their burden. And whoever keeps his duty to Allāh, He makes his affair easy for him."
    },
    {
      "verseNumber": 5,
      "verseString": "ذَٰلِكَ أَمْرُ اللَّهِ أَنْزَلَهُ إِلَيْكُمْ ۚ وَمَنْ يَتَّقِ اللَّهَ يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُعْظِمْ لَهُ أَجْرًا",
      "verseStringB": "That is the command of Allāh, which He has revealed to you. And whoever keeps his duty to Allāh, He will remove from him his evils and give him a big reward."
    },
    {
      "verseNumber": 6,
      "verseString": "أَسْكِنُوهُنَّ مِنْ حَيْثُ سَكَنْتُمْ مِنْ وُجْدِكُمْ وَلَا تُضَارُّوهُنَّ لِتُضَيِّقُوا عَلَيْهِنَّ ۚ وَإِنْ كُنَّ أُولَاتِ حَمْلٍ فَأَنْفِقُوا عَلَيْهِنَّ حَتَّىٰ يَضَعْنَ حَمْلَهُنَّ ۚ فَإِنْ أَرْضَعْنَ لَكُمْ فَآتُوهُنَّ أُجُورَهُنَّ ۖ وَأْتَمِرُوا بَيْنَكُمْ بِمَعْرُوفٍ ۖ وَإِنْ تَعَاسَرْتُمْ فَسَتُرْضِعُ لَهُ أُخْرَىٰ",
      "verseStringB": "Lodge them where you live according to your means, and injure them not to straiten them. And if they are pregnant, spend on them until they lay down their burden. Then if they suckle for you, give them their recompense, and enjoin one another to do good; and if you disagree, another will suckle for him."
    },
    {
      "verseNumber": 7,
      "verseString": "لِيُنْفِقْ ذُو سَعَةٍ مِنْ سَعَتِهِ ۖ وَمَنْ قُدِرَ عَلَيْهِ رِزْقُهُ فَلْيُنْفِقْ مِمَّا آتَاهُ اللَّهُ ۚ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا مَا آتَاهَا ۚ سَيَجْعَلُ اللَّهُ بَعْدَ عُسْرٍ يُسْرًا",
      "verseStringB": "Let him who has abundance spend out of his abundance, and whoever has his means of subsistence straitened to him, let him spend out of that which Allāh has given him. Allāh lays not on any soul a burden beyond that which He has given it. Allāh brings about ease after difficulty.ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "وَكَأَيِّنْ مِنْ قَرْيَةٍ عَتَتْ عَنْ أَمْرِ رَبِّهَا وَرُسُلِهِ فَحَاسَبْنَاهَا حِسَابًا شَدِيدًا وَعَذَّبْنَاهَا عَذَابًا نُكْرًا",
      "verseStringB": "And how many a town which rebelled against the commandment of its Lord and His messengers, so We called it to severe account and We chastised it with a stern chastisement!"
    },
    {
      "verseNumber": 9,
      "verseString": "فَذَاقَتْ وَبَالَ أَمْرِهَا وَكَانَ عَاقِبَةُ أَمْرِهَا خُسْرًا",
      "verseStringB": "So it tasted the evil consequences of its conduct, and the end of its affair was perdition."
    },
    {
      "verseNumber": 10,
      "verseString": "أَعَدَّ اللَّهُ لَهُمْ عَذَابًا شَدِيدًا ۖ فَاتَّقُوا اللَّهَ يَا أُولِي الْأَلْبَابِ الَّذِينَ آمَنُوا ۚ قَدْ أَنْزَلَ اللَّهُ إِلَيْكُمْ ذِكْرًا",
      "verseStringB": "Allāh has prepared for them severe chastisement, so keep your duty to Allāh, O men of understanding, who believe. Allāh has indeed sent down to you a Reminder —"
    },
    {
      "verseNumber": 11,
      "verseString": "رَسُولًا يَتْلُو عَلَيْكُمْ آيَاتِ اللَّهِ مُبَيِّنَاتٍ لِيُخْرِجَ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ مِنَ الظُّلُمَاتِ إِلَى النُّورِ ۚ وَمَنْ يُؤْمِنْ بِاللَّهِ وَيَعْمَلْ صَالِحًا يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۖ قَدْ أَحْسَنَ اللَّهُ لَهُ رِزْقًا",
      "verseStringB": "A Messenger who recites to you the clear messages of Allāh, so that he may bring forth those who believe and do good deeds from darkness into light. And whoever believes in Allāh and does good deeds, He will cause him to enter Gardens wherein rivers flow, to abide therein forever. Allāh has indeed given him a goodly sustenance."
    },
    {
      "verseNumber": 12,
      "verseString": "اللَّهُ الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ وَمِنَ الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ لِتَعْلَمُوا أَنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا",
      "verseStringB": "Allāh is He Who created seven heavens, and of the earth the like thereof.ᵃ The command descends among them, that you may know that Allāh is Possessor of power over all things, and that Allāh encompasses all things in (His) knowledge."
    }
  ],
  "nameEnglish": "Divorce",
  "nameTrans": "at-Talaq",
  "nameArabic": "الـطلاق",
  "chapterNumber": 65,
  "nVerses": 12,
  "footnotes": [
    {
      "note": "1a. The prescribed time is ordinarily, according to 2:228, three courses. But in thecase of women with child, and in certain other cases, the prescribed time is laid down inv. 4 of this chapter. It should be noted how every direction in connection with the subjectof divorce is followed by the injunction, keep your duty to Allåh, throughout this chapter.The utmost carefulness must therefore be exercised in the matter of divorce. Divorce isallowed but the right must be used sparingly and under exceptional circumstances.It is reported that the directions contained in this chapter were needed to correct amistake made in connection with the law of divorce by Ibn ‘Umar, who divorced hiswife when she had her courses. He was told to take her back, as divorce was ineffectiveunless pronounced when the wife was free from the menses (B. 68:1).\n\n1b. The amr or event here means reunion (JB). We are here expressly told that adivorced woman is not to be turned out of the husband’s house, because either partymay regret the divorce and a reunion may be brought about.\n\n7a. Women should be lodged where a man himself lives, so that, after divorce, thewoman has the full status of a wife so long as the ‘iddah (the prescribed time) has notexpired. If a man possesses abundant wealth, he must spend on his wife abundantly.\n\n12a. The statement made here that there are “seven heavens and of the earth the likethereof” throws light upon what is meant by heavens where the number seven is mentioned. The seven heavens are elsewhere called the seven ways (23:17) and the sevenearths may therefore be the seven major planets of the solar system, the earth itself beingthe eighth, their orbits being spoken of as the seven heavens or seven ways. It should,however, be borne in mind that the heavens are often referred to without a limitation ofnumber, and include the whole of the starry creation. Another point worth noting is thatthe mention of seven heavens does not preclude the existence of more. For the application of the word seven and for further discussion, see 2:29b.The descending of the command among these is interpreted by Mjd as meaning theexistence of life and death in them (Rz)."
    }
  ]
}
