{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ ۖ تَبْتَغِي مَرْضَاتَ أَزْوَاجِكَ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ",
      "verseStringB": "O Prophet, why dost thou forbid (thyself) that which Allāh has made lawful for thee? Seekest thou to please thy wives? And Allāh is Forgiving, Merciful.ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "قَدْ فَرَضَ اللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ ۚ وَاللَّهُ مَوْلَاكُمْ ۖ وَهُوَ الْعَلِيمُ الْحَكِيمُ",
      "verseStringB": "Allāh indeed has sanctioned for you the expiation of your oaths; and Allāh is your Patron, and He is the Knowing, the Wise.ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "وَإِذْ أَسَرَّ النَّبِيُّ إِلَىٰ بَعْضِ أَزْوَاجِهِ حَدِيثًا فَلَمَّا نَبَّأَتْ بِهِ وَأَظْهَرَهُ اللَّهُ عَلَيْهِ عَرَّفَ بَعْضَهُ وَأَعْرَضَ عَنْ بَعْضٍ ۖ فَلَمَّا نَبَّأَهَا بِهِ قَالَتْ مَنْ أَنْبَأَكَ هَٰذَا ۖ قَالَ نَبَّأَنِيَ الْعَلِيمُ الْخَبِيرُ",
      "verseStringB": "And when the Prophet confided an information to one of his wives — but when she informed (others) of it, and Allāh informed him of it, he made known part of it and passed over part. So when he told her of it, she said: Who informed thee of this? He said: The Knowing, the One Aware, informed me.ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا ۖ وَإِنْ تَظَاهَرَا عَلَيْهِ فَإِنَّ اللَّهَ هُوَ مَوْلَاهُ وَجِبْرِيلُ وَصَالِحُ الْمُؤْمِنِينَ ۖ وَالْمَلَائِكَةُ بَعْدَ ذَٰلِكَ ظَهِيرٌ",
      "verseStringB": "If you both turn to Allāh, then indeed your hearts are inclined (to this); and if you back up one another against him, then surely Allāh is his Patron, and Gabriel and the righteous believers, and the angels after that are the aiders."
    },
    {
      "verseNumber": 5,
      "verseString": "عَسَىٰ رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبْدِلَهُ أَزْوَاجًا خَيْرًا مِنْكُنَّ مُسْلِمَاتٍ مُؤْمِنَاتٍ قَانِتَاتٍ تَائِبَاتٍ عَابِدَاتٍ سَائِحَاتٍ ثَيِّبَاتٍ وَأَبْكَارًا",
      "verseStringB": "Maybe, his Lord, if he divorce you, will give him in your place wives better than you, submissive, faithful, obedient, penitent, adorers, fasters, widows, and virgins.ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا قُوا أَنْفُسَكُمْ وَأَهْلِيكُمْ نَارًا وَقُودُهَا النَّاسُ وَالْحِجَارَةُ عَلَيْهَا مَلَائِكَةٌ غِلَاظٌ شِدَادٌ لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ",
      "verseStringB": "O you who believe, save yourselves and your families from a Fire whose fuel is men and stones; over it are angels, stern and strong. They do not disobey Allāh in that which He commands them, but do as they are commanded."
    },
    {
      "verseNumber": 7,
      "verseString": "يَا أَيُّهَا الَّذِينَ كَفَرُوا لَا تَعْتَذِرُوا الْيَوْمَ ۖ إِنَّمَا تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُونَ",
      "verseStringB": "O you who disbelieve, make no excuses this day. You are rewarded only as you did."
    },
    {
      "verseNumber": 8,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَصُوحًا عَسَىٰ رَبُّكُمْ أَنْ يُكَفِّرَ عَنْكُمْ سَيِّئَاتِكُمْ وَيُدْخِلَكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ يَوْمَ لَا يُخْزِي اللَّهُ النَّبِيَّ وَالَّذِينَ آمَنُوا مَعَهُ ۖ نُورُهُمْ يَسْعَىٰ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ يَقُولُونَ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "O you who believe, turn to Allāh with sincere repentance. It may be your Lord will remove from you your evil and cause you to enter Gardens wherein flow rivers, on the day on which Allāh will not abase the Prophet and those who believe with him. Their light will gleam before them and on their right hands — they will say: Our Lord, make perfect for us our light, and grant us protection; surely Thou art Possessor of power over all things.ᵃ"
    },
    {
      "verseNumber": 9,
      "verseString": "يَا أَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنَافِقِينَ وَاغْلُظْ عَلَيْهِمْ ۚ وَمَأْوَاهُمْ جَهَنَّمُ ۖ وَبِئْسَ الْمَصِيرُ",
      "verseStringB": "O Prophet, strive against the disbelievers and the hypocrites, and remain firm against them, and their abode is hell; and evil is the resort.ᵃ"
    },
    {
      "verseNumber": 10,
      "verseString": "ضَرَبَ اللَّهُ مَثَلًا لِلَّذِينَ كَفَرُوا امْرَأَتَ نُوحٍ وَامْرَأَتَ لُوطٍ ۖ كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتَاهُمَا فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ اللَّهِ شَيْئًا وَقِيلَ ادْخُلَا النَّارَ مَعَ الدَّاخِلِينَ",
      "verseStringB": "Allāh sets forth an example for those who disbelieve — the wife of Noah and the wife of Lot. They were both under two of Our righteous servants, but they acted treacherously towards them, so they availed them naught against Allāh, and it was said: Enter the Fire with those who enter.ᵃ"
    },
    {
      "verseNumber": 11,
      "verseString": "وَضَرَبَ اللَّهُ مَثَلًا لِلَّذِينَ آمَنُوا امْرَأَتَ فِرْعَوْنَ إِذْ قَالَتْ رَبِّ ابْنِ لِي عِنْدَكَ بَيْتًا فِي الْجَنَّةِ وَنَجِّنِي مِنْ فِرْعَوْنَ وَعَمَلِهِ وَنَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ",
      "verseStringB": "And Allāh sets forth an example for those who believe — the wife of Pharaoh, when she said: My Lord, build for me a house with Thee in the Garden and deliver me from Pharaoh and his work, and deliver me from the iniquitous people.ᵃ"
    },
    {
      "verseNumber": 12,
      "verseString": "وَمَرْيَمَ ابْنَتَ عِمْرَانَ الَّتِي أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهِ مِنْ رُوحِنَا وَصَدَّقَتْ بِكَلِمَاتِ رَبِّهَا وَكُتُبِهِ وَكَانَتْ مِنَ الْقَانِتِينَ",
      "verseStringB": "And Mary, the daughter of Amran, who guarded her chastity, so We breathed into him of Our inspiration, and she accepted the truth of the words of her Lord and His Books, and she was of the obedient ones.ᵃ"
    }
  ],
  "nameEnglish": "Prohibition",
  "nameTrans": "at-Tahrim",
  "nameArabic": "الـتحريم",
  "chapterNumber": 66,
  "nVerses": 12,
  "footnotes": [
    {
      "note": "1a. This verse is said to contain a reference to the Prophet’s conjugal relations withMary, the Coptic lady, which, it is alleged, being discovered by his wife Ïaf©ah, theProphet swore not to have anything more to do with her. How far this story is worthy ofcredit may be gathered from the fact that Mary did enjoy the honour of standing in thesame relation to the Prophet as his other wives, and that she gave birth to Ibråhßm, a sonof the Holy Prophet, who died in infancy. Why then should the Prophet’s conjugalrelation with her be regarded with a suspicious eye? Mary was not an Arab lady, andtherefore socially her status may not have been the same as that of the other wives, butso far as her relation with the Holy Prophet was concerned, there was nothing in it of aclandestine nature, and as a son’s mother (Ar. umm walad ) she is ranked equally withthe Holy Prophet’s wives. It is a fact that the Prophet never kept a slave. The case of˝afiyyah illustrates this. She was a prisoner of war and might have been treated as aslave, but from the first she enjoyed the honour of being a wife, and no distinct orseparate treatment was ever accorded to her. Nor does it appear that Mary was evertreated otherwise than as a son’s mother. The story therefore that Ïaf©ah’s discovery ofthe Prophet having conjugal relations with her upset the Prophet to such a degree that heswore not to have anything more to do with her is a pure invention, and the known factsnot only nullify the calumny, but brand it as another of those fables invented byChristian writers who seek to vilify Islåm.Some commentators’ version is that the Holy Prophet had gone in to Mary when heought to have been in Ïaf©ah’s house, but IJ holds that the reference may as well be tothe Prophet’s forbidding himself the company of his wives for a month, or to his havingforbidden himself the use of honey in deference to the wishes of one of his wives; othercommentators are also of the opinion that the reference may be to one of these latterincidents. One of the Christian critics calls the latter incident a “ludicrous story”, whileNoeldeke says that it was probably invented by ‘Å’ishah, the reason given being that shewas chiefly concerned in this quarrel. Strange to say, the reason given is just the opposite of what is held by Noeldeke himself to be true. It was Ïaf©ah that was chiefly concerned in the quarrel, if the story credited by Sale, Muir, and others is to be taken as correct. Again, we do not see what blame rested on either Ïaf©ah or ‘Å’ishah, if that storyis correct, whereas the incident of the honey casts the blame upon both of them. Whyshould ‘Å’ishah herself have invented a story which cast a blame (slight though it be) onher? According to the story of the Christian critics she was blameless. Not only had sheno motive in inventing the story, but she should have been the first person to repudiatethe incident of the honey, if it were false. In fact, it is a proof of the great trustworthinessof the reports relating to the Holy Prophet that ‘Å’ishah herself is found circulating areport which cast blame on her. It shows how scrupulous, how conscientious, and howtrue were the companions in reporting sayings and incidents relating to the life of theHoly Prophet. For the incident is thus narrated by ‘Å’ishah: “The Holy Prophet (peaceand the blessings of Allåh be on him!) used to take honey at Zainab’s house, and Ïaf©ahand I agreed to tell the Prophet that he smelled as if he had taken Maghåf ßr”, whichbeing done, the Holy Prophet, accepting their word, solemnly promised that he wouldtake honey no more.The reference here, however, is to the well-known temporary separation, regardingwhich the Holy Prophet made a vow, and which is actually spoken of as being referredto in these verses by no less an authority than ‘Umar. Bukhårß relates the followingreport of I‘Ab in his commentary on this chapter. I‘Ab was long doubtful as to the twowomen spoken of in this chapter, and, finding himself alone with ‘Umar on a certainday, questioned him about it. I‘Ab tells us that before he had finished the question,‘Umar told him that these were ‘Å’ishah and Ïaf©ah, and then went on to tell him a longstory. ‘Umar told I‘Ab that they did not customarily give women any status in the daysof ignorance, until Allåh revealed concerning them what He revealed in the HolyQur’ån. “One day,” said ‘Umar, “my wife said to me that I should take such and such acourse in such and such an affair”. “It is no concern of yours,” was the curt reply. “Yourdaughter (Ïaf©ah) returns the Prophet answer for answer until he becomes displeased,and yet you do not like me to speak to you in an affair”, was the rejoinder. ‘Umar atonce repaired to Ïaf©ah, and warned her against altercations with the Prophet. “ ‘Å’ishahshould not mislead you in this matter,” was the father’s counsel to the daughter. Then hewent to Umm Salamah, who was equally curt, and told ‘Umar that he had no business tointerfere in matters between the Holy Prophet and his wives. Soon afterwards theProphet separated himself temporarily from all of his wives, swearing not to go to thehouse of anyone of them for a month. News of this being brought to ‘Umar, he immediately went to the Holy Prophet and related what had passed between Ïaf©ah and UmmSalamah and himself, at which the Holy Prophet smiled (B. 46:25).This incident shows clearly that ‘Umar understood this verse to refer to this temporary separation, and the incident being a very well-known one, of which the truth cannotbe doubted, seems to be the real incident referred to in v. 1. A report in IJ further corroborates the view: ‘Å’ishah says that the Messenger of Allåh swore not to go to his wives,so he prohibited himself from having conjugal relations with them. So as regards theoath, he was commanded to expiate it, and as regards the prohibition, it was said to him,“O Prophet, why dost thou forbid thyself that which Allåh has made lawful for thee”(IJ). This report makes it clear that ‘Å’ishah also looked upon the opening words of v. 1as referring to the Prophet’s temporary separation from his wives. It should be furtherborne in mind that the word ta√rßm (inf. n. of tu√arrimu, the word used here), whichgenerally means prohibiting a thing or making it unlawful, is applied in particular to theprohibition of conjugal relations, as was done in ßlå (LA).\n\n2a. The expiation of oaths is sanctioned in 5:89. It should be noted that ßlå, or temporary separation, is mentioned as an introduction to the subject of divorce in 2:226,but it is actually prohibited here. Thus I’Ab is reported to have said to a man who saidthat he had forsworn his wife: Thou liest, for Allåh says, Why dost thou forbid thyselfthat which Allåh has made lawful? (Nas. 27:16).\n\n3a. There is no trustworthy report showing to what particular incident reference ishere made. But as these verses speak of temporary separation which the Prophet resortedto on account of his wives demanding more of worldly comforts (33:28), it is likely thatthis incident was also in connection with temporary separation. From what is related inconnection with this incident, it appears that originally ‘Å’ishah and Ïaf©ah led thisdemand and later on the other wives joined. And when the Prophet on receiving Divinerevelation gave an option to his wives either to remain in his house without more worldly comforts or to part company with him and have the desired comforts, he told ‘Å’ishahnot to take a decision without consulting her parents (B. 46:25). Maybe it was this matter which ‘Å’ishah disclosed to the others, and hence their united decision to remain inthe Prophet’s house with all the worldly privations.\n\n5a. This shows that all those qualifications which are mentioned here were met within the Prophet’s wives. He had been given a choice to divorce any of his wives whom hedid not desire but, when the wives decided not to leave him notwithstanding the extremeausterity of his home life, he did not divorce any of them; see 33:51a.\n\n8a. Paradise is, therefore, not only a place to enjoy the blessings and reap the rewardof one’s previous good deeds, but it is also the starting-point of a never-ceasing spiritualadvancement. The prayer for the perfection of the light is really an unceasing desire forperfection, showing that spiritual progress in that life will be endless. Every stage ofexcellence to which man will attain will seem to be imperfect when compared with thenext stage of progress to which man will aspire. Thus the Holy Qur’ån teaches the principle that the development of man’s faculties, as it takes place in this life, howeverunlimited, is not sealed by finality. The Hereafter is really the starting-point towards animmeasurably wider vista of the realms to be traversed, opening out after death, whenthe soul is liberated from the limitations of its casement of clay. Hence it is also thatthose who have wasted their opportunity in this life shall, under the inevitable law whichmakes every man taste of what he has done, be subjected to a course of treatment for thespiritual diseases which they have brought about with their own hands, and when theeffect of the poison which vitiated their system has been nullified and they are fit to starton the onward journey to the great goal, they will no more be in hell.\n\n9a. The verb translated strive is jåhid, from which is derived the word jihåd, and thecontext shows that by striving is not meant the carrying on of a war, for war was neverproclaimed against the hypocrites, who, in fact, were for all practical purposes treated asMuslims. Therefore, when the Prophet is commanded to carry on a jihåd against the disbelievers and the hypocrites, it is clear that jihåd is something else than mere fighting.\n\n10a. This is an instance of the followers of prophets going against the principles oftheir teachers; therefore, those prophets will not be able to save them.\n\n11a. This is an example of good men who are not yet made free from the bondage ofsin, for which Pharaoh stands here as a typical example; but they ardently desire to berid of sin, striving hard to free themselves from all trammels.\n\n12a. The example of the righteous given in this parable illustrates how Divine inspiration is granted to the perfect ones. The words “We breathed into him of Our inspiration”are remarkable. Evidently the word him (Ar. hi in f ß hi) cannot refer to Mary. The personalpronoun is taken by some commentators to refer to Jesus (Rz); and thus the meaning isthat Mary gave birth to a son who received Divine inspiration. But the reference in the personal pronoun him might as well be to the believer for whom Mary is set as an example,and the object of the change might be to draw attention to the fact that it is really the granting of inspiration to the believer that is meant here and not the breathing of a soul."
    }
  ]
}
