{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "ن ۚ وَالْقَلَمِ وَمَا يَسْطُرُونَ",
      "verseStringB": "(By) the inkstanda and the pen and that which they write!"
    },
    {
      "verseNumber": 2,
      "verseString": "مَا أَنْتَ بِنِعْمَةِ رَبِّكَ بِمَجْنُونٍ",
      "verseStringB": "By the grace of thy Lord thou art not mad.ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "وَإِنَّ لَكَ لَأَجْرًا غَيْرَ مَمْنُونٍ",
      "verseStringB": "And surely thine is a reward never to be cut off.ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِيمٍ",
      "verseStringB": "And surely thou hast sublime morals.ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "فَسَتُبْصِرُ وَيُبْصِرُونَ",
      "verseStringB": "So thou wilt see, and they (too) will see,"
    },
    {
      "verseNumber": 6,
      "verseString": "بِأَيْيِكُمُ الْمَفْتُونُ",
      "verseStringB": "Which of you is mad."
    },
    {
      "verseNumber": 7,
      "verseString": "إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ",
      "verseStringB": "Surely thy Lord knows best who is erring from His way, and He knows best those who go aright."
    },
    {
      "verseNumber": 8,
      "verseString": "فَلَا تُطِعِ الْمُكَذِّبِينَ",
      "verseStringB": "So obey not the rejectors."
    },
    {
      "verseNumber": 9,
      "verseString": "وَدُّوا لَوْ تُدْهِنُ فَيُدْهِنُونَ",
      "verseStringB": "They wish that thou shouldst be pliant, so they (too) would be pliant.ᵃ"
    },
    {
      "verseNumber": 10,
      "verseString": "وَلَا تُطِعْ كُلَّ حَلَّافٍ مَهِينٍ",
      "verseStringB": "And obey not any mean swearer,ᵃ"
    },
    {
      "verseNumber": 11,
      "verseString": "هَمَّازٍ مَشَّاءٍ بِنَمِيمٍ",
      "verseStringB": "Defamer, going about with slander,"
    },
    {
      "verseNumber": 12,
      "verseString": "مَنَّاعٍ لِلْخَيْرِ مُعْتَدٍ أَثِيمٍ",
      "verseStringB": "Hinderer of good, outstepping the limits, sinful,"
    },
    {
      "verseNumber": 13,
      "verseString": "عُتُلٍّ بَعْدَ ذَٰلِكَ زَنِيمٍ",
      "verseStringB": "Ignoble, besides all that, notoriously mischievous —"
    },
    {
      "verseNumber": 14,
      "verseString": "أَنْ كَانَ ذَا مَالٍ وَبَنِينَ",
      "verseStringB": "Because he possesses wealth and sons."
    },
    {
      "verseNumber": 15,
      "verseString": "إِذَا تُتْلَىٰ عَلَيْهِ آيَاتُنَا قَالَ أَسَاطِيرُ الْأَوَّلِينَ",
      "verseStringB": "When Our messages are recited to him, he says: Stories of those of yore!"
    },
    {
      "verseNumber": 16,
      "verseString": "سَنَسِمُهُ عَلَى الْخُرْطُومِ",
      "verseStringB": "We shall brand him on the snout.ᵃ"
    },
    {
      "verseNumber": 17,
      "verseString": "إِنَّا بَلَوْنَاهُمْ كَمَا بَلَوْنَا أَصْحَابَ الْجَنَّةِ إِذْ أَقْسَمُوا لَيَصْرِمُنَّهَا مُصْبِحِينَ",
      "verseStringB": "We shall try them as We tried the owners of the garden, when they swore to pluck its fruits in the morning,ᵃ"
    },
    {
      "verseNumber": 18,
      "verseString": "وَلَا يَسْتَثْنُونَ",
      "verseStringB": "And would not set aside a portion (for the poor)."
    },
    {
      "verseNumber": 19,
      "verseString": "فَطَافَ عَلَيْهَا طَائِفٌ مِنْ رَبِّكَ وَهُمْ نَائِمُونَ",
      "verseStringB": "But a visitation from thy Lord came on it, while they slept."
    },
    {
      "verseNumber": 20,
      "verseString": "فَأَصْبَحَتْ كَالصَّرِيمِ",
      "verseStringB": "So it became as black, barren land —"
    },
    {
      "verseNumber": 21,
      "verseString": "فَتَنَادَوْا مُصْبِحِينَ",
      "verseStringB": "Then they called out one to another in the morning,"
    },
    {
      "verseNumber": 22,
      "verseString": "أَنِ اغْدُوا عَلَىٰ حَرْثِكُمْ إِنْ كُنْتُمْ صَارِمِينَ",
      "verseStringB": "Saying: Go early to your tilth, if you would pluck (the fruit)."
    },
    {
      "verseNumber": 23,
      "verseString": "فَانْطَلَقُوا وَهُمْ يَتَخَافَتُونَ",
      "verseStringB": "So they went, while they said one to another in low tones:"
    },
    {
      "verseNumber": 24,
      "verseString": "أَنْ لَا يَدْخُلَنَّهَا الْيَوْمَ عَلَيْكُمْ مِسْكِينٌ",
      "verseStringB": "No poor man shall enter it today upon you."
    },
    {
      "verseNumber": 25,
      "verseString": "وَغَدَوْا عَلَىٰ حَرْدٍ قَادِرِينَ",
      "verseStringB": "And in the morning they went, having the power to prevent."
    },
    {
      "verseNumber": 26,
      "verseString": "فَلَمَّا رَأَوْهَا قَالُوا إِنَّا لَضَالُّونَ",
      "verseStringB": "But when they saw it, they said: Surely we are in error;"
    },
    {
      "verseNumber": 27,
      "verseString": "بَلْ نَحْنُ مَحْرُومُونَ",
      "verseStringB": "Nay, we are made to suffer privation."
    },
    {
      "verseNumber": 28,
      "verseString": "قَالَ أَوْسَطُهُمْ أَلَمْ أَقُلْ لَكُمْ لَوْلَا تُسَبِّحُونَ",
      "verseStringB": "The best of them said: Said I not to you, Why do you not glorify (Allāh)?"
    },
    {
      "verseNumber": 29,
      "verseString": "قَالُوا سُبْحَانَ رَبِّنَا إِنَّا كُنَّا ظَالِمِينَ",
      "verseStringB": "They said: Glory be to our Lord! surely we were unjust."
    },
    {
      "verseNumber": 30,
      "verseString": "فَأَقْبَلَ بَعْضُهُمْ عَلَىٰ بَعْضٍ يَتَلَاوَمُونَ",
      "verseStringB": "Then some of them advanced against others, blaming each other."
    },
    {
      "verseNumber": 31,
      "verseString": "قَالُوا يَا وَيْلَنَا إِنَّا كُنَّا طَاغِينَ",
      "verseStringB": "Said they: O woe to us! Surely we were inordInᵃ te —"
    },
    {
      "verseNumber": 32,
      "verseString": "عَسَىٰ رَبُّنَا أَنْ يُبْدِلَنَا خَيْرًا مِنْهَا إِنَّا إِلَىٰ رَبِّنَا رَاغِبُونَ",
      "verseStringB": "Maybe, our Lord will give us instead one better than it — surely to our Lord we make petition.ᵃ"
    },
    {
      "verseNumber": 33,
      "verseString": "كَذَٰلِكَ الْعَذَابُ ۖ وَلَعَذَابُ الْآخِرَةِ أَكْبَرُ ۚ لَوْ كَانُوا يَعْلَمُونَ",
      "verseStringB": "Such is the chastisement. And certainly the chastisement of the Hereafter is greater, did they but know!ᵃ"
    },
    {
      "verseNumber": 34,
      "verseString": "إِنَّ لِلْمُتَّقِينَ عِنْدَ رَبِّهِمْ جَنَّاتِ النَّعِيمِ",
      "verseStringB": "Surely the dutiful have with their Lord Gardens of bliss."
    },
    {
      "verseNumber": 35,
      "verseString": "أَفَنَجْعَلُ الْمُسْلِمِينَ كَالْمُجْرِمِينَ",
      "verseStringB": "Shall We then make those who submit as the guilty?"
    },
    {
      "verseNumber": 36,
      "verseString": "مَا لَكُمْ كَيْفَ تَحْكُمُونَ",
      "verseStringB": "What is the matter with you? How do you judge?"
    },
    {
      "verseNumber": 37,
      "verseString": "أَمْ لَكُمْ كِتَابٌ فِيهِ تَدْرُسُونَ",
      "verseStringB": "Or have you a book wherein you read"
    },
    {
      "verseNumber": 38,
      "verseString": "إِنَّ لَكُمْ فِيهِ لَمَا تَخَيَّرُونَ",
      "verseStringB": "That you shall surely have therein what you choose?"
    },
    {
      "verseNumber": 39,
      "verseString": "أَمْ لَكُمْ أَيْمَانٌ عَلَيْنَا بَالِغَةٌ إِلَىٰ يَوْمِ الْقِيَامَةِ ۙ إِنَّ لَكُمْ لَمَا تَحْكُمُونَ",
      "verseStringB": "Or have you covenants from Us on oath, extending to the day of Resurrection, that yours is surely what you judge?"
    },
    {
      "verseNumber": 40,
      "verseString": "سَلْهُمْ أَيُّهُمْ بِذَٰلِكَ زَعِيمٌ",
      "verseStringB": "Ask them which of them will vouch for that."
    },
    {
      "verseNumber": 41,
      "verseString": "أَمْ لَهُمْ شُرَكَاءُ فَلْيَأْتُوا بِشُرَكَائِهِمْ إِنْ كَانُوا صَادِقِينَ",
      "verseStringB": "Or have they associate-gods? Then let them bring their associates, if they are truthful."
    },
    {
      "verseNumber": 42,
      "verseString": "يَوْمَ يُكْشَفُ عَنْ سَاقٍ وَيُدْعَوْنَ إِلَى السُّجُودِ فَلَا يَسْتَطِيعُونَ",
      "verseStringB": "On the day when there is a severe affliction, and they are called upon to prostrate themselves, but they are not ablea —"
    },
    {
      "verseNumber": 43,
      "verseString": "خَاشِعَةً أَبْصَارُهُمْ تَرْهَقُهُمْ ذِلَّةٌ ۖ وَقَدْ كَانُوا يُدْعَوْنَ إِلَى السُّجُودِ وَهُمْ سَالِمُونَ",
      "verseStringB": "Their looks cast down, abasement will cover them. And they were indeed called upon to prostrate themselves, while yet they were safe."
    },
    {
      "verseNumber": 44,
      "verseString": "فَذَرْنِي وَمَنْ يُكَذِّبُ بِهَٰذَا الْحَدِيثِ ۖ سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ",
      "verseStringB": "So leave Me alone with him who rejects this announcement. We shall overtake them by degrees, from whence they know not."
    },
    {
      "verseNumber": 45,
      "verseString": "وَأُمْلِي لَهُمْ ۚ إِنَّ كَيْدِي مَتِينٌ",
      "verseStringB": "And I bear with them, surely My plan is firm.ᵃ"
    },
    {
      "verseNumber": 46,
      "verseString": "أَمْ تَسْأَلُهُمْ أَجْرًا فَهُمْ مِنْ مَغْرَمٍ مُثْقَلُونَ",
      "verseStringB": "Or dost thou ask from them a reward, so that they are burdened with debt?"
    },
    {
      "verseNumber": 47,
      "verseString": "أَمْ عِنْدَهُمُ الْغَيْبُ فَهُمْ يَكْتُبُونَ",
      "verseStringB": "Or is the unseen with them so that they write (it) down?ᵃ"
    },
    {
      "verseNumber": 48,
      "verseString": "فَاصْبِرْ لِحُكْمِ رَبِّكَ وَلَا تَكُنْ كَصَاحِبِ الْحُوتِ إِذْ نَادَىٰ وَهُوَ مَكْظُومٌ",
      "verseStringB": "So wait patiently for the judgment of thy Lord, and be not like the Companion of the fish, when he cried while he was in distress.ᵃ"
    },
    {
      "verseNumber": 49,
      "verseString": "لَوْلَا أَنْ تَدَارَكَهُ نِعْمَةٌ مِنْ رَبِّهِ لَنُبِذَ بِالْعَرَاءِ وَهُوَ مَذْمُومٌ",
      "verseStringB": "Had not favour from his Lord reached him, he would certainly have been cast down on naked ground, while he was blamed."
    },
    {
      "verseNumber": 50,
      "verseString": "فَاجْتَبَاهُ رَبُّهُ فَجَعَلَهُ مِنَ الصَّالِحِينَ",
      "verseStringB": "Then his Lord chose him, and He made him of the righteous."
    },
    {
      "verseNumber": 51,
      "verseString": "وَإِنْ يَكَادُ الَّذِينَ كَفَرُوا لَيُزْلِقُونَكَ بِأَبْصَارِهِمْ لَمَّا سَمِعُوا الذِّكْرَ وَيَقُولُونَ إِنَّهُ لَمَجْنُونٌ",
      "verseStringB": "And those who disbelieve would almost smite thee with their eyes when they hear the Reminder, and they say: Surely he is mad!ᵃ"
    },
    {
      "verseNumber": 52,
      "verseString": "وَمَا هُوَ إِلَّا ذِكْرٌ لِلْعَالَمِينَ",
      "verseStringB": "And it is naught but a Reminder for the nations."
    }
  ],
  "nameEnglish": "The Pen",
  "nameTrans": "al-Qalam",
  "nameArabic": "الـقـلـم",
  "chapterNumber": 68,
  "nVerses": 52,
  "footnotes": [
    {
      "note": "1a. N∂n is not an abbreviation, but a word meaning inkstand. There is the authority ofthe earliest commentators that the letter n∂n here stands for the word n∂n, for both Ïasanand Qatådah regard it as meaning inkstand, while I‘Ab considers the meaning to be fish.The context, which mentions the pen and writing, clearly favours the former interpretation.Rodwell’s note here, that “the meaning of this, and of the similar symbols throughoutthe Qur’ån, was unknown to the Muhammadans themselves even in the first century”,shows a lamentable ignorance on the part of a translator of the Holy Qur’ån. The abbreviations in the beginning of chapters are in many cases explained by the companions of theHoly Prophet, Ibn ‘Abbås being the chief authority. But here the Holy Qur’ån itself, in thevery first abbreviation used in it, gives us a clue to the significance of the abbreviationsused in it by giving an abbreviation n∂n, which is also a significant word.\n\n2a. The first allegation of the disbelieving Makkans against the Holy Prophet wasthat he was majn∂n, i.e., mad, and this allegation is dealt with in this chapter. The firstanswer to it is contained in the first two verses. By mentioning the inkstand and the penand that which they write, attention is really called to the fact that the Prophet’s prophecies about his own future and the fate of the opponents, which were already put down inwriting, would prove that the Prophet was not mad, for the ravings of a madman couldnot bear fruit. It should be noted that the Holy Qur’ån again and again challenges itsopponents to write down their prophecies about the Holy Prophet, thus showing that itsown were actually written down from the first; and thus this chapter, which is one of theearliest, conclusively establishes the truth that every revelation of the Holy Qur’ån wasput down in writing as soon as it was communicated to the Prophet. For the assertionmade here see v. 47, and 52:41: “or possess they the unseen, so they write (it) down”.But the words have a wider significance, indicating that the Qur’ån will always continue to occupy a unique position among all the books which are ever written. Thisunique position consists in its completeness and exhaustive dealing with all the truthsabout religion, so that every religious truth is found within its covers; see 25:33a.\n\n3a. The Prophet is further told that his exertions will be followed by a reward whichwill never be cut off, i.e., he will be successful in establishing a religion whose blessingswill continue forever, while a madman’s actions cannot bear any fruit. Thus there is notonly a clear prophecy here of the final triumph of the Prophet over his enemies, but there isalso a prophecy that what is stated in the Qur’ån rests on such a firm foundation that it willnever prove untrue.\n\n4a. The Prophet’s possession of the sublimest morals is a further proof that he cannot be a madman. In fact, he had already won from his contemporaries the recognitionof his sublime morality, inasmuch as he had won the title of al-Amßn, the faithful one.The Arabs, on account of their haughty spirit and tribal and family feuds, could not bowtheir heads to a man who was neither a king, nor the chief of a tribe, nor a great warrior,nor a famous poet. Nor could flattery have been their motive in according an unparalleled honour to a man who would not even mix with them, and led the life almost of arecluse. By calling him al-Amßn, the people expressed their high appreciation of his sublime morality, as if he were the one, and only one, as indicated by prefixing al, whocould be trusted in all matters. His moral greatness was thus testified to by ‘Å’ishah,than whom none was more intimate with the Holy Prophet: His morals are the Qur’ån;meaning that all the pictures of sublime morality depicted by the Holy Qur’ån affordreally a glimpse of the moral greatness of the Prophet.\n\n9a. The first desire of the Quraish was no doubt, owing to their great respect for theHoly Prophet, that he should not condemn their evil deeds in strong language, and thusthey too would not be severe in opposition to him.\n\n10a. The description applies to all leaders of opposition to Truth. As against thesublime morals of the Inviter to Truth, vv. 10–13 describe the low state of morality ofthose who do not care for the moral values of life.\n\n16a. Branding on the snout is equivalent to bringing a man to disgrace which sticksto him (R). KhurΔ∂m signifies really “the proboscis of an elephant (R), or the nose of abeast of prey (T), or a large or an elevated nose” (LL), and the word is here applied tothe nose of a man to indicate its ugliness (R). Some commentators apply this descriptionto Walßd ibn Mughßrah in particular, and take the branding on the snout literally, aprophecy fulfilled in the battle of Badr, where Walßd received a wound on his nose, themark of which remained till his death (Rz).\n\n17a. This is a parable which sets forth the ultimate fate of the opponents. Stated as itis in unmistakable terms, it is one of the earliest prophecies, when opposition to theHoly Prophet had not yet assumed the severity of the later days. It foretells not only thefailure of opposition but shows also that the Prophet’s heart was full of sympathy for thepoor from the very first.\n\n32a. It shows that while the Qur’ån threatened the opponents with punishment, itforetold at the same time that they would accept the Truth ultimately. This happenedabout twenty years afterwards. All their exertions came to naught and their power in theland was frustrated, but they then saw their error, came over to Islåm, and were made therulers of vast kingdoms. Thus their Lord gave them instead one better, because theymade their petition to Him.\n\n33a. The separate mention of the chastisement of the Hereafter is clear evidence thatthe punishment spoken of in the previous verses, which is referred to at the commencementof this verse in the words such is the chastisement, was a punishment which was to overtakethem in this life, and thus to afford a proof of the truth of the chastisement of the Hereafter.\n\n42a. The meaning of kashf ‘ani-l-såq has been explained in 27:44a. I may add herea few words from the commentaries. Bd says: On the day when there is a severe affliction, giving the alternative significance, When the truth of the matter is laid bare. Kfsays: “Kashf ‘ani-l-såq is a proverb signifying the hardness of an affair and the severityof a calamity, and the origin of it is in the fright and the flight and the tucking up of theirgarments by women from their shanks in fleeing, and the disclosing of their anklets”;and then, quoting two pre-Islamic verses as his authority for the statement made, headds: “The words here mean the day when the affair becomes hard and formidable, andthere is neither any laying bare nor a shank”. Ibn Athßr in explaining similar words,occurring in a saying of the Holy Prophet, almost repeats the words of Kf. Rz holds themeaning of al-såq to be al-shiddat, and quotes five verses in support of this.Commentators also differ as to whether this severity will be brought about in thislife or in the life after death, Ab∂ Muslim holding the first opinion, which Rz admits.\n\n45a. They are given respite, but their punishment is sure.\n\n47a. Writing is always mentioned in connection with the knowledge of the unseen,because it is writing alone that makes the truth of a prophecy sure. Such verses are a clearproof that the Qur’ån itself, containing as it did numerous prophecies, was written fromthe first, otherwise a challenge to the opponents in these early revelations to write downthe knowledge of the future which they had through their diviners would be meaningless.\n\n48a. The Prophet Jonah is here called the Companion of the fish, because of theincident mentioned in 37:142.\n\n51a. The chapter ends with exactly the same allegation on the part of the disbelievers as the one with which it opened. And the last verse, and it is naught but a Reminderfor the nations, thus sums up the arguments advanced against that allegation. In fact, thearguments advanced in this chapter are equally true in all ages and for all nations. Notethat even as early as the revelation of this chapter, the Prophet’s message is declared tobe meant for all nations."
    }
  ]
}
