{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "الْحَاقَّةُ",
      "verseStringB": "The sure Truth!"
    },
    {
      "verseNumber": 2,
      "verseString": "مَا الْحَاقَّةُ",
      "verseStringB": "What is the sure Truth?"
    },
    {
      "verseNumber": 3,
      "verseString": "وَمَا أَدْرَاكَ مَا الْحَاقَّةُ",
      "verseStringB": "And what would make thee realize what the sure Truth is?ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "كَذَّبَتْ ثَمُودُ وَعَادٌ بِالْقَارِعَةِ",
      "verseStringB": "Tham∂d and ‘ād called the calamity a lie.ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "فَأَمَّا ثَمُودُ فَأُهْلِكُوا بِالطَّاغِيَةِ",
      "verseStringB": "Then as for Tham∂d, they were destroyed by the severe punishment.ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "وَأَمَّا عَادٌ فَأُهْلِكُوا بِرِيحٍ صَرْصَرٍ عَاتِيَةٍ",
      "verseStringB": "And as for ‘ād, they were destroyed by a roaring, violent wind,"
    },
    {
      "verseNumber": 7,
      "verseString": "سَخَّرَهَا عَلَيْهِمْ سَبْعَ لَيَالٍ وَثَمَانِيَةَ أَيَّامٍ حُسُومًا فَتَرَى الْقَوْمَ فِيهَا صَرْعَىٰ كَأَنَّهُمْ أَعْجَازُ نَخْلٍ خَاوِيَةٍ",
      "verseStringB": "Which He made to prevail against them for seven nights and eight days continuously, so that thou mightest have seen the people therein prostrate as if they were trunks of hollow palmtrees."
    },
    {
      "verseNumber": 8,
      "verseString": "فَهَلْ تَرَىٰ لَهُمْ مِنْ بَاقِيَةٍ",
      "verseStringB": "So canst thou see a remnant of them?"
    },
    {
      "verseNumber": 9,
      "verseString": "وَجَاءَ فِرْعَوْنُ وَمَنْ قَبْلَهُ وَالْمُؤْتَفِكَاتُ بِالْخَاطِئَةِ",
      "verseStringB": "And Pharaoh and those before him and the overthrown cities wrought evil.ᵃ"
    },
    {
      "verseNumber": 10,
      "verseString": "فَعَصَوْا رَسُولَ رَبِّهِمْ فَأَخَذَهُمْ أَخْذَةً رَابِيَةً",
      "verseStringB": "And they disobeyed the messenger of their Lord, so He punished them with a vehement punishment."
    },
    {
      "verseNumber": 11,
      "verseString": "إِنَّا لَمَّا طَغَى الْمَاءُ حَمَلْنَاكُمْ فِي الْجَارِيَةِ",
      "verseStringB": "Surely We carried you in the ship,ᵃ when the water rose high,"
    },
    {
      "verseNumber": 12,
      "verseString": "لِنَجْعَلَهَا لَكُمْ تَذْكِرَةً وَتَعِيَهَا أُذُنٌ وَاعِيَةٌ",
      "verseStringB": "That We might make it a reminder for you, and that the retaining ear might retain it."
    },
    {
      "verseNumber": 13,
      "verseString": "فَإِذَا نُفِخَ فِي الصُّورِ نَفْخَةٌ وَاحِدَةٌ",
      "verseStringB": "So when the trumpet is blown with a single blast,"
    },
    {
      "verseNumber": 14,
      "verseString": "وَحُمِلَتِ الْأَرْضُ وَالْجِبَالُ فَدُكَّتَا دَكَّةً وَاحِدَةً",
      "verseStringB": "And the earth and the mountains are borne away and crushed with one crash —"
    },
    {
      "verseNumber": 15,
      "verseString": "فَيَوْمَئِذٍ وَقَعَتِ الْوَاقِعَةُ",
      "verseStringB": "On that day will the Event come to pass,ᵃ"
    },
    {
      "verseNumber": 16,
      "verseString": "وَانْشَقَّتِ السَّمَاءُ فَهِيَ يَوْمَئِذٍ وَاهِيَةٌ",
      "verseStringB": "And the heaven will be cleft asunder; so that day it will be frail,"
    },
    {
      "verseNumber": 17,
      "verseString": "وَالْمَلَكُ عَلَىٰ أَرْجَائِهَا ۚ وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمَانِيَةٌ",
      "verseStringB": "And the angels will be on its sides. And above them eight will bear that day thy Lord’s Throne of Power.ᵃ"
    },
    {
      "verseNumber": 18,
      "verseString": "يَوْمَئِذٍ تُعْرَضُونَ لَا تَخْفَىٰ مِنْكُمْ خَافِيَةٌ",
      "verseStringB": "On that day you will be exposed to view — no secret of yours will remain hidden.ᵃ"
    },
    {
      "verseNumber": 19,
      "verseString": "فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ فَيَقُولُ هَاؤُمُ اقْرَءُوا كِتَابِيَهْ",
      "verseStringB": "Then as for him who is given his book in his right hand, he will say: Lo! Read my book."
    },
    {
      "verseNumber": 20,
      "verseString": "إِنِّي ظَنَنْتُ أَنِّي مُلَاقٍ حِسَابِيَهْ",
      "verseStringB": "Surely I knew that I should meet my account."
    },
    {
      "verseNumber": 21,
      "verseString": "فَهُوَ فِي عِيشَةٍ رَاضِيَةٍ",
      "verseStringB": "So he will be in a life of bliss,"
    },
    {
      "verseNumber": 22,
      "verseString": "فِي جَنَّةٍ عَالِيَةٍ",
      "verseStringB": "In a lofty Garden,"
    },
    {
      "verseNumber": 23,
      "verseString": "قُطُوفُهَا دَانِيَةٌ",
      "verseStringB": "Its fruits are near.ᵃ"
    },
    {
      "verseNumber": 24,
      "verseString": "كُلُوا وَاشْرَبُوا هَنِيئًا بِمَا أَسْلَفْتُمْ فِي الْأَيَّامِ الْخَالِيَةِ",
      "verseStringB": "Eat and drink pleasantly for that which you sent on before in bygone days."
    },
    {
      "verseNumber": 25,
      "verseString": "وَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِشِمَالِهِ فَيَقُولُ يَا لَيْتَنِي لَمْ أُوتَ كِتَابِيَهْ",
      "verseStringB": "And as for him who is given his book in his left hand — he will say: O would that my book had not been given to me!"
    },
    {
      "verseNumber": 26,
      "verseString": "وَلَمْ أَدْرِ مَا حِسَابِيَهْ",
      "verseStringB": "And I had not known what my account was!"
    },
    {
      "verseNumber": 27,
      "verseString": "يَا لَيْتَهَا كَانَتِ الْقَاضِيَةَ",
      "verseStringB": "O would that (death) had made an end (of me)!ᵃ"
    },
    {
      "verseNumber": 28,
      "verseString": "مَا أَغْنَىٰ عَنِّي مَالِيَهْ ۜ",
      "verseStringB": "My wealth has not availed me."
    },
    {
      "verseNumber": 29,
      "verseString": "هَلَكَ عَنِّي سُلْطَانِيَهْ",
      "verseStringB": "My authority has gone from me."
    },
    {
      "verseNumber": 30,
      "verseString": "خُذُوهُ فَغُلُّوهُ",
      "verseStringB": "Seize him, then fetter him,"
    },
    {
      "verseNumber": 31,
      "verseString": "ثُمَّ الْجَحِيمَ صَلُّوهُ",
      "verseStringB": "Then cast him into the burning Fire,"
    },
    {
      "verseNumber": 32,
      "verseString": "ثُمَّ فِي سِلْسِلَةٍ ذَرْعُهَا سَبْعُونَ ذِرَاعًا فَاسْلُكُوهُ",
      "verseStringB": "Then insert him in a chain the length of which is seventy cubits.ᵃ"
    },
    {
      "verseNumber": 33,
      "verseString": "إِنَّهُ كَانَ لَا يُؤْمِنُ بِاللَّهِ الْعَظِيمِ",
      "verseStringB": "Surely he believed not in Allāh, the Great,"
    },
    {
      "verseNumber": 34,
      "verseString": "وَلَا يَحُضُّ عَلَىٰ طَعَامِ الْمِسْكِينِ",
      "verseStringB": "Nor did he urge the feeding of the poor."
    },
    {
      "verseNumber": 35,
      "verseString": "فَلَيْسَ لَهُ الْيَوْمَ هَاهُنَا حَمِيمٌ",
      "verseStringB": "Therefore he has not here this day a true friend,"
    },
    {
      "verseNumber": 36,
      "verseString": "وَلَا طَعَامٌ إِلَّا مِنْ غِسْلِينٍ",
      "verseStringB": "Nor any food except refuse,ᵃ"
    },
    {
      "verseNumber": 37,
      "verseString": "لَا يَأْكُلُهُ إِلَّا الْخَاطِئُونَ",
      "verseStringB": "Which none but the wrongdoers eat."
    },
    {
      "verseNumber": 38,
      "verseString": "فَلَا أُقْسِمُ بِمَا تُبْصِرُونَ",
      "verseStringB": "But nay! I swear by that which you see,"
    },
    {
      "verseNumber": 39,
      "verseString": "وَمَا لَا تُبْصِرُونَ",
      "verseStringB": "And that which you see not!"
    },
    {
      "verseNumber": 40,
      "verseString": "إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ",
      "verseStringB": "Surely, it is the word of an honoured Messenger,"
    },
    {
      "verseNumber": 41,
      "verseString": "وَمَا هُوَ بِقَوْلِ شَاعِرٍ ۚ قَلِيلًا مَا تُؤْمِنُونَ",
      "verseStringB": "And it is not the word of a poet. Little is it that you believe!"
    },
    {
      "verseNumber": 42,
      "verseString": "وَلَا بِقَوْلِ كَاهِنٍ ۚ قَلِيلًا مَا تَذَكَّرُونَ",
      "verseStringB": "Nor the word of a soothsayer. Little is it that you mind!"
    },
    {
      "verseNumber": 43,
      "verseString": "تَنْزِيلٌ مِنْ رَبِّ الْعَالَمِينَ",
      "verseStringB": "It is a revelation from the Lord of the worlds."
    },
    {
      "verseNumber": 44,
      "verseString": "وَلَوْ تَقَوَّلَ عَلَيْنَا بَعْضَ الْأَقَاوِيلِ",
      "verseStringB": "And if he had fabricated against Us certain sayings,"
    },
    {
      "verseNumber": 45,
      "verseString": "لَأَخَذْنَا مِنْهُ بِالْيَمِينِ",
      "verseStringB": "We would certainly have seized him by the right hand,"
    },
    {
      "verseNumber": 46,
      "verseString": "ثُمَّ لَقَطَعْنَا مِنْهُ الْوَتِينَ",
      "verseStringB": "Then cut off his heart’s vein."
    },
    {
      "verseNumber": 47,
      "verseString": "فَمَا مِنْكُمْ مِنْ أَحَدٍ عَنْهُ حَاجِزِينَ",
      "verseStringB": "And not one of you could have withheld Us from him.ᵃ"
    },
    {
      "verseNumber": 48,
      "verseString": "وَإِنَّهُ لَتَذْكِرَةٌ لِلْمُتَّقِينَ",
      "verseStringB": "And surely it is a Reminder for the dutiful."
    },
    {
      "verseNumber": 49,
      "verseString": "وَإِنَّا لَنَعْلَمُ أَنَّ مِنْكُمْ مُكَذِّبِينَ",
      "verseStringB": "And We certainly know that some of you are rejectors."
    },
    {
      "verseNumber": 50,
      "verseString": "وَإِنَّهُ لَحَسْرَةٌ عَلَى الْكَافِرِينَ",
      "verseStringB": "And it is indeed a (source of) grief to the disbelievers.ᵃ"
    },
    {
      "verseNumber": 51,
      "verseString": "وَإِنَّهُ لَحَقُّ الْيَقِينِ",
      "verseStringB": "And surely it is the certain Truth.ᵃ"
    },
    {
      "verseNumber": 52,
      "verseString": "فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ",
      "verseStringB": "So glorify the name of thy Lord, the incomparably Great."
    }
  ],
  "nameEnglish": "The Reality",
  "nameTrans": "al-Haqqah",
  "nameArabic": "الـحاقـة",
  "chapterNumber": 69,
  "nVerses": 52,
  "footnotes": [
    {
      "note": "3a. Al-√åqqah is derived from the root √åqq, meaning truth, and is interpreted in several ways, in all of which the sense of the root word is present. It is synonymous with √aqßqat,meaning truth or reality (T), or signifies a severe calamity the happening of which is fixedor established (LL). According to Az, al-√åqqah is the hour in which the truth will be triumphant, the reason given being that it is so called because it will overcome everyone whocontends falsely in the matter of the religion of Allåh. The instances given about ‘Åd andTham∂d, and Pharaoh, and the Sodomites, all show that this is the real significance. There isno doubt that a fuller manifestation of the Truth, and of the requital of those who reject it,will take place in the Hereafter, and thus it also means the Resurrection.\n\n4a. Al-qåri‘ah is derived from qar‘, which signifies the striking of one thing overanother (R); hence al-qåri‘ah is the striking calamity or calamity that strikes terror intothe hearts of the people (Rz), and here it signifies the calamity of which ‘Åd andTham∂d were warned, but which they called a lie.\n\n5a. See 7:78a which deals fully with the nature of the punishment by which Tham∂dwas destroyed. As shown there it was an earthquake. Al-Δåghiyah is derived from the rootΔaghå, meaning he exceeded the limit (LL), and means an excessively severe punishment.\n\n9a. The overthrown cities are the cities of Lot; see 11:82, 82a.\n\n11a. The reference is to Noah.\n\n15a. The consequences of this Event are described in 56:3; see 56:1a, where it isshown that the Event, al-Wåqi‘ah, signifies the doom of the opponents in this life, with afull manifestation in the life after death. The passing away of the earth and the mountains and their being crushed, signifies the fall of the small and great men in connectionwith that doom.\n\n17a. The bearing of the Throne of Power on that day by eight is a point attended withsome difficulty. In the first place, above them means above the angels spoken of in theprevious words (Rz). From this we may conclude that the eight bearers of the Throne ofPower either represent something above the angels, or particular angels above the ordinary angels. It is noteworthy that the word thamåniyah, or eight, is not followed by anyword showing who or what these eight are. The commentators generally suppose them tobe angels, but the more cautious among them refrain from even specifying the number.Some say the meaning may be eight thousand, others say eight ranks (Kf). Kf adds: “Andmaybe these eight are from among the spirit or some other creation”. Now the one thingthat should be borne in mind in interpreting such allegorical words is that the DivineBeing Himself is al-Qayy∂m, or the Self-Subsisting by Whom all things subsist (2:255).This being taken as the basis, it is clear that other things are not a support for the DivineBeing, but all created things, whether angels or any beings above angels, subsist by God.Another consideration which helps us in understanding what is meant by these bearers isa saying of the Holy Prophet, reported by all commentators, that at present such bearersare four (Rz, Kf, Bd). Now there are four attributes of the Divine Being which are specially connected with the maintenance of the world. The opening chapter of the HolyQur’ån is, as shown in the preliminary note to that chapter, the essence of the whole ofthe Qur’ån, and that chapter speaks of four attributes of the Divine Being in connectionwith the maintenance of al-‘ålamßn, i.e., the whole of the creation. These attributes arementioned in the names Rabb, Ra√mån, Ra√ßm, and Målik, and a reference to the noteson these four words in the opening chapter will show that these four attributes, providence, beneficence, mercy and requital, are really the chief attributes which bring the creation to perfection and from which all other attributes may be inferred. These four arethus the Personal attributes of the Divine Being which precede all, encompass all, makeall to attain to their goal of perfection and remain after all. Hence these are the four√amalat al-‘arsh, or the bearers of the Throne of Power, so far as this world is concerned.Why are they eight on the day of Resurrection? The other world is a complete, butat the same time a new, manifestation of the spiritual realities of this life. Hence, there isa new manifestation of the four attributes of the Divine Being by which the world subsists, and thus these four attributes become eight on the day of Resurrection. To clear upany misunderstanding I may add that, as Divine attributes are brought into actionthrough the agency of angels, the four or eight attributes that are considered the bearersof the Throne of Power would also be manifested through angels, and in this sense wemay look upon the bearers of the ‘Arsh as being four or eight angels.\n\n18a. This verse speaks clearly of the manifestation of the hidden realities on the dayof Resurrection, referred to in the above note.\n\n23a. These fruits are the manifestation of the fruits of righteous deeds. They are herespoken of as being near so that they are available in this life too.\n\n27a. He would wish that death had made an end of him, it referring to death. Or themeaning may be that this state had been my death, or that the life of the world had nevercome to pass.\n\n32a. It should be noted that in these verses the spiritual torture of this world is represented as a physical punishment in the next. The chain to be put upon the neck, forinstance, represents the desires of this world, which keep a man with his head bent uponthe earth, and it is these desires that will assume the shape of a chain. Similarly, the entanglements of this world shall be seen as chains on the feet. The heart-burnings of this worldwill likewise be clearly seen as flames of burning fire. The wicked one has, in fact, in thisvery world within himself a hell of the passions and inextinguishable desires of this world,and feels the burning of that hell in the failures he encounters. When, therefore, he is castfarther off from his temporal desires and sees an everlasting despair before him, his heartburnings and bitter sighs for his dear desires assume the shape of burning Fire.The casting into a chain of the length of seventy cubits is significant. Man’s limit ofage may as a general rule be fixed at seventy, and a wicked person may live up to that agein his wickedness. He may sometimes even enjoy seventy years, excluding the periods ofchildhood and decrepitude. These seventy years during which he could work with honesty,wisdom and zeal are wasted away only in the entanglements of the world, and in followingsensual passions. He does not try to free himself from the chain of desires, and therefore inthe next world the desires which he indulged in for seventy years will be embodied into achain of seventy cubits length, every cubit representing, as it were, a year.\n\n36a. Literally ghislßn signifies that which is washed off, to which the commentatorsadd from the bodies of the disbelievers. It may be rendered as refuse or filth.\n\n47a. This verse and the three preceding it show that one who fabricates Divine revelation does not prosper. Compare Deut. 18:20, where the prophecy of the advent of aProphet like Moses is followed by the words: “But the prophet which shall presume tospeak a word in My name, which I have not commanded him to speak, or that shall speakin the name of other gods, even that prophet shall die”. Jesus’ words in Matt. 7:19: “Everytree that bringeth not forth good fruit is hewn down and cast into the fire”, after comparinga false prophet with a corrupt tree that does not bring forth good fruit, point to a like effect.\n\n50a. Because the punishment of which it warns them must overtake them.\n\n51a. The √aqq al-yaqßn, true certainty or certain truth of this verse, is the same asal-√åqqah of the opening verse. The ultimate triumph of Truth is a certain truth."
    }
  ]
}
