{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "سَأَلَ سَائِلٌ بِعَذَابٍ وَاقِعٍ",
      "verseStringB": "A questioner asks about the chastisement to befall"
    },
    {
      "verseNumber": 2,
      "verseString": "لِلْكَافِرِينَ لَيْسَ لَهُ دَافِعٌ",
      "verseStringB": "The disbelievers — there is none to avert ita —"
    },
    {
      "verseNumber": 3,
      "verseString": "مِنَ اللَّهِ ذِي الْمَعَارِجِ",
      "verseStringB": "From Allāh, Lord of the ways of Ascent.ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "تَعْرُجُ الْمَلَائِكَةُ وَالرُّوحُ إِلَيْهِ فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ",
      "verseStringB": "To Him ascend the angels and the Spirit in a day the measure of which is fifty thousand years.ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "فَاصْبِرْ صَبْرًا جَمِيلًا",
      "verseStringB": "So be patient with a goodly patience."
    },
    {
      "verseNumber": 6,
      "verseString": "إِنَّهُمْ يَرَوْنَهُ بَعِيدًا",
      "verseStringB": "Surely they see it far off,"
    },
    {
      "verseNumber": 7,
      "verseString": "وَنَرَاهُ قَرِيبًا",
      "verseStringB": "And We see it nigh."
    },
    {
      "verseNumber": 8,
      "verseString": "يَوْمَ تَكُونُ السَّمَاءُ كَالْمُهْلِ",
      "verseStringB": "The day when the heaven is as molten brass,"
    },
    {
      "verseNumber": 9,
      "verseString": "وَتَكُونُ الْجِبَالُ كَالْعِهْنِ",
      "verseStringB": "And the mountains are as wool;"
    },
    {
      "verseNumber": 10,
      "verseString": "وَلَا يَسْأَلُ حَمِيمٌ حَمِيمًا",
      "verseStringB": "And no friend will ask of friend,"
    },
    {
      "verseNumber": 11,
      "verseString": "يُبَصَّرُونَهُمْ ۚ يَوَدُّ الْمُجْرِمُ لَوْ يَفْتَدِي مِنْ عَذَابِ يَوْمِئِذٍ بِبَنِيهِ",
      "verseStringB": "(Though) they are made to see them. The guilty one would fain redeem himself from the chastisement of that day by his children,"
    },
    {
      "verseNumber": 12,
      "verseString": "وَصَاحِبَتِهِ وَأَخِيهِ",
      "verseStringB": "And his wife and his brother,"
    },
    {
      "verseNumber": 13,
      "verseString": "وَفَصِيلَتِهِ الَّتِي تُؤْوِيهِ",
      "verseStringB": "And his kin that gave him shelter,"
    },
    {
      "verseNumber": 14,
      "verseString": "وَمَنْ فِي الْأَرْضِ جَمِيعًا ثُمَّ يُنْجِيهِ",
      "verseStringB": "And all that are in the earth — then deliver him —"
    },
    {
      "verseNumber": 15,
      "verseString": "كَلَّا ۖ إِنَّهَا لَظَىٰ",
      "verseStringB": "By no means! Surely it is a flaming Fire,"
    },
    {
      "verseNumber": 16,
      "verseString": "نَزَّاعَةً لِلشَّوَىٰ",
      "verseStringB": "Plucking out the extremities —"
    },
    {
      "verseNumber": 17,
      "verseString": "تَدْعُو مَنْ أَدْبَرَ وَتَوَلَّىٰ",
      "verseStringB": "It shall claim him who retreats and turns his back,"
    },
    {
      "verseNumber": 18,
      "verseString": "وَجَمَعَ فَأَوْعَىٰ",
      "verseStringB": "And hoards then withholds."
    },
    {
      "verseNumber": 19,
      "verseString": "إِنَّ الْإِنْسَانَ خُلِقَ هَلُوعًا",
      "verseStringB": "Surely man is created impatient —"
    },
    {
      "verseNumber": 20,
      "verseString": "إِذَا مَسَّهُ الشَّرُّ جَزُوعًا",
      "verseStringB": "Fretful when evil afflicts him,"
    },
    {
      "verseNumber": 21,
      "verseString": "وَإِذَا مَسَّهُ الْخَيْرُ مَنُوعًا",
      "verseStringB": "And niggardly when good befalls him —"
    },
    {
      "verseNumber": 22,
      "verseString": "إِلَّا الْمُصَلِّينَ",
      "verseStringB": "Except those who pray,"
    },
    {
      "verseNumber": 23,
      "verseString": "الَّذِينَ هُمْ عَلَىٰ صَلَاتِهِمْ دَائِمُونَ",
      "verseStringB": "Who are constant at their prayer,"
    },
    {
      "verseNumber": 24,
      "verseString": "وَالَّذِينَ فِي أَمْوَالِهِمْ حَقٌّ مَعْلُومٌ",
      "verseStringB": "And in whose wealth there is a known right"
    },
    {
      "verseNumber": 25,
      "verseString": "لِلسَّائِلِ وَالْمَحْرُومِ",
      "verseStringB": "For the beggar and the destitute,"
    },
    {
      "verseNumber": 26,
      "verseString": "وَالَّذِينَ يُصَدِّقُونَ بِيَوْمِ الدِّينِ",
      "verseStringB": "And those who accept the truth of the day of Judgment:"
    },
    {
      "verseNumber": 27,
      "verseString": "وَالَّذِينَ هُمْ مِنْ عَذَابِ رَبِّهِمْ مُشْفِقُونَ",
      "verseStringB": "And those who are fearful of the chastisement of their Lord —"
    },
    {
      "verseNumber": 28,
      "verseString": "إِنَّ عَذَابَ رَبِّهِمْ غَيْرُ مَأْمُونٍ",
      "verseStringB": "Surely the chastisement of their Lord is (a thing) not to be felt secure from —"
    },
    {
      "verseNumber": 29,
      "verseString": "وَالَّذِينَ هُمْ لِفُرُوجِهِمْ حَافِظُونَ",
      "verseStringB": "And those who restrain their sexual passions,"
    },
    {
      "verseNumber": 30,
      "verseString": "إِلَّا عَلَىٰ أَزْوَاجِهِمْ أَوْ مَا مَلَكَتْ أَيْمَانُهُمْ فَإِنَّهُمْ غَيْرُ مَلُومِينَ",
      "verseStringB": "Except in the presence of their mates or those whom their right hands possessa — for such surely are not to be blamed,"
    },
    {
      "verseNumber": 31,
      "verseString": "فَمَنِ ابْتَغَىٰ وَرَاءَ ذَٰلِكَ فَأُولَٰئِكَ هُمُ الْعَادُونَ",
      "verseStringB": "But he who seeks to go beyond this, these are the transgressors."
    },
    {
      "verseNumber": 32,
      "verseString": "وَالَّذِينَ هُمْ لِأَمَانَاتِهِمْ وَعَهْدِهِمْ رَاعُونَ",
      "verseStringB": "And those who are faithful to their trusts and their covenant,"
    },
    {
      "verseNumber": 33,
      "verseString": "وَالَّذِينَ هُمْ بِشَهَادَاتِهِمْ قَائِمُونَ",
      "verseStringB": "And those who are upright in their testimonies,"
    },
    {
      "verseNumber": 34,
      "verseString": "وَالَّذِينَ هُمْ عَلَىٰ صَلَاتِهِمْ يُحَافِظُونَ",
      "verseStringB": "And those who keep a guard on their prayer."
    },
    {
      "verseNumber": 35,
      "verseString": "أُولَٰئِكَ فِي جَنَّاتٍ مُكْرَمُونَ",
      "verseStringB": "These are in Gardens, honoured."
    },
    {
      "verseNumber": 36,
      "verseString": "فَمَالِ الَّذِينَ كَفَرُوا قِبَلَكَ مُهْطِعِينَ",
      "verseStringB": "But what is the matter with those who disbelieve, that they hasten on to thee,ᵃ"
    },
    {
      "verseNumber": 37,
      "verseString": "عَنِ الْيَمِينِ وَعَنِ الشِّمَالِ عِزِينَ",
      "verseStringB": "On the right hand and on the left, in sundry parties?"
    },
    {
      "verseNumber": 38,
      "verseString": "أَيَطْمَعُ كُلُّ امْرِئٍ مِنْهُمْ أَنْ يُدْخَلَ جَنَّةَ نَعِيمٍ",
      "verseStringB": "Does every man of them desire to be admitted to the Garden of bliss?"
    },
    {
      "verseNumber": 39,
      "verseString": "كَلَّا ۖ إِنَّا خَلَقْنَاهُمْ مِمَّا يَعْلَمُونَ",
      "verseStringB": "By no means! Surely We have created them for what they know.ᵃ"
    },
    {
      "verseNumber": 40,
      "verseString": "فَلَا أُقْسِمُ بِرَبِّ الْمَشَارِقِ وَالْمَغَارِبِ إِنَّا لَقَادِرُونَ",
      "verseStringB": "But nay! I swear by the Lord of the Eastern lands and the Western lands! that We are certainly Powerful"
    },
    {
      "verseNumber": 41,
      "verseString": "عَلَىٰ أَنْ نُبَدِّلَ خَيْرًا مِنْهُمْ وَمَا نَحْنُ بِمَسْبُوقِينَ",
      "verseStringB": "To bring in their place (others) better than them, and We shall not be overcome.ᵃ"
    },
    {
      "verseNumber": 42,
      "verseString": "فَذَرْهُمْ يَخُوضُوا وَيَلْعَبُوا حَتَّىٰ يُلَاقُوا يَوْمَهُمُ الَّذِي يُوعَدُونَ",
      "verseStringB": "So leave them alone to plunge in vain talk and to sport, until they come face to face with that day of theirs which they are promised —"
    },
    {
      "verseNumber": 43,
      "verseString": "يَوْمَ يَخْرُجُونَ مِنَ الْأَجْدَاثِ سِرَاعًا كَأَنَّهُمْ إِلَىٰ نُصُبٍ يُوفِضُونَ",
      "verseStringB": "The day when they come forth from the graves in haste, as hastening on to a goal,"
    },
    {
      "verseNumber": 44,
      "verseString": "خَاشِعَةً أَبْصَارُهُمْ تَرْهَقُهُمْ ذِلَّةٌ ۚ ذَٰلِكَ الْيَوْمُ الَّذِي كَانُوا يُوعَدُونَ",
      "verseStringB": "Their eyes cast down, disgrace covering them. Such is the day which they are promised.ᵃ"
    }
  ],
  "nameEnglish": "Ways of Ascent",
  "nameTrans": "al-Ma'arij",
  "nameArabic": "الـمعارج",
  "chapterNumber": 70,
  "nVerses": 44,
  "footnotes": [
    {
      "note": "2a. No particular questioner need be specified. The last chapter speaks in terms ofthe highest certainty of the final triumph of truth and of the doom of the opponents, andthe question, When will it be? was natural. It is repeated very often: “When will thispromise come to pass, if you are truthful?” (36:48; 67:25; &c.).\n\n3a. The Divine Being is here stated to be the Lord of the ways of Ascent as indicating that He grants to the faithful the means of Ascent, or the means of exaltation.Compare 56:3, where the Event is spoken of as abasing, exalting. The means of exaltation of the believers are pointed out further on in vv. 22 –35.\n\n4a. The angels and the Spirit are spoken of here as ascending to God in a day of fiftythousand years. Al-R∂√ or the Spirit very often stands for Divine revelation or Gabriel,who brings the revelation to the Prophet. But here it seems to be a collective name forthe spirits of the faithful, because it is through Divine revelation that a new spirit isawakened in the faithful; see 78:38a. The angels are mentioned along with the faithfulbecause it is through an angel that spiritual life is breathed into man, and he starts life asa spiritual wayfarer. A day of the spiritual advancement of man is spoken of as beingequal to fifty thousand years to show the immense vastness of that advancement. Or, theday of fifty thousand years may be the day of the final triumph of Truth in the world,from the time when revelation was first granted to man.\n\n30a. See 23:5a, 6a.\n\n36a. Nearly the same words — hastening to the Inviter — occur in 54:8; see 54:8a.Here and in the verses that follow is a description of the time when these very opponentswould be hastening on to the Prophet, accepting the truth. V. 38 makes it further clear:Does every man of them desire that he should be made to enter the Garden of bliss?\n\n39a. What is negatived here is the fact that the evildoers can enter the Garden ofbliss. Min in mimmå (originally min må, “for what”) signifies ajal or the end for whichman has been created. It is to rise above sin, to be able to ascend to God, the Lord of theways of Ascent; see 3a. The Garden of bliss stands clearly for the Ascension of man toGod which is the real object of his life.\n\n41a. Note the clear prophecy that an evil generation will be brought to naught andanother people, the righteous, shall inherit the land. The old order will be changed and anew order established instead of that.\n\n44a. Vv. 43 and 44 give us a clear statement as to the final triumph of Truth and theoverthrow of opposition or the triumph of righteousness over the powers of evil. Beingspiritually dead, their very homes were graves in a metaphorical sense. As in almost allchapters of this period, the final triumph of Truth runs along as an undercurrent in themention of Resurrection."
    }
  ]
}
