{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا",
      "verseStringB": "Say: It has been revealed to me that a party of the jinna listened, so they said: Surely we have heard a wonderful Qur’ān,"
    },
    {
      "verseNumber": 2,
      "verseString": "يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ ۖ وَلَنْ نُشْرِكَ بِرَبِّنَا أَحَدًا",
      "verseStringB": "Guiding to the right way — so we believe in it. And we shall not set up anyone with our Lord:"
    },
    {
      "verseNumber": 3,
      "verseString": "وَأَنَّهُ تَعَالَىٰ جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلَا وَلَدًا",
      "verseStringB": "And He — exalted be the majesty of our Lord! — has not taken a consort, nor a son:ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "وَأَنَّهُ كَانَ يَقُولُ سَفِيهُنَا عَلَى اللَّهِ شَطَطًا",
      "verseStringB": "And the foolish among us used to forge extravagant lies against Allāh:"
    },
    {
      "verseNumber": 5,
      "verseString": "وَأَنَّا ظَنَنَّا أَنْ لَنْ تَقُولَ الْإِنْسُ وَالْجِنُّ عَلَى اللَّهِ كَذِبًا",
      "verseStringB": "And we thought that men and jinn did not utter a lie against Allāh:"
    },
    {
      "verseNumber": 6,
      "verseString": "وَأَنَّهُ كَانَ رِجَالٌ مِنَ الْإِنْسِ يَعُوذُونَ بِرِجَالٍ مِنَ الْجِنِّ فَزَادُوهُمْ رَهَقًا",
      "verseStringB": "And persons from among men used to seek refuge with persons from among the jinn, so they increased them in evil doing:ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "وَأَنَّهُمْ ظَنُّوا كَمَا ظَنَنْتُمْ أَنْ لَنْ يَبْعَثَ اللَّهُ أَحَدًا",
      "verseStringB": "And they thought, as you think, that Allāh would not raise anyone:"
    },
    {
      "verseNumber": 8,
      "verseString": "وَأَنَّا لَمَسْنَا السَّمَاءَ فَوَجَدْنَاهَا مُلِئَتْ حَرَسًا شَدِيدًا وَشُهُبًا",
      "verseStringB": "And we sought to reach heaven, but we found it filled with strong guards and flames:ᵃ"
    },
    {
      "verseNumber": 9,
      "verseString": "وَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ ۖ فَمَنْ يَسْتَمِعِ الْآنَ يَجِدْ لَهُ شِهَابًا رَصَدًا",
      "verseStringB": "And we used to sit in some of the sitting-places thereof to steal a hearing. But he who tries to listen now finds a flame lying in wait for him:"
    },
    {
      "verseNumber": 10,
      "verseString": "وَأَنَّا لَا نَدْرِي أَشَرٌّ أُرِيدَ بِمَنْ فِي الْأَرْضِ أَمْ أَرَادَ بِهِمْ رَبُّهُمْ رَشَدًا",
      "verseStringB": "And we know not whether evil is meant for those on earth or whether their Lord means to direct them aright:ᵃ"
    },
    {
      "verseNumber": 11,
      "verseString": "وَأَنَّا مِنَّا الصَّالِحُونَ وَمِنَّا دُونَ ذَٰلِكَ ۖ كُنَّا طَرَائِقَ قِدَدًا",
      "verseStringB": "And some of us are good and others of us are below that — we are sects following different ways:"
    },
    {
      "verseNumber": 12,
      "verseString": "وَأَنَّا ظَنَنَّا أَنْ لَنْ نُعْجِزَ اللَّهَ فِي الْأَرْضِ وَلَنْ نُعْجِزَهُ هَرَبًا",
      "verseStringB": "And we know that we cannot escape Allāh in the earth, nor can we escape Him by flight:"
    },
    {
      "verseNumber": 13,
      "verseString": "وَأَنَّا لَمَّا سَمِعْنَا الْهُدَىٰ آمَنَّا بِهِ ۖ فَمَنْ يُؤْمِنْ بِرَبِّهِ فَلَا يَخَافُ بَخْسًا وَلَا رَهَقًا",
      "verseStringB": "And when we heard the guidance, we believed in it. So whoever believes in his Lord, he fears neither loss nor injustice:"
    },
    {
      "verseNumber": 14,
      "verseString": "وَأَنَّا مِنَّا الْمُسْلِمُونَ وَمِنَّا الْقَاسِطُونَ ۖ فَمَنْ أَسْلَمَ فَأُولَٰئِكَ تَحَرَّوْا رَشَدًا",
      "verseStringB": "And some of us are those who submit, and some of us are deviators. So whoever submits, these aim at the right way."
    },
    {
      "verseNumber": 15,
      "verseString": "وَأَمَّا الْقَاسِطُونَ فَكَانُوا لِجَهَنَّمَ حَطَبًا",
      "verseStringB": "And as to deviators, they are fuel of hell:"
    },
    {
      "verseNumber": 16,
      "verseString": "وَأَنْ لَوِ اسْتَقَامُوا عَلَى الطَّرِيقَةِ لَأَسْقَيْنَاهُمْ مَاءً غَدَقًا",
      "verseStringB": "And if they keep to the (right) way, We would certainly give them to drink of abundant water,ᵃ"
    },
    {
      "verseNumber": 17,
      "verseString": "لِنَفْتِنَهُمْ فِيهِ ۚ وَمَنْ يُعْرِضْ عَنْ ذِكْرِ رَبِّهِ يَسْلُكْهُ عَذَابًا صَعَدًا",
      "verseStringB": "So that We may try them thereby. And whoever turns away from the reminder of his Lord, He will make him enter into an afflicting chastisement:"
    },
    {
      "verseNumber": 18,
      "verseString": "وَأَنَّ الْمَسَاجِدَ لِلَّهِ فَلَا تَدْعُوا مَعَ اللَّهِ أَحَدًا",
      "verseStringB": "And the mosques are Allāh’s, so call not upon anyone with Allāh:"
    },
    {
      "verseNumber": 19,
      "verseString": "وَأَنَّهُ لَمَّا قَامَ عَبْدُ اللَّهِ يَدْعُوهُ كَادُوا يَكُونُونَ عَلَيْهِ لِبَدًا",
      "verseStringB": "And when the Servant of Allāh stood up praying to Him, they wellnigh crowded him (to death).ᵃ"
    },
    {
      "verseNumber": 20,
      "verseString": "قُلْ إِنَّمَا أَدْعُو رَبِّي وَلَا أُشْرِكُ بِهِ أَحَدًا",
      "verseStringB": "Say: I only call upon my Lord, and associate naught with Him."
    },
    {
      "verseNumber": 21,
      "verseString": "قُلْ إِنِّي لَا أَمْلِكُ لَكُمْ ضَرًّا وَلَا رَشَدًا",
      "verseStringB": "Say: I control not evil nor good for you."
    },
    {
      "verseNumber": 22,
      "verseString": "قُلْ إِنِّي لَنْ يُجِيرَنِي مِنَ اللَّهِ أَحَدٌ وَلَنْ أَجِدَ مِنْ دُونِهِ مُلْتَحَدًا",
      "verseStringB": "Say: None can protect me against Allāh, nor can I find any refuge besides Him:"
    },
    {
      "verseNumber": 23,
      "verseString": "إِلَّا بَلَاغًا مِنَ اللَّهِ وَرِسَالَاتِهِ ۚ وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ فَإِنَّ لَهُ نَارَ جَهَنَّمَ خَالِدِينَ فِيهَا أَبَدًا",
      "verseStringB": "(Mine is naught) but to deliver (the command) of Allāh and His messages. And whoever disobeys Allāh and His Messenger, surely for him is the Fire of hell, to abide therein for ages,"
    },
    {
      "verseNumber": 24,
      "verseString": "حَتَّىٰ إِذَا رَأَوْا مَا يُوعَدُونَ فَسَيَعْلَمُونَ مَنْ أَضْعَفُ نَاصِرًا وَأَقَلُّ عَدَدًا",
      "verseStringB": "Till when they see that which they are promised, they will know who is weaker in helpers and less in numbers.ᵃ"
    },
    {
      "verseNumber": 25,
      "verseString": "قُلْ إِنْ أَدْرِي أَقَرِيبٌ مَا تُوعَدُونَ أَمْ يَجْعَلُ لَهُ رَبِّي أَمَدًا",
      "verseStringB": "Say: I know not whether that which you are promised is nigh or if my Lord will appoint for it a distant term."
    },
    {
      "verseNumber": 26,
      "verseString": "عَالِمُ الْغَيْبِ فَلَا يُظْهِرُ عَلَىٰ غَيْبِهِ أَحَدًا",
      "verseStringB": "The Knower of the unseen, so He makes His secrets known to none,"
    },
    {
      "verseNumber": 27,
      "verseString": "إِلَّا مَنِ ارْتَضَىٰ مِنْ رَسُولٍ فَإِنَّهُ يَسْلُكُ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ رَصَدًا",
      "verseStringB": "Except a messenger whom He chooses.ᵃ For surely He makes a guard to go before him and after him,"
    },
    {
      "verseNumber": 28,
      "verseString": "لِيَعْلَمَ أَنْ قَدْ أَبْلَغُوا رِسَالَاتِ رَبِّهِمْ وَأَحَاطَ بِمَا لَدَيْهِمْ وَأَحْصَىٰ كُلَّ شَيْءٍ عَدَدًا",
      "verseStringB": "That He may know that they have truly delivered the messages of their Lord; and He encompasses what is with them, and He keeps account of all things.ᵃ"
    }
  ],
  "nameEnglish": "The Jinn",
  "nameTrans": "al-Jinn",
  "nameArabic": "الجن",
  "chapterNumber": 72,
  "nVerses": 28,
  "footnotes": [
    {
      "note": "1a. The existence of jinn, or ethereal beings like the angels (the former being the spirits of evil and the latter the spirits of good), is a question quite distinct, but it is clear thatthe jinn spoken of here did not belong to this class; see 6:128a for full explanation of theword. The jinn are also referred to in 46:29–31, where they are made to say: “O our people, we have heard a Book revealed after Moses, verifying that which is before it”. Thisshows that they were Jews. The jinn spoken of here are evidently Christians, as v. 3 shows.\n\n3a. The words of this verse are a clear indication that the persons spoken of here areChristians. That both Jews and Christians living outside Arabia accepted the message ofTruth brought by the Prophet is a fact. But from what is stated further on it appears thatthe reference here is to future Christian nations, and the words here are prophetical,speaking of some future time when Christian nations forming the bulk of mankind —such being one of the significances of the word jinn (LL) — will accept the truth of themessage brought by the Prophet. At any rate the prophetical in these words, whetherrelating to the near or distant future, is clearly hinted at in the opening words of thechapter — It has been revealed to me that a party of the jinn listened.\n\n6a. The jinn and men of this verse are undoubtedly the leaders of evil and iniquityand the weaker ones in intellect who followed them blindly; see 6:128a.\n\n8a. By reaching heaven is meant learning secrets of the heaven. The reference may beto the diviners and astrologers among them, for which see 37:7a–10a, but more likely it isa prophetical reference to the great scientific discoveries of the modern age relating to heaven.\n\n10a. These words seem to refer to the great tribulations which are meant to directman’s attention to spiritual truth.\n\n16a. By abundance of water is meant according to Mujåhid abundant wealth (IJ).\n\n19a. The servant of Allåh is the Holy Prophet Mu√ammad.\n\n24a. As a human being left to himself without a friend, without helper, rejected athome and cruelly treated abroad (as he was at Ôå’if, to which period this chapterbelongs), he thus poured out his heart, in this state of utter helplessness: “O Lord, Imake my complaint unto Thee of my helplessness and frailty and of my insignificancebefore mankind. But Thou art the Lord of the poor and feeble, and Thou art my Lord.Into whose hands wilt Thou abandon me? Into the hands of the strangers that beset meround about? Or of the enemy Thou hast given at home to have the mastery over me? . .. I seek for refuge in the light of Thy countenance . . .” (Muir in Life of Muhammad).Now contrast with it the revelation which he received just then, which speaks of theopponents of Truth who would soon be brought low — they will know who is weaker inhelpers and less in numbers. The source of the Holy Prophet’s revelation was other thanhis own heart, for the same heart could not simultaneously vent feelings of utter helplessness and weakness and those of unbounded confidence in his ultimate triumph.\n\n27a. That the overthrow of opposition to the great message of Truth was certain isstated in v. 24. This is followed by a statement in v. 25 that the Prophet did not knowwhether this overthrow would come soon or whether it would come in the distant future,but Truth must triumph. And the law is stated now that God makes known His will, theunseen, the Truth, by His messenger, to convey that Truth to other people. It is God’smessage and it must be delivered in spite of all opposition. The Divine purpose isaccomplished by sending a guard, before and after the messenger, to protect him againstall onslaughts, as is made clear in the words that follow.\n\n28a. Note the firm tone of these revelations under the disheartening circumstancesto which attention has been drawn in 24a. Such words could not proceed from any but aDivine source — the message must be delivered, Allåh encompasses all, nothing is outof His reach."
    }
  ]
}
