{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "يَا أَيُّهَا الْمُزَّمِّلُ",
      "verseStringB": "O thou covering thyself up!ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "قُمِ اللَّيْلَ إِلَّا قَلِيلًا",
      "verseStringB": "Rise to pray by night except a little,"
    },
    {
      "verseNumber": 3,
      "verseString": "نِصْفَهُ أَوِ انْقُصْ مِنْهُ قَلِيلًا",
      "verseStringB": "Half of it, or lessen it a little,"
    },
    {
      "verseNumber": 4,
      "verseString": "أَوْ زِدْ عَلَيْهِ وَرَتِّلِ الْقُرْآنَ تَرْتِيلًا",
      "verseStringB": "Or add to it, and recite the Qur’ān in a leisurely manner."
    },
    {
      "verseNumber": 5,
      "verseString": "إِنَّا سَنُلْقِي عَلَيْكَ قَوْلًا ثَقِيلًا",
      "verseStringB": "Surely We shall charge thee with a weighty word.ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "إِنَّ نَاشِئَةَ اللَّيْلِ هِيَ أَشَدُّ وَطْئًا وَأَقْوَمُ قِيلًا",
      "verseStringB": "The rising by night is surely the firmest way to tread and most effective in speech.ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "إِنَّ لَكَ فِي النَّهَارِ سَبْحًا طَوِيلًا",
      "verseStringB": "Truly thou hast by day prolonged occupation."
    },
    {
      "verseNumber": 8,
      "verseString": "وَاذْكُرِ اسْمَ رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلًا",
      "verseStringB": "And remember the name of thy Lord and devote thyself to Him with (complete) devotion."
    },
    {
      "verseNumber": 9,
      "verseString": "رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ لَا إِلَٰهَ إِلَّا هُوَ فَاتَّخِذْهُ وَكِيلًا",
      "verseStringB": "The Lord of the East and the West — there is no God but He — so take Him for Protector."
    },
    {
      "verseNumber": 10,
      "verseString": "وَاصْبِرْ عَلَىٰ مَا يَقُولُونَ وَاهْجُرْهُمْ هَجْرًا جَمِيلًا",
      "verseStringB": "And bear patiently what they say and forsake them with a becoming withdrawal."
    },
    {
      "verseNumber": 11,
      "verseString": "وَذَرْنِي وَالْمُكَذِّبِينَ أُولِي النَّعْمَةِ وَمَهِّلْهُمْ قَلِيلًا",
      "verseStringB": "And leave Me and the deniers, possessors of plenty, and respite them a little."
    },
    {
      "verseNumber": 12,
      "verseString": "إِنَّ لَدَيْنَا أَنْكَالًا وَجَحِيمًا",
      "verseStringB": "Surely with Us are heavy fetters and a flaming Fire,"
    },
    {
      "verseNumber": 13,
      "verseString": "وَطَعَامًا ذَا غُصَّةٍ وَعَذَابًا أَلِيمًا",
      "verseStringB": "And food that chokes and a painful chastisement."
    },
    {
      "verseNumber": 14,
      "verseString": "يَوْمَ تَرْجُفُ الْأَرْضُ وَالْجِبَالُ وَكَانَتِ الْجِبَالُ كَثِيبًا مَهِيلًا",
      "verseStringB": "On the day when the earth and the mountains quake and the mountains become (as) heaps of sand let loose.ᵃ"
    },
    {
      "verseNumber": 15,
      "verseString": "إِنَّا أَرْسَلْنَا إِلَيْكُمْ رَسُولًا شَاهِدًا عَلَيْكُمْ كَمَا أَرْسَلْنَا إِلَىٰ فِرْعَوْنَ رَسُولًا",
      "verseStringB": "Surely We have sent to you a Messenger, a witness against you, as We sent a messenger to Pharaoh.ᵃ"
    },
    {
      "verseNumber": 16,
      "verseString": "فَعَصَىٰ فِرْعَوْنُ الرَّسُولَ فَأَخَذْنَاهُ أَخْذًا وَبِيلًا",
      "verseStringB": "But Pharaoh disobeyed the messenger, so We seized him with a violent grip."
    },
    {
      "verseNumber": 17,
      "verseString": "فَكَيْفَ تَتَّقُونَ إِنْ كَفَرْتُمْ يَوْمًا يَجْعَلُ الْوِلْدَانَ شِيبًا",
      "verseStringB": "How, then, if you disbelieve, will you guard yourselves on the day which will make children greyheaded?"
    },
    {
      "verseNumber": 18,
      "verseString": "السَّمَاءُ مُنْفَطِرٌ بِهِ ۚ كَانَ وَعْدُهُ مَفْعُولًا",
      "verseStringB": "The heaven being rent asunder thereby. His promise is ever fulfilled.ᵃ"
    },
    {
      "verseNumber": 19,
      "verseString": "إِنَّ هَٰذِهِ تَذْكِرَةٌ ۖ فَمَنْ شَاءَ اتَّخَذَ إِلَىٰ رَبِّهِ سَبِيلًا",
      "verseStringB": "Surely this is a Reminder; so let him, who will, take a way to his Lord."
    },
    {
      "verseNumber": 20,
      "verseString": "إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنَىٰ مِنْ ثُلُثَيِ اللَّيْلِ وَنِصْفَهُ وَثُلُثَهُ وَطَائِفَةٌ مِنَ الَّذِينَ مَعَكَ ۚ وَاللَّهُ يُقَدِّرُ اللَّيْلَ وَالنَّهَارَ ۚ عَلِمَ أَنْ لَنْ تُحْصُوهُ فَتَابَ عَلَيْكُمْ ۖ فَاقْرَءُوا مَا تَيَسَّرَ مِنَ الْقُرْآنِ ۚ عَلِمَ أَنْ سَيَكُونُ مِنْكُمْ مَرْضَىٰ ۙ وَآخَرُونَ يَضْرِبُونَ فِي الْأَرْضِ يَبْتَغُونَ مِنْ فَضْلِ اللَّهِ ۙ وَآخَرُونَ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ ۖ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُ ۚ وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا ۚ وَمَا تُقَدِّمُوا لِأَنْفُسِكُمْ مِنْ خَيْرٍ تَجِدُوهُ عِنْدَ اللَّهِ هُوَ خَيْرًا وَأَعْظَمَ أَجْرًا ۚ وَاسْتَغْفِرُوا اللَّهَ ۖ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
      "verseStringB": "Thy Lord knows indeed that thou passest in prayer nearly two-thirds of the night, and (sometimes) half of it, and (sometimes) a third of it, as do a party of those with thee. And Allāh measures the night and the day. He knows that (all of) you are not able to do it, so He has turned to you (mercifully);ᵃ so read of the Qur’ān that which is easy for you. He knows that there are sick among you, and others who travel in the land seeking of Allāh’s bounty, and others who fight in Allāh’s way.ᵇ So read as much of it as is easy (for you), and keep up prayer and pay the poor-rate and offer to Allāh a goodly gift. And whatever of good you send on beforehand for yourselves, you will find it with Allāh — that is best and greatest in reward. And ask forgiveness of Allāh. Surely Allāh is Forgiving, Merciful."
    }
  ],
  "nameEnglish": "The Enwrapped",
  "nameTrans": "al-Muzzammil",
  "nameArabic": "الـمـزمـل",
  "chapterNumber": 73,
  "nVerses": 20,
  "footnotes": [
    {
      "note": "1a. Zammala means he wrapped him in his garments, and tazammala, he wrappedhimself up in his garments (LL). The Prophet is here called Muzzammil, originally,mutazammil, one who had wrapped himself up in his garments. The ordinary explanationis that the Prophet wrapped himself up in his clothes on receiving the Call, his first revelation. He is reported to have come back home trembling after his first spiritual experience, and to have said to his wife zammil∂-nß, zammil∂-nß, cover me, cover me (B. 1:1).But various other explanations are given and some take it as an allusion to his preparationfor prayers. The Prophet’s own words, as recorded in Bukhårß, make it clear that the reference here is to his covering himself up on receiving the first revelation. He is in facttold that he should not fear or tremble on account of the tremendous responsibility placedon him of reforming humanity, but should seek the help of God, through prayer to Him,the most effective prayer being prayer in the night, when the world is asleep.\n\n5a. Being burdened with the guidance of the whole world was indeed a weightyword, the weightiest word with which any human being has been charged in the wholehistory of humanity.\n\n6a. The praying at night is here described as being firstly the firmest way to tread — totread the way of Life, to tread upon all evil inclinations — and, secondly, the most effectivein speech — what one says to other people becomes most effective. The speaker, the inviterto Truth, has his heart strengthened with force Divine through his lengthened devotions inthe still of the night, and his word therefore carries the Divine force with it and enters thehearts of those who listen to him. Thus the night devotion, we are told, gives a man thestrength to do the greatest deeds and makes him perfect, giving him at the same timestrength to make others perfect because his words, coming out of a sincere heart, whichbows to none but God, carry conviction to the hearts of others. Thus was the Prophet fortified doubly, in his deeds as well as in his words, to carry his message to other people, andthus should his true followers try to get strength from the same Divine source in the dead ofnight, when all veils between man and God are removed by utter silence prevailing everywhere, the only cry being the cry of the devotee. The Divine light in its full brilliance thenillumines the heart of man and the heart of man reflects that light and illumines the world.\n\n14a. Vv. 12–14 speak of the wretched condition in which the present possessors ofease and plenty would find themselves, and how the great obstacles to the spread of truthwould be removed before the advance of Truth; see 20:105a.\n\n15a. The Holy Prophet’s likeness to Moses is stated in the clearest terms in this, oneof the earliest revelations, and thus the Holy Prophet’s claim to be the promised prophetof Deut. 18:18, who is expressly stated to be the “like” of Moses, is as old as his revelation.\n\n18a. Note the clear and decided tone of these verses, which at so early a periodwarned the opponents of the evil fate which they were destined to meet. The horrors ofthat day are spoken of as making children grey-headed and rending heaven asunder. Thecommentators admit that it is an allegorical description of the horrors of the day, for yousay, speaking of a terrible day, that it is a day which makes grey the forelocks of children(Rz). The coupling of this decidedly allegorical description with the rending asunder ofheaven is conclusive proof that the latter description must also be taken allegorically; infact, as such, the description is applicable to both the day of Resurrection and the doom ofthe opponents in this life. Such phrases as the rolling up of heaven (21:104), the rendingasunder of heaven (as here and in 82:1), the removing the covering of heaven (81:11), andother similar phrases, all really speak of the sweeping away of the old order of things togive place to a new, attended by the necessary terrors and disasters, and hence the description applies to the doom of a nation in this world as well as to the entirely new order ofthings which will be ushered in with the Resurrection. See also 21:104a and 81:11a.\n\n20a. The first portion of the verse simply states the fact that the Holy Prophet andthose with him passed sometimes two-thirds, sometimes a half, and sometimes a third ofthe night in prayer; and hence it is meaningless to say that the first portion of the verse isabrogated by the second. The latter portion of the verse states that, though the HolyProphet and his early zealous companions passed a great part of the night in prayer, allMuslims could not follow their example, and hence they are told that they might pray bynight so long as it was easy to them and not a burden. By the reading of the Qur’ån ishere meant its recital in the night-prayer called tahajjud.\n\n20b. The mention here of fighting is very probably a prophetical statement, as wefind in many other places in the Holy Qur’ån; hence the occurrence of the word is noargument that the verse was not revealed at Makkah."
    }
  ]
}
