{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "يَا أَيُّهَا الْمُدَّثِّرُ",
      "verseStringB": "O thou who wrappest thyself up,ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "قُمْ فَأَنْذِرْ",
      "verseStringB": "Arise and warn,ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "وَرَبَّكَ فَكَبِّرْ",
      "verseStringB": "And thy Lord do magnify,"
    },
    {
      "verseNumber": 4,
      "verseString": "وَثِيَابَكَ فَطَهِّرْ",
      "verseStringB": "And thy garments do purify,ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "وَالرُّجْزَ فَاهْجُرْ",
      "verseStringB": "And uncleanness do shun,"
    },
    {
      "verseNumber": 6,
      "verseString": "وَلَا تَمْنُنْ تَسْتَكْثِرُ",
      "verseStringB": "And do no favour seeking gain,ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "وَلِرَبِّكَ فَاصْبِرْ",
      "verseStringB": "And for the sake of thy Lord, be patient."
    },
    {
      "verseNumber": 8,
      "verseString": "فَإِذَا نُقِرَ فِي النَّاقُورِ",
      "verseStringB": "For when the trumpet is sounded,"
    },
    {
      "verseNumber": 9,
      "verseString": "فَذَٰلِكَ يَوْمَئِذٍ يَوْمٌ عَسِيرٌ",
      "verseStringB": "That will be — that day — a difficult day,"
    },
    {
      "verseNumber": 10,
      "verseString": "عَلَى الْكَافِرِينَ غَيْرُ يَسِيرٍ",
      "verseStringB": "For the disbelievers, anything but easy."
    },
    {
      "verseNumber": 11,
      "verseString": "ذَرْنِي وَمَنْ خَلَقْتُ وَحِيدًا",
      "verseStringB": "Leave Me alone with him whom I created,"
    },
    {
      "verseNumber": 12,
      "verseString": "وَجَعَلْتُ لَهُ مَالًا مَمْدُودًا",
      "verseStringB": "And gave him vast riches,"
    },
    {
      "verseNumber": 13,
      "verseString": "وَبَنِينَ شُهُودًا",
      "verseStringB": "And sons dwelling in his presence,"
    },
    {
      "verseNumber": 14,
      "verseString": "وَمَهَّدْتُ لَهُ تَمْهِيدًا",
      "verseStringB": "And made matters easy for him,"
    },
    {
      "verseNumber": 15,
      "verseString": "ثُمَّ يَطْمَعُ أَنْ أَزِيدَ",
      "verseStringB": "And yet he desires that I should give more!ᵃ"
    },
    {
      "verseNumber": 16,
      "verseString": "كَلَّا ۖ إِنَّهُ كَانَ لِآيَاتِنَا عَنِيدًا",
      "verseStringB": "By no means! Surely he is inimical to Our messages."
    },
    {
      "verseNumber": 17,
      "verseString": "سَأُرْهِقُهُ صَعُودًا",
      "verseStringB": "I will make a distressing punishment overtake him.ᵃ"
    },
    {
      "verseNumber": 18,
      "verseString": "إِنَّهُ فَكَّرَ وَقَدَّرَ",
      "verseStringB": "Surely he reflected and determined,"
    },
    {
      "verseNumber": 19,
      "verseString": "فَقُتِلَ كَيْفَ قَدَّرَ",
      "verseStringB": "But may he be destroyed how he determined!"
    },
    {
      "verseNumber": 20,
      "verseString": "ثُمَّ قُتِلَ كَيْفَ قَدَّرَ",
      "verseStringB": "Again, may he be destroyed how he determined!"
    },
    {
      "verseNumber": 21,
      "verseString": "ثُمَّ نَظَرَ",
      "verseStringB": "Then he looked,"
    },
    {
      "verseNumber": 22,
      "verseString": "ثُمَّ عَبَسَ وَبَسَرَ",
      "verseStringB": "Then frowned and scowled,"
    },
    {
      "verseNumber": 23,
      "verseString": "ثُمَّ أَدْبَرَ وَاسْتَكْبَرَ",
      "verseStringB": "Then turned back and was big with pride,"
    },
    {
      "verseNumber": 24,
      "verseString": "فَقَالَ إِنْ هَٰذَا إِلَّا سِحْرٌ يُؤْثَرُ",
      "verseStringB": "Then said: This is naught but magic from of old!"
    },
    {
      "verseNumber": 25,
      "verseString": "إِنْ هَٰذَا إِلَّا قَوْلُ الْبَشَرِ",
      "verseStringB": "This is naught but the word of a mortal!"
    },
    {
      "verseNumber": 26,
      "verseString": "سَأُصْلِيهِ سَقَرَ",
      "verseStringB": "I will cast him into hell."
    },
    {
      "verseNumber": 27,
      "verseString": "وَمَا أَدْرَاكَ مَا سَقَرُ",
      "verseStringB": "And what will make thee realize what hell is?"
    },
    {
      "verseNumber": 28,
      "verseString": "لَا تُبْقِي وَلَا تَذَرُ",
      "verseStringB": "It leaves naught, and spares naught."
    },
    {
      "verseNumber": 29,
      "verseString": "لَوَّاحَةٌ لِلْبَشَرِ",
      "verseStringB": "It scorches the mortal."
    },
    {
      "verseNumber": 30,
      "verseString": "عَلَيْهَا تِسْعَةَ عَشَرَ",
      "verseStringB": "Over it are nineteen.ᵃ"
    },
    {
      "verseNumber": 31,
      "verseString": "وَمَا جَعَلْنَا أَصْحَابَ النَّارِ إِلَّا مَلَائِكَةً ۙ وَمَا جَعَلْنَا عِدَّتَهُمْ إِلَّا فِتْنَةً لِلَّذِينَ كَفَرُوا لِيَسْتَيْقِنَ الَّذِينَ أُوتُوا الْكِتَابَ وَيَزْدَادَ الَّذِينَ آمَنُوا إِيمَانًا ۙ وَلَا يَرْتَابَ الَّذِينَ أُوتُوا الْكِتَابَ وَالْمُؤْمِنُونَ ۙ وَلِيَقُولَ الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ وَالْكَافِرُونَ مَاذَا أَرَادَ اللَّهُ بِهَٰذَا مَثَلًا ۚ كَذَٰلِكَ يُضِلُّ اللَّهُ مَنْ يَشَاءُ وَيَهْدِي مَنْ يَشَاءُ ۚ وَمَا يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ ۚ وَمَا هِيَ إِلَّا ذِكْرَىٰ لِلْبَشَرِ",
      "verseStringB": "And We have made none but angels wardens of the Fire, and We have not made their number but as a trial for those who disbelieve, that those who have been given the Book may be certain and those who believe may increase in faith, and those who have been given the Book and the believers may not doubt; and that those in whose hearts is a disease and the disbelievers may say: What does Allāh mean by this parable? Thus Allāh leaves in error whom He pleases, and guides whom He pleases. And none knows the hosts of thy Lord but He. And this is naught but a Reminder to mortals."
    },
    {
      "verseNumber": 32,
      "verseString": "كَلَّا وَالْقَمَرِ",
      "verseStringB": "Nay, by the moon!"
    },
    {
      "verseNumber": 33,
      "verseString": "وَاللَّيْلِ إِذْ أَدْبَرَ",
      "verseStringB": "And the night when it departs!"
    },
    {
      "verseNumber": 34,
      "verseString": "وَالصُّبْحِ إِذَا أَسْفَرَ",
      "verseStringB": "And the dawn when it shines!—"
    },
    {
      "verseNumber": 35,
      "verseString": "إِنَّهَا لَإِحْدَى الْكُبَرِ",
      "verseStringB": "Surely it is one of the gravest (misfortunes)."
    },
    {
      "verseNumber": 36,
      "verseString": "نَذِيرًا لِلْبَشَرِ",
      "verseStringB": "A warning to mortals,"
    },
    {
      "verseNumber": 37,
      "verseString": "لِمَنْ شَاءَ مِنْكُمْ أَنْ يَتَقَدَّمَ أَوْ يَتَأَخَّرَ",
      "verseStringB": "To him among you who will go forward or will remain behind.ᵃ"
    },
    {
      "verseNumber": 38,
      "verseString": "كُلُّ نَفْسٍ بِمَا كَسَبَتْ رَهِينَةٌ",
      "verseStringB": "Every soul is held in pledge for what it earns,"
    },
    {
      "verseNumber": 39,
      "verseString": "إِلَّا أَصْحَابَ الْيَمِينِ",
      "verseStringB": "Except the people of the right hand."
    },
    {
      "verseNumber": 40,
      "verseString": "فِي جَنَّاتٍ يَتَسَاءَلُونَ",
      "verseStringB": "In Gardens, they ask one another,"
    },
    {
      "verseNumber": 41,
      "verseString": "عَنِ الْمُجْرِمِينَ",
      "verseStringB": "About the guilty:"
    },
    {
      "verseNumber": 42,
      "verseString": "مَا سَلَكَكُمْ فِي سَقَرَ",
      "verseStringB": "What has brought you into hell?"
    },
    {
      "verseNumber": 43,
      "verseString": "قَالُوا لَمْ نَكُ مِنَ الْمُصَلِّينَ",
      "verseStringB": "They will say: We were not of those who prayed;"
    },
    {
      "verseNumber": 44,
      "verseString": "وَلَمْ نَكُ نُطْعِمُ الْمِسْكِينَ",
      "verseStringB": "Nor did we feed the poor;ᵃ"
    },
    {
      "verseNumber": 45,
      "verseString": "وَكُنَّا نَخُوضُ مَعَ الْخَائِضِينَ",
      "verseStringB": "And we indulged in vain talk with vain talkers;"
    },
    {
      "verseNumber": 46,
      "verseString": "وَكُنَّا نُكَذِّبُ بِيَوْمِ الدِّينِ",
      "verseStringB": "And we called the day of Judgment a lie;"
    },
    {
      "verseNumber": 47,
      "verseString": "حَتَّىٰ أَتَانَا الْيَقِينُ",
      "verseStringB": "Till the inevitable overtook us."
    },
    {
      "verseNumber": 48,
      "verseString": "فَمَا تَنْفَعُهُمْ شَفَاعَةُ الشَّافِعِينَ",
      "verseStringB": "So the intercession of intercessors will not avail them."
    },
    {
      "verseNumber": 49,
      "verseString": "فَمَا لَهُمْ عَنِ التَّذْكِرَةِ مُعْرِضِينَ",
      "verseStringB": "What is then the matter with them, that they turn away from the Reminder."
    },
    {
      "verseNumber": 50,
      "verseString": "كَأَنَّهُمْ حُمُرٌ مُسْتَنْفِرَةٌ",
      "verseStringB": "As if they were frightened asses,"
    },
    {
      "verseNumber": 51,
      "verseString": "فَرَّتْ مِنْ قَسْوَرَةٍ",
      "verseStringB": "Fleeing from a lion?"
    },
    {
      "verseNumber": 52,
      "verseString": "بَلْ يُرِيدُ كُلُّ امْرِئٍ مِنْهُمْ أَنْ يُؤْتَىٰ صُحُفًا مُنَشَّرَةً",
      "verseStringB": "Nay, everyone of them desires that he should be given pages spread outa —"
    },
    {
      "verseNumber": 53,
      "verseString": "كَلَّا ۖ بَلْ لَا يَخَافُونَ الْآخِرَةَ",
      "verseStringB": "By no means! But they fear not the Hereafter."
    },
    {
      "verseNumber": 54,
      "verseString": "كَلَّا إِنَّهُ تَذْكِرَةٌ",
      "verseStringB": "Nay, it is surely a Reminder."
    },
    {
      "verseNumber": 55,
      "verseString": "فَمَنْ شَاءَ ذَكَرَهُ",
      "verseStringB": "So whoever pleases may mind it."
    },
    {
      "verseNumber": 56,
      "verseString": "وَمَا يَذْكُرُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ ۚ هُوَ أَهْلُ التَّقْوَىٰ وَأَهْلُ الْمَغْفِرَةِ",
      "verseStringB": "And they will not mind unless Allāh please.ᵃ He is Worthy that duty should be kept to Him and Worthy to forgive.ᵇ"
    }
  ],
  "nameEnglish": "The Enrobed",
  "nameTrans": "al-Muddathir",
  "nameArabic": "الـمـدثـر",
  "chapterNumber": 74,
  "nVerses": 56,
  "footnotes": [
    {
      "note": "1a. Muddaththir is originally mutadaththir, meaning one wearing a dithår, i.e., anyone wrapping himself up in a dithår or a garment (LL). Some take the word metaphorically, the meaning being one clad in the garments of prophethood or one obscure.\n\n2a. Compare with the address contained in the last chapter. There the Prophet iscommanded to engage himself in devotion so that he should attain to perfection; here heis commanded to convey the message and to warn, to make others perfect.\n\n4a. Purification of the garments does not relate only to the outward act of purification, but also to the purification of the heart, as is shown in the next verse, which contains a command to shun every kind of uncleanness.\n\n6a. The reference is in particular to the great favour which the Prophet did to othersby warning them and guiding them to the right way. But the words are general; evenwhen conferring a worldly benefit on another, there should be no intention to receiveany return for it.\n\n15a. This description is general, but the case of Walßd ibn Mughßrah is specially notedby almost all commentators. Rz gives details of an occurrence in which Walßd was specially concerned. Ab∂ Jahl and other leaders in the persecution of the Holy Prophet assembledtogether to ponder what name to give to the Prophet. Somebody suggested that he was apoet, but Walßd said that his word was not like that of a poet. Another suggested that hewas a soothsayer, but Walßd rejected this, too, on the ground that Mu√ammad never spokea lie, whereas the soothsayers often proved liars. A third suggestion was that he was amadman, but this too was found inconsistent with the circumstances of the Holy Prophet’slife. Then Walßd left the company, his comrades thinking that he was going over to Islåm.Ab∂ Jahl followed him to question him about the matter, and was told that, after ponderingdeeply on the question, he had come to the conclusion that the Prophet was a så√ir, i.e., anenchanter, because, he said, “It is the enchanter who separates the father from the son, thebrother from the brother, and the husband from the wife”. Thereupon a proclamation wasmade in the streets of Makkah that the Prophet was a så√ir.\n\n17a. Three of Walßd’s sons became converts to Islåm, and the rest perished, hiswealth began to diminish, and ultimately he himself died in disgrace and poverty.\n\n30a. It should be noted that this is called a parable in the next verse: what doesAllåh mean by this parable? All that the Qur’ån says is that over it are nineteen. Thecommentators think that nineteen angels, or nineteen classes, or nineteen ranks may bemeant. The particular number is considered to be due to the misuse of nineteen facultieswhich are enumerated by the commentators (Rz).\n\n37a. The light of Truth would shine forth, we are told in the above verses, but notwithout a grave misfortune to those who refuse to go forward, and this is a warning.Those who go forward, on the other hand, will not be affected by that, the gravest ofmisfortunes, for the people of the right hand will be in Gardens, every soul beingpledged for what it earns. The prophetical strain adopted here regarding the doom of theopponents is continued to the end of the chapter.\n\n44a. Note the reply to v. 42 — What has brought you into hell? It is neglect of twochief duties: we did not pray and we did not feed the poor. These are thus the two pillarsof faith, service of God and service of humanity.\n\n52a. Everyone of them would have a revelation granted to him direct from heaven.To this they gave expression repeatedly: Why does not Allåh speak to us? (2:118).\n\n56a. In the Qur’ån God does not compel men to adopt one way or another. Hepoints out the right course from the wrong and leaves it to the choice of the individual:So whoever pleases may mind it (v. 55); We have truly shown him the way; he may bethankful or unthankful (76:3). Similar verses abound in the Holy Qur’ån. What, then,does the statement, and they will not mind unless Allåh please, mean? This statement issubject to the Divine laws already explained. Allåh is pleased to guide those in the rightway and to make those “mind” who open their hearts to receive it. Note how clearly theverses preceding it depict the peculiar condition of those who do not even listen to theReminder: What is then the matter with them, that they turn away from the Reminder,as if they were frightened asses, fleeing from a lion? (vv. 49 – 51). For a similarstatement occurring in 76:30, see 76:30a.\n\n56b. God is Worthy that duty of Him should be observed and therefore whoeverfails to observe that duty must suffer. But God is not a hard taskmaster; if man fails toobserve his duty, God in His unbounded love comes to his help and covers his faultswith His vast forgiveness. The epithet here used — Worthy to forgive — indicates thatforgiveness is in His nature; even if man does not ask for forgiveness, He forgives."
    }
  ]
}
