{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "عَمَّ يَتَسَاءَلُونَ",
      "verseStringB": "Of what do they ask one another?"
    },
    {
      "verseNumber": 2,
      "verseString": "عَنِ النَّبَإِ الْعَظِيمِ",
      "verseStringB": "Of the tremendous announce menta"
    },
    {
      "verseNumber": 3,
      "verseString": "الَّذِي هُمْ فِيهِ مُخْتَلِفُونَ",
      "verseStringB": "About which they differ."
    },
    {
      "verseNumber": 4,
      "verseString": "كَلَّا سَيَعْلَمُونَ",
      "verseStringB": "Nay, they will soon know;"
    },
    {
      "verseNumber": 5,
      "verseString": "ثُمَّ كَلَّا سَيَعْلَمُونَ",
      "verseStringB": "Nay, again, they will soon know."
    },
    {
      "verseNumber": 6,
      "verseString": "أَلَمْ نَجْعَلِ الْأَرْضَ مِهَادًا",
      "verseStringB": "Have We not made the earth an expanse"
    },
    {
      "verseNumber": 7,
      "verseString": "وَالْجِبَالَ أَوْتَادًا",
      "verseStringB": "And the mountains as pegs?ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "وَخَلَقْنَاكُمْ أَزْوَاجًا",
      "verseStringB": "And We have created you in pairs,"
    },
    {
      "verseNumber": 9,
      "verseString": "وَجَعَلْنَا نَوْمَكُمْ سُبَاتًا",
      "verseStringB": "And made your sleep for rest,"
    },
    {
      "verseNumber": 10,
      "verseString": "وَجَعَلْنَا اللَّيْلَ لِبَاسًا",
      "verseStringB": "And made the night a covering,"
    },
    {
      "verseNumber": 11,
      "verseString": "وَجَعَلْنَا النَّهَارَ مَعَاشًا",
      "verseStringB": "And made the day for seeking livelihood."
    },
    {
      "verseNumber": 12,
      "verseString": "وَبَنَيْنَا فَوْقَكُمْ سَبْعًا شِدَادًا",
      "verseStringB": "And We have made above you seven strong (bodies),"
    },
    {
      "verseNumber": 13,
      "verseString": "وَجَعَلْنَا سِرَاجًا وَهَّاجًا",
      "verseStringB": "And made a shining lamp,ᵃ"
    },
    {
      "verseNumber": 14,
      "verseString": "وَأَنْزَلْنَا مِنَ الْمُعْصِرَاتِ مَاءً ثَجَّاجًا",
      "verseStringB": "And We send down from the clouds water pouring forth in abundance,"
    },
    {
      "verseNumber": 15,
      "verseString": "لِنُخْرِجَ بِهِ حَبًّا وَنَبَاتًا",
      "verseStringB": "That We may bring forth thereby grain and herbs,"
    },
    {
      "verseNumber": 16,
      "verseString": "وَجَنَّاتٍ أَلْفَافًا",
      "verseStringB": "And luxuriant gardens."
    },
    {
      "verseNumber": 17,
      "verseString": "إِنَّ يَوْمَ الْفَصْلِ كَانَ مِيقَاتًا",
      "verseStringB": "Surely the day of Decision is appointeda —"
    },
    {
      "verseNumber": 18,
      "verseString": "يَوْمَ يُنْفَخُ فِي الصُّورِ فَتَأْتُونَ أَفْوَاجًا",
      "verseStringB": "The day when the trumpet is blown, so you come forth in hosts,"
    },
    {
      "verseNumber": 19,
      "verseString": "وَفُتِحَتِ السَّمَاءُ فَكَانَتْ أَبْوَابًا",
      "verseStringB": "And the heaven is opened so it becomes as doors,"
    },
    {
      "verseNumber": 20,
      "verseString": "وَسُيِّرَتِ الْجِبَالُ فَكَانَتْ سَرَابًا",
      "verseStringB": "And the mountains are moved off, so they remain a semblance.ᵃ"
    },
    {
      "verseNumber": 21,
      "verseString": "إِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًا",
      "verseStringB": "Surely hell lies in wait,"
    },
    {
      "verseNumber": 22,
      "verseString": "لِلطَّاغِينَ مَآبًا",
      "verseStringB": "A resort for the inordInᵃ te,"
    },
    {
      "verseNumber": 23,
      "verseString": "لَابِثِينَ فِيهَا أَحْقَابًا",
      "verseStringB": "Living therein for long years.ᵃ"
    },
    {
      "verseNumber": 24,
      "verseString": "لَا يَذُوقُونَ فِيهَا بَرْدًا وَلَا شَرَابًا",
      "verseStringB": "They taste not therein coolness nor drink,"
    },
    {
      "verseNumber": 25,
      "verseString": "إِلَّا حَمِيمًا وَغَسَّاقًا",
      "verseStringB": "But boiling and intensely cold water,"
    },
    {
      "verseNumber": 26,
      "verseString": "جَزَاءً وِفَاقًا",
      "verseStringB": "Requital corresponding.ᵃ"
    },
    {
      "verseNumber": 27,
      "verseString": "إِنَّهُمْ كَانُوا لَا يَرْجُونَ حِسَابًا",
      "verseStringB": "Surely they feared not the reckoning,"
    },
    {
      "verseNumber": 28,
      "verseString": "وَكَذَّبُوا بِآيَاتِنَا كِذَّابًا",
      "verseStringB": "And rejected Our messages, giving the lie (thereto)."
    },
    {
      "verseNumber": 29,
      "verseString": "وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ كِتَابًا",
      "verseStringB": "And We have recorded everything in a book,"
    },
    {
      "verseNumber": 30,
      "verseString": "فَذُوقُوا فَلَنْ نَزِيدَكُمْ إِلَّا عَذَابًا",
      "verseStringB": "So taste, for We shall add to you naught but chastisement.ᵃ"
    },
    {
      "verseNumber": 31,
      "verseString": "إِنَّ لِلْمُتَّقِينَ مَفَازًا",
      "verseStringB": "Surely for those who keep their duty is achievement,ᵃ"
    },
    {
      "verseNumber": 32,
      "verseString": "حَدَائِقَ وَأَعْنَابًا",
      "verseStringB": "Gardens and vineyards,"
    },
    {
      "verseNumber": 33,
      "verseString": "وَكَوَاعِبَ أَتْرَابًا",
      "verseStringB": "And youthful (companions), equals in age,ᵃ"
    },
    {
      "verseNumber": 34,
      "verseString": "وَكَأْسًا دِهَاقًا",
      "verseStringB": "And a pure cup."
    },
    {
      "verseNumber": 35,
      "verseString": "لَا يَسْمَعُونَ فِيهَا لَغْوًا وَلَا كِذَّابًا",
      "verseStringB": "They hear not therein vain words, nor lying —"
    },
    {
      "verseNumber": 36,
      "verseString": "جَزَاءً مِنْ رَبِّكَ عَطَاءً حِسَابًا",
      "verseStringB": "A reward from thy Lord, a gift sufficient;"
    },
    {
      "verseNumber": 37,
      "verseString": "رَبِّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الرَّحْمَٰنِ ۖ لَا يَمْلِكُونَ مِنْهُ خِطَابًا",
      "verseStringB": "The Lord of the heavens and the earth and what is between them, the Beneficent, they are not able to address Him."
    },
    {
      "verseNumber": 38,
      "verseString": "يَوْمَ يَقُومُ الرُّوحُ وَالْمَلَائِكَةُ صَفًّا ۖ لَا يَتَكَلَّمُونَ إِلَّا مَنْ أَذِنَ لَهُ الرَّحْمَٰنُ وَقَالَ صَوَابًا",
      "verseStringB": "The day when the Spirit and the angels stand in ranks;ᵃ none shall speak except he whom the Beneficent permits and he speaks aright."
    },
    {
      "verseNumber": 39,
      "verseString": "ذَٰلِكَ الْيَوْمُ الْحَقُّ ۖ فَمَنْ شَاءَ اتَّخَذَ إِلَىٰ رَبِّهِ مَآبًا",
      "verseStringB": "That is the True Day, so whoever desires may take refuge with his Lord."
    },
    {
      "verseNumber": 40,
      "verseString": "إِنَّا أَنْذَرْنَاكُمْ عَذَابًا قَرِيبًا يَوْمَ يَنْظُرُ الْمَرْءُ مَا قَدَّمَتْ يَدَاهُ وَيَقُولُ الْكَافِرُ يَا لَيْتَنِي كُنْتُ تُرَابًا",
      "verseStringB": "Truly We warn you of a chastisement near at handa— the day when man will see what his hands have sent before, and the disbeliever will say: O would that I were dust!"
    }
  ],
  "nameEnglish": "The Event",
  "nameTrans": "an-Naba'",
  "nameArabic": "الـنبإ",
  "chapterNumber": 78,
  "nVerses": 40,
  "footnotes": [
    {
      "note": "2a. Naba’ means an announcement of great utility leading to knowledge (R), or apiece of information, news, tidings (LL). The original words are naba’ ‘a˚ßm, meaning atremendous or very great announcement, which also occur in 38:67. Some commentators take it to signify the Holy Qur’ån, others the prophethood of Mu√ammad and stillothers the day of Resurrection. In fact, all three are included. The Qur’ån was revealedas the greatest of the Divine messages hitherto given to humanity, because it was a message for the whole of humanity, compared with the smaller messages to this or thatnation. It was, moreover, the most complete message. It gave the great news that thewhole of humanity, not this or that nation, would receive life through it. They differedabout it not only in the sense that they rejected it, but also because they put in differentsuggestions, some saying that the Prophet was a madman, others that he was a dreamer,others still that he was a poet or a fabricator, and so on.\n\n7a. The earth is called mihåd or a place made even for walking upon (R). The wordshere are similar to what is said in 2:22, where the earth is spoken of as being made afiråsh, i.e., an expanse or resting-place. The mountains are likened to pegs on the surfaceof the earth.\n\n13a. The seven strong bodies of the previous verse are apparently the seven majorplanets of the solar system, the words above you clearly showing that the earth itselfbelongs to the same class, and the sun, the centre of the solar system, is spoken of in thewords a shining lamp.\n\n17a. That there is a day of Decision in this life, too, which is synonymous with theultimate triumph of Truth and the doom of opposition to its spread is amply clear fromall these early chapters.\n\n20a. The description contained in vv. 18 –20 is a prophetical description applying tothe final triumph of Truth. People will come forth in hosts, afwåj-an, to accept the Truth;see ch. 110 — when the help of Allåh and victory comes and thou seest people enteringthe religion of Allåh in hosts, afwåj-an; the heaven is opened and the dead earth receiveslife, v. 19; the mountains — the great opposing forces — melt away, and all thatremains of opposition is a mere semblance.\n\n23a. Ïuqub, of which a√qåb is a plural, denotes eighty years, or seventy years, or ayear or years, or a long time (see LL, which quotes various authorities for each of thesemeanings). Whatever significance may be adopted, the use of the word leaves no doubtthat the punishment of hell is not eternal. The use of a word which signifies a limitedperiod in the case of the punishment of hell, while such words are never used regardingthe bliss of heavenly life, is a clear indication that the latter will never come to an end,while the former shall; see 11:107a.\n\n26a. The punishment of hell is described here as a requital corresponding to the sin.It may have been noted that various names are given to hell itself, and various sorts ofpunishment are spoken of. Thus every sinner has his own hell, corresponding to his sin.\n\n30a. As they in their inordinacy added evil to evil, they shall have correspondinglypunishment added to punishment. The addition in punishment lasts only until the evil isrequited. See also 11:107a where it is shown that hell is not eternal.\n\n31a. Note that the reward of good is achievement — achievement of the object of thislife as also of the great goal of the next life. It is this achievement which becomes a Garden.\n\n33a. Kawå‘ib is the plural of Kå‘ib which, when applied to a girl, means youthful orone nearing maturity (LL). But it should be noted that neither the word kawå‘ib noratråb (“equals in age”) is preceded or followed by any qualifying words, and hencekawå‘ib only means showing freshness of youth; see further 52:20a.\n\n38a. The Spirit (al-R∂√) and the angels are spoken of together on three occasions inthe Holy Qur’ån; in 70:4, as ascending to God, for which see 70:4a; in 97:4, as descending on earth in lailat al-Qadr, for which see 97:4a; and here as standing in ranks on theDay of Judgment. In 16:2, the angels are spoken of as descending with al-r∂√, which isevidently Divine revelation. Al-r∂√ means Gabriel, or a higher class of angels above theordinary angels, or the spirit of man when it leaves the earthly body (RM). In the lastmentioned case the word al-r∂√ can be applied only to the faithful, people in whom theDivine Spirit finds an awakening. As shown in 4:171b and 40:15a, the word al-r∂√ reallysignifies Divine inspiration or Divine revelation, and Gabriel is called al-R∂√ because hebrings the Divine revelation to the Prophet. The human spirit can, in fact, be called al-r∂√only when it receives light through Divine inspiration. The meaning would thus be thaton the day of Judgment the faithful and the angels stand in ranks in the presence of God.\n\n40a. The punishment of which the disbelievers are warned throughout the chapter isa punishment near at hand, which term, like the nearer punishment of 32:21, indicatesthe punishment of this life."
    }
  ]
}
