{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "وَالنَّازِعَاتِ غَرْقًا",
      "verseStringB": "By those yearning vehemently!"
    },
    {
      "verseNumber": 2,
      "verseString": "وَالنَّاشِطَاتِ نَشْطًا",
      "verseStringB": "And those going forth cheerfully!"
    },
    {
      "verseNumber": 3,
      "verseString": "وَالسَّابِحَاتِ سَبْحًا",
      "verseStringB": "And those running swiftly!"
    },
    {
      "verseNumber": 4,
      "verseString": "فَالسَّابِقَاتِ سَبْقًا",
      "verseStringB": "And those that are foremost going ahead!"
    },
    {
      "verseNumber": 5,
      "verseString": "فَالْمُدَبِّرَاتِ أَمْرًا",
      "verseStringB": "And those regulating the Affair!ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "يَوْمَ تَرْجُفُ الرَّاجِفَةُ",
      "verseStringB": "The day when the quaking one shall quake a —"
    },
    {
      "verseNumber": 7,
      "verseString": "تَتْبَعُهَا الرَّادِفَةُ",
      "verseStringB": "The consequence will follow it.ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "قُلُوبٌ يَوْمَئِذٍ وَاجِفَةٌ",
      "verseStringB": "Hearts that day will palpitate,"
    },
    {
      "verseNumber": 9,
      "verseString": "أَبْصَارُهَا خَاشِعَةٌ",
      "verseStringB": "Their eyes downcast."
    },
    {
      "verseNumber": 10,
      "verseString": "يَقُولُونَ أَإِنَّا لَمَرْدُودُونَ فِي الْحَافِرَةِ",
      "verseStringB": "They say: Shall we indeed be restored to (our) first state?ᵃ"
    },
    {
      "verseNumber": 11,
      "verseString": "أَإِذَا كُنَّا عِظَامًا نَخِرَةً",
      "verseStringB": "What! After we are rotten bones?"
    },
    {
      "verseNumber": 12,
      "verseString": "قَالُوا تِلْكَ إِذًا كَرَّةٌ خَاسِرَةٌ",
      "verseStringB": "They say: That would then be a return with loss."
    },
    {
      "verseNumber": 13,
      "verseString": "فَإِنَّمَا هِيَ زَجْرَةٌ وَاحِدَةٌ",
      "verseStringB": "It is only a single cry,"
    },
    {
      "verseNumber": 14,
      "verseString": "فَإِذَا هُمْ بِالسَّاهِرَةِ",
      "verseStringB": "When lo! they will be awakened.ᵃ"
    },
    {
      "verseNumber": 15,
      "verseString": "هَلْ أَتَاكَ حَدِيثُ مُوسَىٰ",
      "verseStringB": "Has not there come to thee the story of Moses,"
    },
    {
      "verseNumber": 16,
      "verseString": "إِذْ نَادَاهُ رَبُّهُ بِالْوَادِ الْمُقَدَّسِ طُوًى",
      "verseStringB": "When his Lord called him in the holy valley, Ôuwā?"
    },
    {
      "verseNumber": 17,
      "verseString": "اذْهَبْ إِلَىٰ فِرْعَوْنَ إِنَّهُ طَغَىٰ",
      "verseStringB": "Go to Pharaoh, surely he has rebelled."
    },
    {
      "verseNumber": 18,
      "verseString": "فَقُلْ هَلْ لَكَ إِلَىٰ أَنْ تَزَكَّىٰ",
      "verseStringB": "And say: Wilt thou purify thyself?"
    },
    {
      "verseNumber": 19,
      "verseString": "وَأَهْدِيَكَ إِلَىٰ رَبِّكَ فَتَخْشَىٰ",
      "verseStringB": "And I will guide thee to thy Lord so that thou fear (Him)."
    },
    {
      "verseNumber": 20,
      "verseString": "فَأَرَاهُ الْآيَةَ الْكُبْرَىٰ",
      "verseStringB": "So he showed him the mighty sign;"
    },
    {
      "verseNumber": 21,
      "verseString": "فَكَذَّبَ وَعَصَىٰ",
      "verseStringB": "But he denied and disobeyed."
    },
    {
      "verseNumber": 22,
      "verseString": "ثُمَّ أَدْبَرَ يَسْعَىٰ",
      "verseStringB": "Then he went back hastily,"
    },
    {
      "verseNumber": 23,
      "verseString": "فَحَشَرَ فَنَادَىٰ",
      "verseStringB": "So he gathered and called out."
    },
    {
      "verseNumber": 24,
      "verseString": "فَقَالَ أَنَا رَبُّكُمُ الْأَعْلَىٰ",
      "verseStringB": "Then he said: I am your Lord, the most High."
    },
    {
      "verseNumber": 25,
      "verseString": "فَأَخَذَهُ اللَّهُ نَكَالَ الْآخِرَةِ وَالْأُولَىٰ",
      "verseStringB": "So Allāh seized him with the punishment of the Hereafter and of this life.ᵃ"
    },
    {
      "verseNumber": 26,
      "verseString": "إِنَّ فِي ذَٰلِكَ لَعِبْرَةً لِمَنْ يَخْشَىٰ",
      "verseStringB": "Surely there is in this a lesson for him who fears."
    },
    {
      "verseNumber": 27,
      "verseString": "أَأَنْتُمْ أَشَدُّ خَلْقًا أَمِ السَّمَاءُ ۚ بَنَاهَا",
      "verseStringB": "Are you the stronger in creation or the heaven? He made it."
    },
    {
      "verseNumber": 28,
      "verseString": "رَفَعَ سَمْكَهَا فَسَوَّاهَا",
      "verseStringB": "He raised high its height,ᵃ and made it perfect,"
    },
    {
      "verseNumber": 29,
      "verseString": "وَأَغْطَشَ لَيْلَهَا وَأَخْرَجَ ضُحَاهَا",
      "verseStringB": "And He made dark its night and brought out its light."
    },
    {
      "verseNumber": 30,
      "verseString": "وَالْأَرْضَ بَعْدَ ذَٰلِكَ دَحَاهَا",
      "verseStringB": "And the earth, He cast it after that.ᵃ"
    },
    {
      "verseNumber": 31,
      "verseString": "أَخْرَجَ مِنْهَا مَاءَهَا وَمَرْعَاهَا",
      "verseStringB": "He brought forth from it its water and its pasture."
    },
    {
      "verseNumber": 32,
      "verseString": "وَالْجِبَالَ أَرْسَاهَا",
      "verseStringB": "And the mountains, He made them firm,"
    },
    {
      "verseNumber": 33,
      "verseString": "مَتَاعًا لَكُمْ وَلِأَنْعَامِكُمْ",
      "verseStringB": "A provision for you and for your cattle.ᵃ"
    },
    {
      "verseNumber": 34,
      "verseString": "فَإِذَا جَاءَتِ الطَّامَّةُ الْكُبْرَىٰ",
      "verseStringB": "So when the great Calamitya comes;"
    },
    {
      "verseNumber": 35,
      "verseString": "يَوْمَ يَتَذَكَّرُ الْإِنْسَانُ مَا سَعَىٰ",
      "verseStringB": "The day when man remembers all that he strove for,"
    },
    {
      "verseNumber": 36,
      "verseString": "وَبُرِّزَتِ الْجَحِيمُ لِمَنْ يَرَىٰ",
      "verseStringB": "And hell is made manifest to him who sees."
    },
    {
      "verseNumber": 37,
      "verseString": "فَأَمَّا مَنْ طَغَىٰ",
      "verseStringB": "Then as for him who is inordInᵃ te,"
    },
    {
      "verseNumber": 38,
      "verseString": "وَآثَرَ الْحَيَاةَ الدُّنْيَا",
      "verseStringB": "And prefers the life of this world,"
    },
    {
      "verseNumber": 39,
      "verseString": "فَإِنَّ الْجَحِيمَ هِيَ الْمَأْوَىٰ",
      "verseStringB": "Hell is surely the abode."
    },
    {
      "verseNumber": 40,
      "verseString": "وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ",
      "verseStringB": "And as for him who fears to stand before his Lord and restrains himself from low desires,ᵃ"
    },
    {
      "verseNumber": 41,
      "verseString": "فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ",
      "verseStringB": "The Garden is surely the abode."
    },
    {
      "verseNumber": 42,
      "verseString": "يَسْأَلُونَكَ عَنِ السَّاعَةِ أَيَّانَ مُرْسَاهَا",
      "verseStringB": "They ask thee about the Hour, When will that take place,"
    },
    {
      "verseNumber": 43,
      "verseString": "فِيمَ أَنْتَ مِنْ ذِكْرَاهَا",
      "verseStringB": "About which thou remindest?"
    },
    {
      "verseNumber": 44,
      "verseString": "إِلَىٰ رَبِّكَ مُنْتَهَاهَا",
      "verseStringB": "To thy Lord is the goal of it.ᵃ"
    },
    {
      "verseNumber": 45,
      "verseString": "إِنَّمَا أَنْتَ مُنْذِرُ مَنْ يَخْشَاهَا",
      "verseStringB": "Thou art only a warner to him who fears it."
    },
    {
      "verseNumber": 46,
      "verseString": "كَأَنَّهُمْ يَوْمَ يَرَوْنَهَا لَمْ يَلْبَثُوا إِلَّا عَشِيَّةً أَوْ ضُحَاهَا",
      "verseStringB": "On the day when they see it, it will be as if they had but tarried for an evening or a morning."
    }
  ],
  "nameEnglish": "The Snatchers",
  "nameTrans": "an-Nazi'at",
  "nameArabic": "الـنازعات",
  "chapterNumber": 79,
  "nVerses": 46,
  "footnotes": [
    {
      "note": "5a. Nåzi‘åt is the plural of nåzi‘, which is derived from naza‘a, signifying he yearnedfor or after a thing, and naza‘a fi-l-qaus means he drew the bow (LL). Gharq means originally sinking in water, but it is sometimes used in the sense of ighråq, and is so usedhere, meaning, when used in connection with a bow, he drew the bow to the full or vehemently (LL). NashaΔa signifies he was brisk or lively or pleased or happy or cheerful(LL). The commentators generally think that different kinds of angels are spoken of here,but see 37:1a, where it is shown that this is a description of the believers. The commencement of the early Makkan chapters very often refers prophetically to later Madßnanevents, the occurrence of which served as a proof of the truth of the statement made.Though the words may also apply to the later wars, I prefer the significance that they givea description of the spiritual characteristics of the faithful. There was undoubtedly a vehement yearning in the hearts of the believers for their Maker (v. 1), and it was this ardentdesire that made them go forth in the way of God cheerfully in spite of the severest opposition (v. 2); they ran swiftly (v. 3), so that they traversed eastern and western lands in anincredibly short time; they were thus ahead of all those who ever carried the message ofTruth to their fellow-man (v. 4); and lastly, they regulated the affair of the spread ofTruth in the world (v. 5), so that the farthest east (China) and farthest west (Morocco andSpain) were lit with the light of Islåm within a hundred years. Compare 32:5 where theregulating of the Affair is also spoken of, and see 32:5a. Taking the words in a generalsense, we may interpret them as indicating the various stages through which an affair isbrought to a successful issue. The first stage is that of an ardent desire or yearning for it;the second is that of going forth cheerfully to accomplish it; the third is that of runningswiftly for its accomplishment, or adopting the line of least resistance; the fourth is thatof going ahead of others; and the fifth that of regulating it in the best possible way.\n\n6a. Rajafa signifies it was in a state of commotion, agitation, or convulsion (LL).The quaking of the earth is often spoken of as an indication of a great revolution.The word rajafa in relation to a people — rajafa al-qaumu — signifies that the peopleprepared themselves for war.What is meant is therefore that the efforts of the faithful spoken of in the first fiveverses will bring about a great commotion or a great revolution in the world, indicatingthe transformation which was to be brought about through them.\n\n7a. Al-rådifah means literally what must happen afterwards, from radifa, meaninghe or it followed or came after it or him (LL). Thus rådifah is really the consequence ofan affair, a significance given under the word ridf by the lexicologists (LL). The consequence of great commotions is the ultimate triumph of Truth. But the triumph of Truth isalso the destruction of the opponents of Truth; hence the mention of palpitating heartsand downcast eyes in the next two verses.\n\n10a. It is the opponents who are referred to in they say.\n\n14a. The spiritual awakening — the great transformation to be brought about by theProphet — is spoken of here in clear words. This awakening was first to be brought about inArabia and then in the whole world.\n\n25a. The nature of the punishment in store for the opponents is made clear by citingthe example of Pharaoh, whose punishment was the punishment of the Hereafter as wellas of this life. Even such was to be the punishment of the Prophet’s opponents, abasement in this life and chastisement in the next.\n\n28a. The raising high of the height is, says Rz, an allusion to its extremely greatheight. There is a reference here to the great distances of the heavenly bodies, whichstagger human imagination.\n\n30a. The word da√å is ordinarily translated as spread or expanded, but it also meanshe threw or cast and impelled, propelled or removed from its place a stone with his hand(T, LL). Two things are made clear in this brief statement: (1) The earth was broughtinto existence after the heaven, or the starry creation; and (2) It was cast away, as a stoneis cast away, from a bigger creation.\n\n33a. How the earth was made fit for living on is next made clear. Its water, which isthe source of all its life, was brought forth from it, and water made possible the growthof vegetation. The mountains, we are further told, were raised so that they might serveas a provision for you and your cattle. The mountains are the sources of rivers andthrough these all living things on earth are provided with sustenance.\n\n34a. Ôåmmah signifies a calamity that predominates over others or a great or formidable thing (LL). By the Δåmmah is generally understood only the Resurrection, butthe words of v. 25 make it clear that the reference is as much to the calamity of this lifeas to the Resurrection. The making of hell manifest to him who sees in v. 36 is a clearindication of the same; the hell of the next life is spoken of in v. 39.\n\n40a. Refraining from low desires is the chief source from which grows a paradise.This further shows that the description given in the first five verses is really a descriptionof the spiritual advancement of the faithful.\n\n44a. The Hour is in itself a manifestation of Divine purpose. The destruction or punishment of the disbelievers is not an end in itself. The great goal of this punishment isthe Lord — Rabb — Who brings everything to perfection, and the real goal of humanlife is thus the Lord or the meeting with the Lord."
    }
  ]
}
