{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "المص",
      "verseStringB": "I, Allāh, am the best Knower, the Truthful.ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "كِتَابٌ أُنْزِلَ إِلَيْكَ فَلَا يَكُنْ فِي صَدْرِكَ حَرَجٌ مِنْهُ لِتُنْذِرَ بِهِ وَذِكْرَىٰ لِلْمُؤْمِنِينَ",
      "verseStringB": "A Book revealed to thee — so let there be no straitness in thy breast concerning it a — that thou mayest warn thereby, and a Reminderb to the believers."
    },
    {
      "verseNumber": 3,
      "verseString": "اتَّبِعُوا مَا أُنْزِلَ إِلَيْكُمْ مِنْ رَبِّكُمْ وَلَا تَتَّبِعُوا مِنْ دُونِهِ أَوْلِيَاءَ ۗ قَلِيلًا مَا تَذَكَّرُونَ",
      "verseStringB": "Follow what has been revealed to you from your Lord and follow not besides Him any guardians; little do you mind!"
    },
    {
      "verseNumber": 4,
      "verseString": "وَكَمْ مِنْ قَرْيَةٍ أَهْلَكْنَاهَا فَجَاءَهَا بَأْسُنَا بَيَاتًا أَوْ هُمْ قَائِلُونَ",
      "verseStringB": "And how many a town have We destroyed! So Our punishment came to it by night or while they slept at midday.ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "فَمَا كَانَ دَعْوَاهُمْ إِذْ جَاءَهُمْ بَأْسُنَا إِلَّا أَنْ قَالُوا إِنَّا كُنَّا ظَالِمِينَ",
      "verseStringB": "Yet their cry, when Our punishment came to them, was nothing but that they said: Surely we were wrong-doers."
    },
    {
      "verseNumber": 6,
      "verseString": "فَلَنَسْأَلَنَّ الَّذِينَ أُرْسِلَ إِلَيْهِمْ وَلَنَسْأَلَنَّ الْمُرْسَلِينَ",
      "verseStringB": "Then certainly We shall question those to whom messengers were sent, and We shall question the messengers,ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "فَلَنَقُصَّنَّ عَلَيْهِمْ بِعِلْمٍ ۖ وَمَا كُنَّا غَائِبِينَ",
      "verseStringB": "Then surely We shall relate to them with knowledge, and We are never absent.ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "وَالْوَزْنُ يَوْمَئِذٍ الْحَقُّ ۚ فَمَنْ ثَقُلَتْ مَوَازِينُهُ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
      "verseStringB": "And the judging on that day will be just; so as for those whose good deeds are heavy, they are the successful.ᵃ"
    },
    {
      "verseNumber": 9,
      "verseString": "وَمَنْ خَفَّتْ مَوَازِينُهُ فَأُولَٰئِكَ الَّذِينَ خَسِرُوا أَنْفُسَهُمْ بِمَا كَانُوا بِآيَاتِنَا يَظْلِمُونَ",
      "verseStringB": "And as for those whose good deeds are light, those are they who ruined their souls because they disbelieved in Our messages.ᵃ"
    },
    {
      "verseNumber": 10,
      "verseString": "وَلَقَدْ مَكَّنَّاكُمْ فِي الْأَرْضِ وَجَعَلْنَا لَكُمْ فِيهَا مَعَايِشَ ۗ قَلِيلًا مَا تَشْكُرُونَ",
      "verseStringB": "And certainly We established you in the earth and made therein means of livelihood for you; little it is that you give thanks!"
    },
    {
      "verseNumber": 11,
      "verseString": "وَلَقَدْ خَلَقْنَاكُمْ ثُمَّ صَوَّرْنَاكُمْ ثُمَّ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ لَمْ يَكُنْ مِنَ السَّاجِدِينَ",
      "verseStringB": "And We indeed created you, then We fashioned you, then We said to the angels: Make submission to Adam.ᵃ So they submitted, except Iblis; he was not of those who submitted."
    },
    {
      "verseNumber": 12,
      "verseString": "قَالَ مَا مَنَعَكَ أَلَّا تَسْجُدَ إِذْ أَمَرْتُكَ ۖ قَالَ أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي مِنْ نَارٍ وَخَلَقْتَهُ مِنْ طِينٍ",
      "verseStringB": "He said: What hindered thee that thou didst not submit when I commanded thee? He said: I am better than he; Thou hast created me of fire, while him Thou didst create of dust.ᵃ"
    },
    {
      "verseNumber": 13,
      "verseString": "قَالَ فَاهْبِطْ مِنْهَا فَمَا يَكُونُ لَكَ أَنْ تَتَكَبَّرَ فِيهَا فَاخْرُجْ إِنَّكَ مِنَ الصَّاغِرِينَ",
      "verseStringB": "He said: Then get forth from this (state), for it is not for thee to behave proudly therein. Go forth, therefore, surely thou art of the abject ones.ᵃ"
    },
    {
      "verseNumber": 14,
      "verseString": "قَالَ أَنْظِرْنِي إِلَىٰ يَوْمِ يُبْعَثُونَ",
      "verseStringB": "He said: Respite me till the day when they are raised.ᵃ"
    },
    {
      "verseNumber": 15,
      "verseString": "قَالَ إِنَّكَ مِنَ الْمُنْظَرِينَ",
      "verseStringB": "He said: Thou art surely of the respited ones."
    },
    {
      "verseNumber": 16,
      "verseString": "قَالَ فَبِمَا أَغْوَيْتَنِي لَأَقْعُدَنَّ لَهُمْ صِرَاطَكَ الْمُسْتَقِيمَ",
      "verseStringB": "He said: As Thou hast adjudged me to be erring,ᵃ I will certainly lie in wait for them in Thy straight path,"
    },
    {
      "verseNumber": 17,
      "verseString": "ثُمَّ لَآتِيَنَّهُمْ مِنْ بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ وَعَنْ أَيْمَانِهِمْ وَعَنْ شَمَائِلِهِمْ ۖ وَلَا تَجِدُ أَكْثَرَهُمْ شَاكِرِينَ",
      "verseStringB": "Then I shall certainly come upon them from before them and from behind them, and from their right and from their left; and Thou wilt not find most of them thankful."
    },
    {
      "verseNumber": 18,
      "verseString": "قَالَ اخْرُجْ مِنْهَا مَذْءُومًا مَدْحُورًا ۖ لَمَنْ تَبِعَكَ مِنْهُمْ لَأَمْلَأَنَّ جَهَنَّمَ مِنْكُمْ أَجْمَعِينَ",
      "verseStringB": "He said: Get out of it, despised, driven away. Whoever of them will follow thee, I will certainly fill hell with you all."
    },
    {
      "verseNumber": 19,
      "verseString": "وَيَا آدَمُ اسْكُنْ أَنْتَ وَزَوْجُكَ الْجَنَّةَ فَكُلَا مِنْ حَيْثُ شِئْتُمَا وَلَا تَقْرَبَا هَٰذِهِ الشَّجَرَةَ فَتَكُونَا مِنَ الظَّالِمِينَ",
      "verseStringB": "And (We said): O Adam, dwell thou and thy wife in the garden, so eat from whence you desire, but go not near this tree, lest you become of the unjust.ᵃ"
    },
    {
      "verseNumber": 20,
      "verseString": "فَوَسْوَسَ لَهُمَا الشَّيْطَانُ لِيُبْدِيَ لَهُمَا مَا وُورِيَ عَنْهُمَا مِنْ سَوْآتِهِمَا وَقَالَ مَا نَهَاكُمَا رَبُّكُمَا عَنْ هَٰذِهِ الشَّجَرَةِ إِلَّا أَنْ تَكُونَا مَلَكَيْنِ أَوْ تَكُونَا مِنَ الْخَالِدِينَ",
      "verseStringB": "But the devil made an evil suggestion to them that he might make manifest to them that which had been hidden from them of their shame,ᵃ and he said: Your Lord has forbidden you this tree, lest you become angels or become of the immortals."
    },
    {
      "verseNumber": 21,
      "verseString": "وَقَاسَمَهُمَا إِنِّي لَكُمَا لَمِنَ النَّاصِحِينَ",
      "verseStringB": "And he swore to them both: Surely I am a sincere adviser to you—"
    },
    {
      "verseNumber": 22,
      "verseString": "فَدَلَّاهُمَا بِغُرُورٍ ۚ فَلَمَّا ذَاقَا الشَّجَرَةَ بَدَتْ لَهُمَا سَوْآتُهُمَا وَطَفِقَا يَخْصِفَانِ عَلَيْهِمَا مِنْ وَرَقِ الْجَنَّةِ ۖ وَنَادَاهُمَا رَبُّهُمَا أَلَمْ أَنْهَكُمَا عَنْ تِلْكُمَا الشَّجَرَةِ وَأَقُلْ لَكُمَا إِنَّ الشَّيْطَانَ لَكُمَا عَدُوٌّ مُبِينٌ",
      "verseStringB": "Thus he caused them to fall by deceit. So when they had tasted of the tree, their shame became mani fest to them, and they both began to cover themselves with the leaves of the garden.ᵃ And their Lord called to them: Did I not forbid you that tree, and say to you that the devil is surely your open enemy?"
    },
    {
      "verseNumber": 23,
      "verseString": "قَالَا رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
      "verseStringB": "They said: Our Lord, we have wronged ourselves; and if Thou forgive us not, and have (not) mercy on us, we shall certainly be of the losers."
    },
    {
      "verseNumber": 24,
      "verseString": "قَالَ اهْبِطُوا بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ ۖ وَلَكُمْ فِي الْأَرْضِ مُسْتَقَرٌّ وَمَتَاعٌ إِلَىٰ حِينٍ",
      "verseStringB": "He said: Go forth — some of you, the enemies of others. And there is for you in the earth an abode and a provision for a time."
    },
    {
      "verseNumber": 25,
      "verseString": "قَالَ فِيهَا تَحْيَوْنَ وَفِيهَا تَمُوتُونَ وَمِنْهَا تُخْرَجُونَ",
      "verseStringB": "He said: Therein shall you live, and therein shall you die, and therefrom shall you be raised.ᵃ"
    },
    {
      "verseNumber": 26,
      "verseString": "يَا بَنِي آدَمَ قَدْ أَنْزَلْنَا عَلَيْكُمْ لِبَاسًا يُوَارِي سَوْآتِكُمْ وَرِيشًا ۖ وَلِبَاسُ التَّقْوَىٰ ذَٰلِكَ خَيْرٌ ۚ ذَٰلِكَ مِنْ آيَاتِ اللَّهِ لَعَلَّهُمْ يَذَّكَّرُونَ",
      "verseStringB": "O children of Adam, We have indeed sent down to you clothing to cover your shame, and (clothing) for beauty;ᵃ and clothing that guards against evil — that is the best.ᵇ This is of the messages of Allāh that they may be mindful."
    },
    {
      "verseNumber": 27,
      "verseString": "يَا بَنِي آدَمَ لَا يَفْتِنَنَّكُمُ الشَّيْطَانُ كَمَا أَخْرَجَ أَبَوَيْكُمْ مِنَ الْجَنَّةِ يَنْزِعُ عَنْهُمَا لِبَاسَهُمَا لِيُرِيَهُمَا سَوْآتِهِمَا ۗ إِنَّهُ يَرَاكُمْ هُوَ وَقَبِيلُهُ مِنْ حَيْثُ لَا تَرَوْنَهُمْ ۗ إِنَّا جَعَلْنَا الشَّيَاطِينَ أَوْلِيَاءَ لِلَّذِينَ لَا يُؤْمِنُونَ",
      "verseStringB": "O children of Adam, let not the devil seduce you, as he expelled your parents from the garden, pulling off from them their clothinga that he might show them their shame. He surely sees you, he as well as his host, from whence you see them not. Surely We have made the devils to be the friends of those who believe not.ᵇ"
    },
    {
      "verseNumber": 28,
      "verseString": "وَإِذَا فَعَلُوا فَاحِشَةً قَالُوا وَجَدْنَا عَلَيْهَا آبَاءَنَا وَاللَّهُ أَمَرَنَا بِهَا ۗ قُلْ إِنَّ اللَّهَ لَا يَأْمُرُ بِالْفَحْشَاءِ ۖ أَتَقُولُونَ عَلَى اللَّهِ مَا لَا تَعْلَمُونَ",
      "verseStringB": "And when they commit an indecency they say: We found our fathers doing this, and Allāh has enjoined it on us. Say: Surely Allāh enjoins not indecency. Do you say of Allāh what you know not?ᵃ"
    },
    {
      "verseNumber": 29,
      "verseString": "قُلْ أَمَرَ رَبِّي بِالْقِسْطِ ۖ وَأَقِيمُوا وُجُوهَكُمْ عِنْدَ كُلِّ مَسْجِدٍ وَادْعُوهُ مُخْلِصِينَ لَهُ الدِّينَ ۚ كَمَا بَدَأَكُمْ تَعُودُونَ",
      "verseStringB": "Say: My Lord enjoins justice.ᵃ And set upright your faces at every time of prayer and call on Him, being sincere to Him in obedience. As He brought you into being, so shall you return."
    },
    {
      "verseNumber": 30,
      "verseString": "فَرِيقًا هَدَىٰ وَفَرِيقًا حَقَّ عَلَيْهِمُ الضَّلَالَةُ ۗ إِنَّهُمُ اتَّخَذُوا الشَّيَاطِينَ أَوْلِيَاءَ مِنْ دُونِ اللَّهِ وَيَحْسَبُونَ أَنَّهُمْ مُهْتَدُونَ",
      "verseStringB": "A party has He guided, and another party — perdition is justly their due.ᵃ Surely they took the devils for friends instead of Allāh, and they think that they are rightly guided."
    },
    {
      "verseNumber": 31,
      "verseString": "يَا بَنِي آدَمَ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ وَكُلُوا وَاشْرَبُوا وَلَا تُسْرِفُوا ۚ إِنَّهُ لَا يُحِبُّ الْمُسْرِفِينَ",
      "verseStringB": "O children of Adam, attend to your adornment at every time of prayer, and eat and drink and be not prodigal; surely He loves not the prodigals.ᵃ"
    },
    {
      "verseNumber": 32,
      "verseString": "قُلْ مَنْ حَرَّمَ زِينَةَ اللَّهِ الَّتِي أَخْرَجَ لِعِبَادِهِ وَالطَّيِّبَاتِ مِنَ الرِّزْقِ ۚ قُلْ هِيَ لِلَّذِينَ آمَنُوا فِي الْحَيَاةِ الدُّنْيَا خَالِصَةً يَوْمَ الْقِيَامَةِ ۗ كَذَٰلِكَ نُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَعْلَمُونَ",
      "verseStringB": "Say: Who has forbidden the adornment of Allāh,ᵃ which He has brought forth for His servants, and the good provisions? Say: These are for the believers in the life of this world, purely (theirs) on the Resurrection day.ᵇ Thus do We make the messages clear for a people who know."
    },
    {
      "verseNumber": 33,
      "verseString": "قُلْ إِنَّمَا حَرَّمَ رَبِّيَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَالْإِثْمَ وَالْبَغْيَ بِغَيْرِ الْحَقِّ وَأَنْ تُشْرِكُوا بِاللَّهِ مَا لَمْ يُنَزِّلْ بِهِ سُلْطَانًا وَأَنْ تَقُولُوا عَلَى اللَّهِ مَا لَا تَعْلَمُونَ",
      "verseStringB": "Say: My Lord forbids only indecencies, such of them as are apparent and such as are concealed, and sin and unjust rebellion, and that you associate with Allāh that for which He has sent down no authority, and that you say of Allāh what you know not."
    },
    {
      "verseNumber": 34,
      "verseString": "وَلِكُلِّ أُمَّةٍ أَجَلٌ ۖ فَإِذَا جَاءَ أَجَلُهُمْ لَا يَسْتَأْخِرُونَ سَاعَةً ۖ وَلَا يَسْتَقْدِمُونَ",
      "verseStringB": "And every nation has a term;ᵃ so when its term comes, they cannot remain behind the least while, nor can they precede (it)."
    },
    {
      "verseNumber": 35,
      "verseString": "يَا بَنِي آدَمَ إِمَّا يَأْتِيَنَّكُمْ رُسُلٌ مِنْكُمْ يَقُصُّونَ عَلَيْكُمْ آيَاتِي ۙ فَمَنِ اتَّقَىٰ وَأَصْلَحَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "verseStringB": "O children of Adam, if messengers come to you from among you relating to you My messages, then whosoever guards against evil and acts aright — they shall have no fear, nor shall they grieve."
    },
    {
      "verseNumber": 36,
      "verseString": "وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا وَاسْتَكْبَرُوا عَنْهَا أُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ",
      "verseStringB": "And those who reject Our messages and turn away from them haughtily — these are the companions of the Fire; they shall abide in it."
    },
    {
      "verseNumber": 37,
      "verseString": "فَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا أَوْ كَذَّبَ بِآيَاتِهِ ۚ أُولَٰئِكَ يَنَالُهُمْ نَصِيبُهُمْ مِنَ الْكِتَابِ ۖ حَتَّىٰ إِذَا جَاءَتْهُمْ رُسُلُنَا يَتَوَفَّوْنَهُمْ قَالُوا أَيْنَ مَا كُنْتُمْ تَدْعُونَ مِنْ دُونِ اللَّهِ ۖ قَالُوا ضَلُّوا عَنَّا وَشَهِدُوا عَلَىٰ أَنْفُسِهِمْ أَنَّهُمْ كَانُوا كَافِرِينَ",
      "verseStringB": "Who is then more unjust than he who forges a lie against Allāh or rejects His messages? These — their portion of the Book shall reach them;ᵃ until when Our messengers come to them causing them to die, they say: Where is that which you used to call upon besides Allāh? They would say: They are gone away from us. And they shall bear witness against themselves that they were disbelievers."
    },
    {
      "verseNumber": 38,
      "verseString": "قَالَ ادْخُلُوا فِي أُمَمٍ قَدْ خَلَتْ مِنْ قَبْلِكُمْ مِنَ الْجِنِّ وَالْإِنْسِ فِي النَّارِ ۖ كُلَّمَا دَخَلَتْ أُمَّةٌ لَعَنَتْ أُخْتَهَا ۖ حَتَّىٰ إِذَا ادَّارَكُوا فِيهَا جَمِيعًا قَالَتْ أُخْرَاهُمْ لِأُولَاهُمْ رَبَّنَا هَٰؤُلَاءِ أَضَلُّونَا فَآتِهِمْ عَذَابًا ضِعْفًا مِنَ النَّارِ ۖ قَالَ لِكُلٍّ ضِعْفٌ وَلَٰكِنْ لَا تَعْلَمُونَ",
      "verseStringB": "He will say: Enter into the Fire among the nations that have passed away before you from among the jinn and men. Every time a nation enters, it curses its sister;ᵃ until when they all follow one another into it, the last of them will say with regard to the first of them:ᵇ Our Lord, these led us astray, so give them a double chastisement of the Fire. He will say: Each one has double but you know not.ᶜ"
    },
    {
      "verseNumber": 39,
      "verseString": "وَقَالَتْ أُولَاهُمْ لِأُخْرَاهُمْ فَمَا كَانَ لَكُمْ عَلَيْنَا مِنْ فَضْلٍ فَذُوقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْسِبُونَ",
      "verseStringB": "And the first of them will say to the last of them: You have no preference over us, so taste the chastisement for what you earned."
    },
    {
      "verseNumber": 40,
      "verseString": "إِنَّ الَّذِينَ كَذَّبُوا بِآيَاتِنَا وَاسْتَكْبَرُوا عَنْهَا لَا تُفَتَّحُ لَهُمْ أَبْوَابُ السَّمَاءِ وَلَا يَدْخُلُونَ الْجَنَّةَ حَتَّىٰ يَلِجَ الْجَمَلُ فِي سَمِّ الْخِيَاطِ ۚ وَكَذَٰلِكَ نَجْزِي الْمُجْرِمِينَ",
      "verseStringB": "Those who reject Our messages and turn away from them haughtily, the doors of heaven will not be opened for them, nor will they enter the Garden until the camel pass through the eye of the needle. And thus do We reward the guilty.ᵃ"
    },
    {
      "verseNumber": 41,
      "verseString": "لَهُمْ مِنْ جَهَنَّمَ مِهَادٌ وَمِنْ فَوْقِهِمْ غَوَاشٍ ۚ وَكَذَٰلِكَ نَجْزِي الظَّالِمِينَ",
      "verseStringB": "They shall have a bed of hell and over them coverings (of it). And thus do We requite the wrongdoers."
    },
    {
      "verseNumber": 42,
      "verseString": "وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَا نُكَلِّفُ نَفْسًا إِلَّا وُسْعَهَا أُولَٰئِكَ أَصْحَابُ الْجَنَّةِ ۖ هُمْ فِيهَا خَالِدُونَ",
      "verseStringB": "And as for those who believe and do good — We impose not on any soul a duty beyond its scope — they are the owners of the Garden; therein they abide."
    },
    {
      "verseNumber": 43,
      "verseString": "وَنَزَعْنَا مَا فِي صُدُورِهِمْ مِنْ غِلٍّ تَجْرِي مِنْ تَحْتِهِمُ الْأَنْهَارُ ۖ وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي هَدَانَا لِهَٰذَا وَمَا كُنَّا لِنَهْتَدِيَ لَوْلَا أَنْ هَدَانَا اللَّهُ ۖ لَقَدْ جَاءَتْ رُسُلُ رَبِّنَا بِالْحَقِّ ۖ وَنُودُوا أَنْ تِلْكُمُ الْجَنَّةُ أُورِثْتُمُوهَا بِمَا كُنْتُمْ تَعْمَلُونَ",
      "verseStringB": "And We shall remove whatever of ill-feeling is in their hearts — rivers flow beneath them. And they say: All praise is due to Allāh, Who guided us to this! And we would not have found the way if Allāh had not guided us. Certainly the messengers of our Lord brought the truth. And it will be cried out to them: This is the Garden which you are made to inherit for what you did."
    },
    {
      "verseNumber": 44,
      "verseString": "وَنَادَىٰ أَصْحَابُ الْجَنَّةِ أَصْحَابَ النَّارِ أَنْ قَدْ وَجَدْنَا مَا وَعَدَنَا رَبُّنَا حَقًّا فَهَلْ وَجَدْتُمْ مَا وَعَدَ رَبُّكُمْ حَقًّا ۖ قَالُوا نَعَمْ ۚ فَأَذَّنَ مُؤَذِّنٌ بَيْنَهُمْ أَنْ لَعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ",
      "verseStringB": "And the owners of the Garden call out to the companions of the Fire: We have found that which our Lord promised us to be true; have you, too, found that which your Lord promised to be true? They will say: Yes. Then a crier will cry out among them: The curse of Allāh is on the wrongdoers,"
    },
    {
      "verseNumber": 45,
      "verseString": "الَّذِينَ يَصُدُّونَ عَنْ سَبِيلِ اللَّهِ وَيَبْغُونَهَا عِوَجًا وَهُمْ بِالْآخِرَةِ كَافِرُونَ",
      "verseStringB": "Who hinder (men) from Allāh’s way and seek to make it crooked, and they are disbelievers in the Hereafter.ᵃ"
    },
    {
      "verseNumber": 46,
      "verseString": "وَبَيْنَهُمَا حِجَابٌ ۚ وَعَلَى الْأَعْرَافِ رِجَالٌ يَعْرِفُونَ كُلًّا بِسِيمَاهُمْ ۚ وَنَادَوْا أَصْحَابَ الْجَنَّةِ أَنْ سَلَامٌ عَلَيْكُمْ ۚ لَمْ يَدْخُلُوهَا وَهُمْ يَطْمَعُونَ",
      "verseStringB": "And between them is a veil.ᵃ And on the Elevated Placesb are men who know all by their marks. And they call out to the owners of the Garden: Peace be to you! They have not yet entered it, though they hope.ᶜ"
    },
    {
      "verseNumber": 47,
      "verseString": "وَإِذَا صُرِفَتْ أَبْصَارُهُمْ تِلْقَاءَ أَصْحَابِ النَّارِ قَالُوا رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ",
      "verseStringB": "And when their eyes are turned towards the companions of the Fire, they say: Our Lord, place us not with the unjust people.ᵃ"
    },
    {
      "verseNumber": 48,
      "verseString": "وَنَادَىٰ أَصْحَابُ الْأَعْرَافِ رِجَالًا يَعْرِفُونَهُمْ بِسِيمَاهُمْ قَالُوا مَا أَغْنَىٰ عَنْكُمْ جَمْعُكُمْ وَمَا كُنْتُمْ تَسْتَكْبِرُونَ",
      "verseStringB": "And the owners of the Elevated Places call out to men whom they recognize by their marks, saying: Of no avail were to you your amassingsa and your arrogance."
    },
    {
      "verseNumber": 49,
      "verseString": "أَهَٰؤُلَاءِ الَّذِينَ أَقْسَمْتُمْ لَا يَنَالُهُمُ اللَّهُ بِرَحْمَةٍ ۚ ادْخُلُوا الْجَنَّةَ لَا خَوْفٌ عَلَيْكُمْ وَلَا أَنْتُمْ تَحْزَنُونَ",
      "verseStringB": "Are these they about whom you swore that Allāh would not bestow mercy on them? Enter the Garden; you have no fear, nor shall you grieve."
    },
    {
      "verseNumber": 50,
      "verseString": "وَنَادَىٰ أَصْحَابُ النَّارِ أَصْحَابَ الْجَنَّةِ أَنْ أَفِيضُوا عَلَيْنَا مِنَ الْمَاءِ أَوْ مِمَّا رَزَقَكُمُ اللَّهُ ۚ قَالُوا إِنَّ اللَّهَ حَرَّمَهُمَا عَلَى الْكَافِرِينَ",
      "verseStringB": "And the companions of the Fire call out to the owners of the Garden: Pour on us some water or some of that which Allāh has provided for you. They say: Surely Allāh has forbidden them both to the disbelievers,"
    },
    {
      "verseNumber": 51,
      "verseString": "الَّذِينَ اتَّخَذُوا دِينَهُمْ لَهْوًا وَلَعِبًا وَغَرَّتْهُمُ الْحَيَاةُ الدُّنْيَا ۚ فَالْيَوْمَ نَنْسَاهُمْ كَمَا نَسُوا لِقَاءَ يَوْمِهِمْ هَٰذَا وَمَا كَانُوا بِآيَاتِنَا يَجْحَدُونَ",
      "verseStringB": "Who take their religion for an idle sport and a play, and this world’s life deceives them. So this day We shall forsake them,ᵃ as they neglected the meeting of this day of theirs, and as they denied Our messages."
    },
    {
      "verseNumber": 52,
      "verseString": "وَلَقَدْ جِئْنَاهُمْ بِكِتَابٍ فَصَّلْنَاهُ عَلَىٰ عِلْمٍ هُدًى وَرَحْمَةً لِقَوْمٍ يُؤْمِنُونَ",
      "verseStringB": "And certainly We have brought them a Book which We make clear with knowledge, a guidance and a mercy for a people who believe."
    },
    {
      "verseNumber": 53,
      "verseString": "هَلْ يَنْظُرُونَ إِلَّا تَأْوِيلَهُ ۚ يَوْمَ يَأْتِي تَأْوِيلُهُ يَقُولُ الَّذِينَ نَسُوهُ مِنْ قَبْلُ قَدْ جَاءَتْ رُسُلُ رَبِّنَا بِالْحَقِّ فَهَلْ لَنَا مِنْ شُفَعَاءَ فَيَشْفَعُوا لَنَا أَوْ نُرَدُّ فَنَعْمَلَ غَيْرَ الَّذِي كُنَّا نَعْمَلُ ۚ قَدْ خَسِرُوا أَنْفُسَهُمْ وَضَلَّ عَنْهُمْ مَا كَانُوا يَفْتَرُونَ",
      "verseStringB": "Do they wait for aught but its fInᵃ l sequel? a On the day when its fInᵃ l sequel comes, those who neglected it before will say: Indeed the messengers of our Lord brought the truth. Are there any intercessors on our behalf so that they should intercede for us? Or could we be sent back so that we should do (deeds) other than those which we did? Indeed they have lost their souls, and that which they forged has failed them."
    },
    {
      "verseNumber": 54,
      "verseString": "إِنَّ رَبَّكُمُ اللَّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ يُغْشِي اللَّيْلَ النَّهَارَ يَطْلُبُهُ حَثِيثًا وَالشَّمْسَ وَالْقَمَرَ وَالنُّجُومَ مُسَخَّرَاتٍ بِأَمْرِهِ ۗ أَلَا لَهُ الْخَلْقُ وَالْأَمْرُ ۗ تَبَارَكَ اللَّهُ رَبُّ الْعَالَمِينَ",
      "verseStringB": "Surely your Lord is Allāh, Who created the heavens and the earth in six periods,ᵃ and He is established on the Throne of Power.ᵇ He makes the night cover the day, which it pursues incessantly. And (He created) the sun and the moon and the stars, made subservient by His command. Surely His is the creation and the command. Blessed is Allāh, the Lord of the worlds!"
    },
    {
      "verseNumber": 55,
      "verseString": "ادْعُوا رَبَّكُمْ تَضَرُّعًا وَخُفْيَةً ۚ إِنَّهُ لَا يُحِبُّ الْمُعْتَدِينَ",
      "verseStringB": "Call on your Lord humbly and in secret. Surely He loves not the transgressors."
    },
    {
      "verseNumber": 56,
      "verseString": "وَلَا تُفْسِدُوا فِي الْأَرْضِ بَعْدَ إِصْلَاحِهَا وَادْعُوهُ خَوْفًا وَطَمَعًا ۚ إِنَّ رَحْمَتَ اللَّهِ قَرِيبٌ مِنَ الْمُحْسِنِينَ",
      "verseStringB": "And make not mischief in the earth after its reformation, and call on Him, fearing and hoping. Surely the mercy of Allāh is nigh to the doers of good.ᵃ"
    },
    {
      "verseNumber": 57,
      "verseString": "وَهُوَ الَّذِي يُرْسِلُ الرِّيَاحَ بُشْرًا بَيْنَ يَدَيْ رَحْمَتِهِ ۖ حَتَّىٰ إِذَا أَقَلَّتْ سَحَابًا ثِقَالًا سُقْنَاهُ لِبَلَدٍ مَيِّتٍ فَأَنْزَلْنَا بِهِ الْمَاءَ فَأَخْرَجْنَا بِهِ مِنْ كُلِّ الثَّمَرَاتِ ۚ كَذَٰلِكَ نُخْرِجُ الْمَوْتَىٰ لَعَلَّكُمْ تَذَكَّرُونَ",
      "verseStringB": "And He it is Who sends forth the winds bearing good news before His mercy;ᵃ till, when they bear a laden cloud, We drive it to a dead land, then We send down water on it, then bring forth thereby fruits of all kinds. Thus do We bring forth the dead that you may be mindful.ᵇ"
    },
    {
      "verseNumber": 58,
      "verseString": "وَالْبَلَدُ الطَّيِّبُ يَخْرُجُ نَبَاتُهُ بِإِذْنِ رَبِّهِ ۖ وَالَّذِي خَبُثَ لَا يَخْرُجُ إِلَّا نَكِدًا ۚ كَذَٰلِكَ نُصَرِّفُ الْآيَاتِ لِقَوْمٍ يَشْكُرُونَ",
      "verseStringB": "And the good land — its vegetation comes forth (abundantly) by the permission of its Lord. And that which is inferior — (its herbage) comes forth but scantily. Thus do We repeat the messages for a people who give thanks.ᵃ"
    },
    {
      "verseNumber": 59,
      "verseString": "لَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَقَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَٰهٍ غَيْرُهُ إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ",
      "verseStringB": "Certainly We sent Noah to his people, so he said: O my people, serve Allāh, you have no god other than Him. Indeed I fear for you the chastisement of a grievous day.ᵃ"
    },
    {
      "verseNumber": 60,
      "verseString": "قَالَ الْمَلَأُ مِنْ قَوْمِهِ إِنَّا لَنَرَاكَ فِي ضَلَالٍ مُبِينٍ",
      "verseStringB": "The chiefs of his people said: Surely we see thee in clear error."
    },
    {
      "verseNumber": 61,
      "verseString": "قَالَ يَا قَوْمِ لَيْسَ بِي ضَلَالَةٌ وَلَٰكِنِّي رَسُولٌ مِنْ رَبِّ الْعَالَمِينَ",
      "verseStringB": "He said: O my people, there is no error in me, but I am a messenger from the Lord of the worlds."
    },
    {
      "verseNumber": 62,
      "verseString": "أُبَلِّغُكُمْ رِسَالَاتِ رَبِّي وَأَنْصَحُ لَكُمْ وَأَعْلَمُ مِنَ اللَّهِ مَا لَا تَعْلَمُونَ",
      "verseStringB": "I deliver to you the messages of my Lord, and I offer you good advice, and I know from Allāh what you know not."
    },
    {
      "verseNumber": 63,
      "verseString": "أَوَعَجِبْتُمْ أَنْ جَاءَكُمْ ذِكْرٌ مِنْ رَبِّكُمْ عَلَىٰ رَجُلٍ مِنْكُمْ لِيُنْذِرَكُمْ وَلِتَتَّقُوا وَلَعَلَّكُمْ تُرْحَمُونَ",
      "verseStringB": "Do you wonder that a reminder has come to you from your Lord through a man from among you, that he may warn you and that you may guard against evil, and that mercy may be shown to you?"
    },
    {
      "verseNumber": 64,
      "verseString": "فَكَذَّبُوهُ فَأَنْجَيْنَاهُ وَالَّذِينَ مَعَهُ فِي الْفُلْكِ وَأَغْرَقْنَا الَّذِينَ كَذَّبُوا بِآيَاتِنَا ۚ إِنَّهُمْ كَانُوا قَوْمًا عَمِينَ",
      "verseStringB": "But they called him a liar, so We delivered him and those with him in the ark, and We drowned those who rejected Our messages. Surely they were a blind people!ᵃ"
    },
    {
      "verseNumber": 65,
      "verseString": "وَإِلَىٰ عَادٍ أَخَاهُمْ هُودًا ۗ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَٰهٍ غَيْرُهُ ۚ أَفَلَا تَتَّقُونَ",
      "verseStringB": "And to ‘āda (We sent) their brotherb H∂d.ᶜ He said: O my people, serve Allāh, you have no god other than Him. Will you not then guard against evil?"
    },
    {
      "verseNumber": 66,
      "verseString": "قَالَ الْمَلَأُ الَّذِينَ كَفَرُوا مِنْ قَوْمِهِ إِنَّا لَنَرَاكَ فِي سَفَاهَةٍ وَإِنَّا لَنَظُنُّكَ مِنَ الْكَاذِبِينَ",
      "verseStringB": "The chiefs of those who disbelieved from among his people said: Certainly we see thee in folly, and we certainly think thee to be of the liars."
    },
    {
      "verseNumber": 67,
      "verseString": "قَالَ يَا قَوْمِ لَيْسَ بِي سَفَاهَةٌ وَلَٰكِنِّي رَسُولٌ مِنْ رَبِّ الْعَالَمِينَ",
      "verseStringB": "He said: O my people, there is no folly in me, but I am a messenger of the Lord of the worlds."
    },
    {
      "verseNumber": 68,
      "verseString": "أُبَلِّغُكُمْ رِسَالَاتِ رَبِّي وَأَنَا لَكُمْ نَاصِحٌ أَمِينٌ",
      "verseStringB": "I deliver to you the messages of my Lord and I am a faithful adviser to you."
    },
    {
      "verseNumber": 69,
      "verseString": "أَوَعَجِبْتُمْ أَنْ جَاءَكُمْ ذِكْرٌ مِنْ رَبِّكُمْ عَلَىٰ رَجُلٍ مِنْكُمْ لِيُنْذِرَكُمْ ۚ وَاذْكُرُوا إِذْ جَعَلَكُمْ خُلَفَاءَ مِنْ بَعْدِ قَوْمِ نُوحٍ وَزَادَكُمْ فِي الْخَلْقِ بَسْطَةً ۖ فَاذْكُرُوا آلَاءَ اللَّهِ لَعَلَّكُمْ تُفْلِحُونَ",
      "verseStringB": "Do you wonder that a reminder has come to you from your Lord through a man from among you that he may warn you? And remember when He made you successors after Noah’s peoplea and increased you in excellence of make.ᵇ So remember the bounties of Allāh, that you may be successful."
    },
    {
      "verseNumber": 70,
      "verseString": "قَالُوا أَجِئْتَنَا لِنَعْبُدَ اللَّهَ وَحْدَهُ وَنَذَرَ مَا كَانَ يَعْبُدُ آبَاؤُنَا ۖ فَأْتِنَا بِمَا تَعِدُنَا إِنْ كُنْتَ مِنَ الصَّادِقِينَ",
      "verseStringB": "They said: Hast thou come to us that we may serve Allāh alone, and give up that which our fathers used to serve? Then bring to us what thou threatenest us with, if thou art of the truthful."
    },
    {
      "verseNumber": 71,
      "verseString": "قَالَ قَدْ وَقَعَ عَلَيْكُمْ مِنْ رَبِّكُمْ رِجْسٌ وَغَضَبٌ ۖ أَتُجَادِلُونَنِي فِي أَسْمَاءٍ سَمَّيْتُمُوهَا أَنْتُمْ وَآبَاؤُكُمْ مَا نَزَّلَ اللَّهُ بِهَا مِنْ سُلْطَانٍ ۚ فَانْتَظِرُوا إِنِّي مَعَكُمْ مِنَ الْمُنْتَظِرِينَ",
      "verseStringB": "He said: Indeed uncleanness and wrath from your Lord have lighted upon you.ᵃ Do you dispute with me about names which you and your fathers have named? b Allāh has not sent any authority for them. Wait, then; I too with you am of those who wait."
    },
    {
      "verseNumber": 72,
      "verseString": "فَأَنْجَيْنَاهُ وَالَّذِينَ مَعَهُ بِرَحْمَةٍ مِنَّا وَقَطَعْنَا دَابِرَ الَّذِينَ كَذَّبُوا بِآيَاتِنَا ۖ وَمَا كَانُوا مُؤْمِنِينَ",
      "verseStringB": "So We delivered him and those with him by mercy from Us, and We cut off the roots of those who rejected Our messages and were not believers.ᵃ"
    },
    {
      "verseNumber": 73,
      "verseString": "وَإِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحًا ۗ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَٰهٍ غَيْرُهُ ۖ قَدْ جَاءَتْكُمْ بَيِّنَةٌ مِنْ رَبِّكُمْ ۖ هَٰذِهِ نَاقَةُ اللَّهِ لَكُمْ آيَةً ۖ فَذَرُوهَا تَأْكُلْ فِي أَرْضِ اللَّهِ ۖ وَلَا تَمَسُّوهَا بِسُوءٍ فَيَأْخُذَكُمْ عَذَابٌ أَلِيمٌ",
      "verseStringB": "And to Tham∂da (We sent) their brother ˝āliƒ.ᵇ He said: O my people, serve Allāh, you have no god other than Him. Clear proof has indeed come to you from your Lord. This is Allāh’s she-camel — a sign for youc — so leave her alone to pasture in Allāh’s earth, and do her no harm, lest painful chastisement overtake you."
    },
    {
      "verseNumber": 74,
      "verseString": "وَاذْكُرُوا إِذْ جَعَلَكُمْ خُلَفَاءَ مِنْ بَعْدِ عَادٍ وَبَوَّأَكُمْ فِي الْأَرْضِ تَتَّخِذُونَ مِنْ سُهُولِهَا قُصُورًا وَتَنْحِتُونَ الْجِبَالَ بُيُوتًا ۖ فَاذْكُرُوا آلَاءَ اللَّهِ وَلَا تَعْثَوْا فِي الْأَرْضِ مُفْسِدِينَ",
      "verseStringB": "And remember when He made you successors after ‘ād and settled you in the land — you make mansions on its plains and hew out houses in the mountains.ᵃ So remember Allāh’s bounties and act not corruptly in the land, making mischief."
    },
    {
      "verseNumber": 75,
      "verseString": "قَالَ الْمَلَأُ الَّذِينَ اسْتَكْبَرُوا مِنْ قَوْمِهِ لِلَّذِينَ اسْتُضْعِفُوا لِمَنْ آمَنَ مِنْهُمْ أَتَعْلَمُونَ أَنَّ صَالِحًا مُرْسَلٌ مِنْ رَبِّهِ ۚ قَالُوا إِنَّا بِمَا أُرْسِلَ بِهِ مُؤْمِنُونَ",
      "verseStringB": "The arrogant chiefs of his people said to those who were weak, to those who believed from among them: Do you know that ˝āliƒ is one sent by his Lord? They said: Surely we are believers in that wherewith he has been sent."
    },
    {
      "verseNumber": 76,
      "verseString": "قَالَ الَّذِينَ اسْتَكْبَرُوا إِنَّا بِالَّذِي آمَنْتُمْ بِهِ كَافِرُونَ",
      "verseStringB": "Those who were haughty said: Surely we are disbelievers in that which you believe."
    },
    {
      "verseNumber": 77,
      "verseString": "فَعَقَرُوا النَّاقَةَ وَعَتَوْا عَنْ أَمْرِ رَبِّهِمْ وَقَالُوا يَا صَالِحُ ائْتِنَا بِمَا تَعِدُنَا إِنْ كُنْتَ مِنَ الْمُرْسَلِينَ",
      "verseStringB": "Then they hamstrung the shecamel and revolted against their Lord’s commandment, and said; O ˝āliƒ, bring us that with which thou threatenest us, if thou art of the messengers."
    },
    {
      "verseNumber": 78,
      "verseString": "فَأَخَذَتْهُمُ الرَّجْفَةُ فَأَصْبَحُوا فِي دَارِهِمْ جَاثِمِينَ",
      "verseStringB": "So the earthquake seized them, and they were motionless bodies in their abodes.ᵃ"
    },
    {
      "verseNumber": 79,
      "verseString": "فَتَوَلَّىٰ عَنْهُمْ وَقَالَ يَا قَوْمِ لَقَدْ أَبْلَغْتُكُمْ رِسَالَةَ رَبِّي وَنَصَحْتُ لَكُمْ وَلَٰكِنْ لَا تُحِبُّونَ النَّاصِحِينَ",
      "verseStringB": "So he turned away from them and said: O my people, I delivered to you the message of my Lord and gave you good advice, but you love not good advisers.ᵃ"
    },
    {
      "verseNumber": 80,
      "verseString": "وَلُوطًا إِذْ قَالَ لِقَوْمِهِ أَتَأْتُونَ الْفَاحِشَةَ مَا سَبَقَكُمْ بِهَا مِنْ أَحَدٍ مِنَ الْعَالَمِينَ",
      "verseStringB": "And (We sent) Lot, when he said to his people: Do you commit an abomInᵃ tion which no one in the world did before you?ᵃ"
    },
    {
      "verseNumber": 81,
      "verseString": "إِنَّكُمْ لَتَأْتُونَ الرِّجَالَ شَهْوَةً مِنْ دُونِ النِّسَاءِ ۚ بَلْ أَنْتُمْ قَوْمٌ مُسْرِفُونَ",
      "verseStringB": "Surely you come to males with lust instead of females. Nay, you are a people exceeding bounds."
    },
    {
      "verseNumber": 82,
      "verseString": "وَمَا كَانَ جَوَابَ قَوْمِهِ إِلَّا أَنْ قَالُوا أَخْرِجُوهُمْ مِنْ قَرْيَتِكُمْ ۖ إِنَّهُمْ أُنَاسٌ يَتَطَهَّرُونَ",
      "verseStringB": "And the answer of his people was no other than that they said: Turn them out of your town; surely they are a people who aspire to purity!"
    },
    {
      "verseNumber": 83,
      "verseString": "فَأَنْجَيْنَاهُ وَأَهْلَهُ إِلَّا امْرَأَتَهُ كَانَتْ مِنَ الْغَابِرِينَ",
      "verseStringB": "So We delivered him and his followers,ᵃ except his wife — she was of those who remained behind."
    },
    {
      "verseNumber": 84,
      "verseString": "وَأَمْطَرْنَا عَلَيْهِمْ مَطَرًا ۖ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُجْرِمِينَ",
      "verseStringB": "And We rained upon them a rain.ᵃ See, then, what was the end of the guilty!"
    },
    {
      "verseNumber": 85,
      "verseString": "وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا ۗ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَٰهٍ غَيْرُهُ ۖ قَدْ جَاءَتْكُمْ بَيِّنَةٌ مِنْ رَبِّكُمْ ۖ فَأَوْفُوا الْكَيْلَ وَالْمِيزَانَ وَلَا تَبْخَسُوا النَّاسَ أَشْيَاءَهُمْ وَلَا تُفْسِدُوا فِي الْأَرْضِ بَعْدَ إِصْلَاحِهَا ۚ ذَٰلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ",
      "verseStringB": "And to Midian (We sent) their brother Shu‘aib. He said: O my people, serve Allāh, you have no god other than Him. Clear proof indeed has come to you from your Lord, so give full measure and weight and diminish not to men their things, and make not mischief in the land after its reform. This is better for you, if you are believers.ᵃ"
    },
    {
      "verseNumber": 86,
      "verseString": "وَلَا تَقْعُدُوا بِكُلِّ صِرَاطٍ تُوعِدُونَ وَتَصُدُّونَ عَنْ سَبِيلِ اللَّهِ مَنْ آمَنَ بِهِ وَتَبْغُونَهَا عِوَجًا ۚ وَاذْكُرُوا إِذْ كُنْتُمْ قَلِيلًا فَكَثَّرَكُمْ ۖ وَانْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الْمُفْسِدِينَ",
      "verseStringB": "And lie not in wait on every road, threatening and turning away from Allāh’s way him who believes in Him and seeking to make it crooked. And remember when you were few, then He multiplied you, and see what was the end of the mischief-makers!"
    },
    {
      "verseNumber": 87,
      "verseString": "وَإِنْ كَانَ طَائِفَةٌ مِنْكُمْ آمَنُوا بِالَّذِي أُرْسِلْتُ بِهِ وَطَائِفَةٌ لَمْ يُؤْمِنُوا فَاصْبِرُوا حَتَّىٰ يَحْكُمَ اللَّهُ بَيْنَنَا ۚ وَهُوَ خَيْرُ الْحَاكِمِينَ",
      "verseStringB": "And if there is a party of you who believe in that wherewith I am sent and another party who believe not, then wait patiently till Allāh judges between us; and He is the Best of Judges."
    },
    {
      "verseNumber": 88,
      "verseString": "قَالَ الْمَلَأُ الَّذِينَ اسْتَكْبَرُوا مِنْ قَوْمِهِ لَنُخْرِجَنَّكَ يَا شُعَيْبُ وَالَّذِينَ آمَنُوا مَعَكَ مِنْ قَرْيَتِنَا أَوْ لَتَعُودُنَّ فِي مِلَّتِنَا ۚ قَالَ أَوَلَوْ كُنَّا كَارِهِينَ",
      "verseStringB": "The arrogant chiefs of his people said: We will certainly turn thee out, O Shu‘aib, and those who believe with thee from our town, or you shall come back to our religion. He said: Even though we dislike (it)?"
    },
    {
      "verseNumber": 89,
      "verseString": "قَدِ افْتَرَيْنَا عَلَى اللَّهِ كَذِبًا إِنْ عُدْنَا فِي مِلَّتِكُمْ بَعْدَ إِذْ نَجَّانَا اللَّهُ مِنْهَا ۚ وَمَا يَكُونُ لَنَا أَنْ نَعُودَ فِيهَا إِلَّا أَنْ يَشَاءَ اللَّهُ رَبُّنَا ۚ وَسِعَ رَبُّنَا كُلَّ شَيْءٍ عِلْمًا ۚ عَلَى اللَّهِ تَوَكَّلْنَا ۚ رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنْتَ خَيْرُ الْفَاتِحِينَ",
      "verseStringB": "Indeed we should have forged a lie against Allāh, if we go back to your religion after Allāh has delivered us from it. And it is not for us to go back to it, unless Allāh our Lord please. Our Lord comprehends all things in His knowledge. In Allāh do we trust. Our Lord, decide between us and our people with truth, and Thou art the Best of Deciders."
    },
    {
      "verseNumber": 90,
      "verseString": "وَقَالَ الْمَلَأُ الَّذِينَ كَفَرُوا مِنْ قَوْمِهِ لَئِنِ اتَّبَعْتُمْ شُعَيْبًا إِنَّكُمْ إِذًا لَخَاسِرُونَ",
      "verseStringB": "And the chiefs of his people, who disbelieved, said: If you follow Shu‘aib, you are surely losers."
    },
    {
      "verseNumber": 91,
      "verseString": "فَأَخَذَتْهُمُ الرَّجْفَةُ فَأَصْبَحُوا فِي دَارِهِمْ جَاثِمِينَ",
      "verseStringB": "So the earthquake overtook them, and they were motionless bodies in their abodea —"
    },
    {
      "verseNumber": 92,
      "verseString": "الَّذِينَ كَذَّبُوا شُعَيْبًا كَأَنْ لَمْ يَغْنَوْا فِيهَا ۚ الَّذِينَ كَذَّبُوا شُعَيْبًا كَانُوا هُمُ الْخَاسِرِينَ",
      "verseStringB": "Those who called Shu‘aib a liar were as though they had never dwelt therein — those who called Shu‘aib a liar, they were the losers."
    },
    {
      "verseNumber": 93,
      "verseString": "فَتَوَلَّىٰ عَنْهُمْ وَقَالَ يَا قَوْمِ لَقَدْ أَبْلَغْتُكُمْ رِسَالَاتِ رَبِّي وَنَصَحْتُ لَكُمْ ۖ فَكَيْفَ آسَىٰ عَلَىٰ قَوْمٍ كَافِرِينَ",
      "verseStringB": "So he turned away from them and said: O my people, indeed I delivered to you the messages of my Lord and I gave you good advice; how, then, should I be sorry for a disbelieving people?ᵃ"
    },
    {
      "verseNumber": 94,
      "verseString": "وَمَا أَرْسَلْنَا فِي قَرْيَةٍ مِنْ نَبِيٍّ إِلَّا أَخَذْنَا أَهْلَهَا بِالْبَأْسَاءِ وَالضَّرَّاءِ لَعَلَّهُمْ يَضَّرَّعُونَ",
      "verseStringB": "And We did not send a prophet to a town but We seized its people with distress and affliction that they might humble themselves.ᵃ"
    },
    {
      "verseNumber": 95,
      "verseString": "ثُمَّ بَدَّلْنَا مَكَانَ السَّيِّئَةِ الْحَسَنَةَ حَتَّىٰ عَفَوْا وَقَالُوا قَدْ مَسَّ آبَاءَنَا الضَّرَّاءُ وَالسَّرَّاءُ فَأَخَذْنَاهُمْ بَغْتَةً وَهُمْ لَا يَشْعُرُونَ",
      "verseStringB": "Then We changed the evil for good,ᵃ till they became affluent and said: Distress and happiness did indeed touch our fathers. So We took them by surprise while they perceived not."
    },
    {
      "verseNumber": 96,
      "verseString": "وَلَوْ أَنَّ أَهْلَ الْقُرَىٰ آمَنُوا وَاتَّقَوْا لَفَتَحْنَا عَلَيْهِمْ بَرَكَاتٍ مِنَ السَّمَاءِ وَالْأَرْضِ وَلَٰكِنْ كَذَّبُوا فَأَخَذْنَاهُمْ بِمَا كَانُوا يَكْسِبُونَ",
      "verseStringB": "And if the people of the towns had believed and kept their duty, We would certainly have opened for them blessings from the heavens and the earth. But they rejected, so We seized them for what they earned."
    },
    {
      "verseNumber": 97,
      "verseString": "أَفَأَمِنَ أَهْلُ الْقُرَىٰ أَنْ يَأْتِيَهُمْ بَأْسُنَا بَيَاتًا وَهُمْ نَائِمُونَ",
      "verseStringB": "Are the people of the towns, then, secure from Our punishment coming to them by night while they sleep?"
    },
    {
      "verseNumber": 98,
      "verseString": "أَوَأَمِنَ أَهْلُ الْقُرَىٰ أَنْ يَأْتِيَهُمْ بَأْسُنَا ضُحًى وَهُمْ يَلْعَبُونَ",
      "verseStringB": "Or, are the people of the towns secure from Our punishment coming to them in the morning while they play?ᵃ"
    },
    {
      "verseNumber": 99,
      "verseString": "أَفَأَمِنُوا مَكْرَ اللَّهِ ۚ فَلَا يَأْمَنُ مَكْرَ اللَّهِ إِلَّا الْقَوْمُ الْخَاسِرُونَ",
      "verseStringB": "Are they secure from Allāh’s plan? But none feels secure from Allāh’s plan except the people who perish."
    },
    {
      "verseNumber": 100,
      "verseString": "أَوَلَمْ يَهْدِ لِلَّذِينَ يَرِثُونَ الْأَرْضَ مِنْ بَعْدِ أَهْلِهَا أَنْ لَوْ نَشَاءُ أَصَبْنَاهُمْ بِذُنُوبِهِمْ ۚ وَنَطْبَعُ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَسْمَعُونَ",
      "verseStringB": "Is it not clear to those who inherit the earth after its (former) residents that, if We please, We would afflict them for their sins, and seal their hearts so they would not hear?"
    },
    {
      "verseNumber": 101,
      "verseString": "تِلْكَ الْقُرَىٰ نَقُصُّ عَلَيْكَ مِنْ أَنْبَائِهَا ۚ وَلَقَدْ جَاءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَمَا كَانُوا لِيُؤْمِنُوا بِمَا كَذَّبُوا مِنْ قَبْلُ ۚ كَذَٰلِكَ يَطْبَعُ اللَّهُ عَلَىٰ قُلُوبِ الْكَافِرِينَ",
      "verseStringB": "Such were the towns some of whose news We have related to thee. And certainly their messengers came to them with clear arguments, but they would not believe what they had rejected before. Thus does Allāh seal the hearts of the disbelievers."
    },
    {
      "verseNumber": 102,
      "verseString": "وَمَا وَجَدْنَا لِأَكْثَرِهِمْ مِنْ عَهْدٍ ۖ وَإِنْ وَجَدْنَا أَكْثَرَهُمْ لَفَاسِقِينَ",
      "verseStringB": "And We found not in most of them (faithfulness to) covenant; and We found most of them to be transgressors."
    },
    {
      "verseNumber": 103,
      "verseString": "ثُمَّ بَعَثْنَا مِنْ بَعْدِهِمْ مُوسَىٰ بِآيَاتِنَا إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ فَظَلَمُوا بِهَا ۖ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُفْسِدِينَ",
      "verseStringB": "Then, after them, We sent Moses with Our messages to Pharaoh and his chiefs, but they disbelieved them. See, then, what was the end of the mischief-makers!ᵃ"
    },
    {
      "verseNumber": 104,
      "verseString": "وَقَالَ مُوسَىٰ يَا فِرْعَوْنُ إِنِّي رَسُولٌ مِنْ رَبِّ الْعَالَمِينَ",
      "verseStringB": "And Moses said: O Pharaoh, surely I am a messenger from the Lord of the worlds,"
    },
    {
      "verseNumber": 105,
      "verseString": "حَقِيقٌ عَلَىٰ أَنْ لَا أَقُولَ عَلَى اللَّهِ إِلَّا الْحَقَّ ۚ قَدْ جِئْتُكُمْ بِبَيِّنَةٍ مِنْ رَبِّكُمْ فَأَرْسِلْ مَعِيَ بَنِي إِسْرَائِيلَ",
      "verseStringB": "Worthy of not saying anything about Allāh except the truth. I have come to you indeed with clear proof from your Lord, so let the Children of Israel go with me."
    },
    {
      "verseNumber": 106,
      "verseString": "قَالَ إِنْ كُنْتَ جِئْتَ بِآيَةٍ فَأْتِ بِهَا إِنْ كُنْتَ مِنَ الصَّادِقِينَ",
      "verseStringB": "He said: If thou hast come with a sign, produce it, if thou art truthful."
    },
    {
      "verseNumber": 107,
      "verseString": "فَأَلْقَىٰ عَصَاهُ فَإِذَا هِيَ ثُعْبَانٌ مُبِينٌ",
      "verseStringB": "So he threw his rod, then lo! it was a serpent manifest."
    },
    {
      "verseNumber": 108,
      "verseString": "وَنَزَعَ يَدَهُ فَإِذَا هِيَ بَيْضَاءُ لِلنَّاظِرِينَ",
      "verseStringB": "And he drew forth his hand, and lo! it was white to the beholders.ᵃ"
    },
    {
      "verseNumber": 109,
      "verseString": "قَالَ الْمَلَأُ مِنْ قَوْمِ فِرْعَوْنَ إِنَّ هَٰذَا لَسَاحِرٌ عَلِيمٌ",
      "verseStringB": "The chiefs of Pharaoh’s people said: Surely this is a skilful enchanter!"
    },
    {
      "verseNumber": 110,
      "verseString": "يُرِيدُ أَنْ يُخْرِجَكُمْ مِنْ أَرْضِكُمْ ۖ فَمَاذَا تَأْمُرُونَ",
      "verseStringB": "He intends to turn you out of your land. What do you advise?ᵃ"
    },
    {
      "verseNumber": 111,
      "verseString": "قَالُوا أَرْجِهْ وَأَخَاهُ وَأَرْسِلْ فِي الْمَدَائِنِ حَاشِرِينَ",
      "verseStringB": "They said: Put him off and his brother, and send summoners into the cities,"
    },
    {
      "verseNumber": 112,
      "verseString": "يَأْتُوكَ بِكُلِّ سَاحِرٍ عَلِيمٍ",
      "verseStringB": "To bring to thee every skilful enchanter."
    },
    {
      "verseNumber": 113,
      "verseString": "وَجَاءَ السَّحَرَةُ فِرْعَوْنَ قَالُوا إِنَّ لَنَا لَأَجْرًا إِنْ كُنَّا نَحْنُ الْغَالِبِينَ",
      "verseStringB": "And the enchanters came to Pharaoh, saying: We must surely have a reward if we prevail.ᵃ"
    },
    {
      "verseNumber": 114,
      "verseString": "قَالَ نَعَمْ وَإِنَّكُمْ لَمِنَ الْمُقَرَّبِينَ",
      "verseStringB": "He said: Yes, and you shall certainly be of those who are near (to me)."
    },
    {
      "verseNumber": 115,
      "verseString": "قَالُوا يَا مُوسَىٰ إِمَّا أَنْ تُلْقِيَ وَإِمَّا أَنْ نَكُونَ نَحْنُ الْمُلْقِينَ",
      "verseStringB": "They said: O Moses, wilt thou cast, or shall we (be the first to) cast?"
    },
    {
      "verseNumber": 116,
      "verseString": "قَالَ أَلْقُوا ۖ فَلَمَّا أَلْقَوْا سَحَرُوا أَعْيُنَ النَّاسِ وَاسْتَرْهَبُوهُمْ وَجَاءُوا بِسِحْرٍ عَظِيمٍ",
      "verseStringB": "He said: Cast. So when they cast, they deceived the people’s eyes and overawed them, and they produced a mighty enchantment."
    },
    {
      "verseNumber": 117,
      "verseString": "وَأَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنْ أَلْقِ عَصَاكَ ۖ فَإِذَا هِيَ تَلْقَفُ مَا يَأْفِكُونَ",
      "verseStringB": "And We revealed to Moses: Cast thy rod. Then lo! it swallowed up their lies.ᵃ"
    },
    {
      "verseNumber": 118,
      "verseString": "فَوَقَعَ الْحَقُّ وَبَطَلَ مَا كَانُوا يَعْمَلُونَ",
      "verseStringB": "So the truth was established, and that which they did became null."
    },
    {
      "verseNumber": 119,
      "verseString": "فَغُلِبُوا هُنَالِكَ وَانْقَلَبُوا صَاغِرِينَ",
      "verseStringB": "There they were vanquished, and they went back abased."
    },
    {
      "verseNumber": 120,
      "verseString": "وَأُلْقِيَ السَّحَرَةُ سَاجِدِينَ",
      "verseStringB": "And the enchanters fell down prostrate —"
    },
    {
      "verseNumber": 121,
      "verseString": "قَالُوا آمَنَّا بِرَبِّ الْعَالَمِينَ",
      "verseStringB": "They said: We believe in the Lord of the worlds,"
    },
    {
      "verseNumber": 122,
      "verseString": "رَبِّ مُوسَىٰ وَهَارُونَ",
      "verseStringB": "The Lord of Moses and Aaron."
    },
    {
      "verseNumber": 123,
      "verseString": "قَالَ فِرْعَوْنُ آمَنْتُمْ بِهِ قَبْلَ أَنْ آذَنَ لَكُمْ ۖ إِنَّ هَٰذَا لَمَكْرٌ مَكَرْتُمُوهُ فِي الْمَدِينَةِ لِتُخْرِجُوا مِنْهَا أَهْلَهَا ۖ فَسَوْفَ تَعْلَمُونَ",
      "verseStringB": "Pharaoh said: You believe in Him before I give you permission! Surely this is a plot which you have plotted in the city, to turn out of it its people, but you shall know!"
    },
    {
      "verseNumber": 124,
      "verseString": "لَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُمْ مِنْ خِلَافٍ ثُمَّ لَأُصَلِّبَنَّكُمْ أَجْمَعِينَ",
      "verseStringB": "I shall certainly cut off your hands and your feet on opposite sides, then I shall crucify you all together!"
    },
    {
      "verseNumber": 125,
      "verseString": "قَالُوا إِنَّا إِلَىٰ رَبِّنَا مُنْقَلِبُونَ",
      "verseStringB": "They said: Surely to our Lord do we return."
    },
    {
      "verseNumber": 126,
      "verseString": "وَمَا تَنْقِمُ مِنَّا إِلَّا أَنْ آمَنَّا بِآيَاتِ رَبِّنَا لَمَّا جَاءَتْنَا ۚ رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ",
      "verseStringB": "And thou takest revenge on us only because we believed in the messages of our Lord when they came to us. Our Lord, pour out on us patience and cause us to die in submission (to Thee)!ᵃ"
    },
    {
      "verseNumber": 127,
      "verseString": "وَقَالَ الْمَلَأُ مِنْ قَوْمِ فِرْعَوْنَ أَتَذَرُ مُوسَىٰ وَقَوْمَهُ لِيُفْسِدُوا فِي الْأَرْضِ وَيَذَرَكَ وَآلِهَتَكَ ۚ قَالَ سَنُقَتِّلُ أَبْنَاءَهُمْ وَنَسْتَحْيِي نِسَاءَهُمْ وَإِنَّا فَوْقَهُمْ قَاهِرُونَ",
      "verseStringB": "And the chiefs of Pharaoh’s people said: Wilt thou leave Moses and his people to make mischief in the land and forsake thee and thy gods? He said: We will slay their sons and spare their women, and surely we are domInᵃ nt over them.ᵃ"
    },
    {
      "verseNumber": 128,
      "verseString": "قَالَ مُوسَىٰ لِقَوْمِهِ اسْتَعِينُوا بِاللَّهِ وَاصْبِرُوا ۖ إِنَّ الْأَرْضَ لِلَّهِ يُورِثُهَا مَنْ يَشَاءُ مِنْ عِبَادِهِ ۖ وَالْعَاقِبَةُ لِلْمُتَّقِينَ",
      "verseStringB": "Moses said to his people: Ask help from Allah and be patient. Surely the land is Allāh’s — He gives it for an inheritance to such of His servants as He pleases. And the end is for those who keep their duty."
    },
    {
      "verseNumber": 129,
      "verseString": "قَالُوا أُوذِينَا مِنْ قَبْلِ أَنْ تَأْتِيَنَا وَمِنْ بَعْدِ مَا جِئْتَنَا ۚ قَالَ عَسَىٰ رَبُّكُمْ أَنْ يُهْلِكَ عَدُوَّكُمْ وَيَسْتَخْلِفَكُمْ فِي الْأَرْضِ فَيَنْظُرَ كَيْفَ تَعْمَلُونَ",
      "verseStringB": "They said: We were persecuted before thou camest to us and since thou hast come to us. He said: It may be that your Lord will destroy your enemy and make you rulers in the land, then He will see how you act.ᵃ"
    },
    {
      "verseNumber": 130,
      "verseString": "وَلَقَدْ أَخَذْنَا آلَ فِرْعَوْنَ بِالسِّنِينَ وَنَقْصٍ مِنَ الثَّمَرَاتِ لَعَلَّهُمْ يَذَّكَّرُونَ",
      "verseStringB": "And certainly We overtook Pharaoh’s people with droughts and diminution of fruits that they might be mindful."
    },
    {
      "verseNumber": 131,
      "verseString": "فَإِذَا جَاءَتْهُمُ الْحَسَنَةُ قَالُوا لَنَا هَٰذِهِ ۖ وَإِنْ تُصِبْهُمْ سَيِّئَةٌ يَطَّيَّرُوا بِمُوسَىٰ وَمَنْ مَعَهُ ۗ أَلَا إِنَّمَا طَائِرُهُمْ عِنْدَ اللَّهِ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
      "verseStringB": "But when good befell them they said: This is due to us. And when evil afflicted them, they attributed it to the ill-luck of Moses and those with him. Surely their evil fortune is only from Allāh, but most of them know not.ᵃ"
    },
    {
      "verseNumber": 132,
      "verseString": "وَقَالُوا مَهْمَا تَأْتِنَا بِهِ مِنْ آيَةٍ لِتَسْحَرَنَا بِهَا فَمَا نَحْنُ لَكَ بِمُؤْمِنِينَ",
      "verseStringB": "And they said: Whatever sign thou mayest bring to us to charm us therewith — we shall not believe in thee."
    },
    {
      "verseNumber": 133,
      "verseString": "فَأَرْسَلْنَا عَلَيْهِمُ الطُّوفَانَ وَالْجَرَادَ وَالْقُمَّلَ وَالضَّفَادِعَ وَالدَّمَ آيَاتٍ مُفَصَّلَاتٍ فَاسْتَكْبَرُوا وَكَانُوا قَوْمًا مُجْرِمِينَ",
      "verseStringB": "So We sent upon them widespread death,ᵃ and the locusts and the lice and the frogs and the blood — clear signs.ᵇ But they behaved haught ily and they were a guilty people."
    },
    {
      "verseNumber": 134,
      "verseString": "وَلَمَّا وَقَعَ عَلَيْهِمُ الرِّجْزُ قَالُوا يَا مُوسَى ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِنْدَكَ ۖ لَئِنْ كَشَفْتَ عَنَّا الرِّجْزَ لَنُؤْمِنَنَّ لَكَ وَلَنُرْسِلَنَّ مَعَكَ بَنِي إِسْرَائِيلَ",
      "verseStringB": "And when the plaguea fell upon them, they said: O Moses, pray for us to thy Lord as He has made promise with thee. If thou remove the plague from us, we will certainly believe in thee and will let the Children of Israel go with thee."
    },
    {
      "verseNumber": 135,
      "verseString": "فَلَمَّا كَشَفْنَا عَنْهُمُ الرِّجْزَ إِلَىٰ أَجَلٍ هُمْ بَالِغُوهُ إِذَا هُمْ يَنْكُثُونَ",
      "verseStringB": "But when We removed the plague from them till a term which they should attain, lo! they broke (their promise).ᵃ"
    },
    {
      "verseNumber": 136,
      "verseString": "فَانْتَقَمْنَا مِنْهُمْ فَأَغْرَقْنَاهُمْ فِي الْيَمِّ بِأَنَّهُمْ كَذَّبُوا بِآيَاتِنَا وَكَانُوا عَنْهَا غَافِلِينَ",
      "verseStringB": "So We exacted retribution from them and drowned them in the sea, because they rejected Our signs and were heedless of them."
    },
    {
      "verseNumber": 137,
      "verseString": "وَأَوْرَثْنَا الْقَوْمَ الَّذِينَ كَانُوا يُسْتَضْعَفُونَ مَشَارِقَ الْأَرْضِ وَمَغَارِبَهَا الَّتِي بَارَكْنَا فِيهَا ۖ وَتَمَّتْ كَلِمَتُ رَبِّكَ الْحُسْنَىٰ عَلَىٰ بَنِي إِسْرَائِيلَ بِمَا صَبَرُوا ۖ وَدَمَّرْنَا مَا كَانَ يَصْنَعُ فِرْعَوْنُ وَقَوْمُهُ وَمَا كَانُوا يَعْرِشُونَ",
      "verseStringB": "And We made the people who were deemed weak to inherit the eastern lands and the western ones which We had blessed. And the good word of thy Lord was fulfilled in the Children of Israel — because of their patience. And We destroyed what Pharaoh and his people had wrought and what they had built.ᵃ"
    },
    {
      "verseNumber": 138,
      "verseString": "وَجَاوَزْنَا بِبَنِي إِسْرَائِيلَ الْبَحْرَ فَأَتَوْا عَلَىٰ قَوْمٍ يَعْكُفُونَ عَلَىٰ أَصْنَامٍ لَهُمْ ۚ قَالُوا يَا مُوسَى اجْعَلْ لَنَا إِلَٰهًا كَمَا لَهُمْ آلِهَةٌ ۚ قَالَ إِنَّكُمْ قَوْمٌ تَجْهَلُونَ",
      "verseStringB": "And We took the Children of Israel across the sea. Then they came to a people who were devoted to their idols. They said: O Moses, make for us a god as they have gods. He said: Surely you are an ignorant people!ᵃ"
    },
    {
      "verseNumber": 139,
      "verseString": "إِنَّ هَٰؤُلَاءِ مُتَبَّرٌ مَا هُمْ فِيهِ وَبَاطِلٌ مَا كَانُوا يَعْمَلُونَ",
      "verseStringB": "(As to) these, that wherein they are engaged shall be destroyed and that which they do is vain."
    },
    {
      "verseNumber": 140,
      "verseString": "قَالَ أَغَيْرَ اللَّهِ أَبْغِيكُمْ إِلَٰهًا وَهُوَ فَضَّلَكُمْ عَلَى الْعَالَمِينَ",
      "verseStringB": "He said: Shall I seek for you a god other than Allāh, while He has made you excel (all) created things?ᵃ"
    },
    {
      "verseNumber": 141,
      "verseString": "وَإِذْ أَنْجَيْنَاكُمْ مِنْ آلِ فِرْعَوْنَ يَسُومُونَكُمْ سُوءَ الْعَذَابِ ۖ يُقَتِّلُونَ أَبْنَاءَكُمْ وَيَسْتَحْيُونَ نِسَاءَكُمْ ۚ وَفِي ذَٰلِكُمْ بَلَاءٌ مِنْ رَبِّكُمْ عَظِيمٌ",
      "verseStringB": "And when We delivered you from Pharaoh’s people, who subjected you to severe torment, killing your sons and sparing your women. And therein was a great trial from your Lord."
    },
    {
      "verseNumber": 142,
      "verseString": "وَوَاعَدْنَا مُوسَىٰ ثَلَاثِينَ لَيْلَةً وَأَتْمَمْنَاهَا بِعَشْرٍ فَتَمَّ مِيقَاتُ رَبِّهِ أَرْبَعِينَ لَيْلَةً ۚ وَقَالَ مُوسَىٰ لِأَخِيهِ هَارُونَ اخْلُفْنِي فِي قَوْمِي وَأَصْلِحْ وَلَا تَتَّبِعْ سَبِيلَ الْمُفْسِدِينَ",
      "verseStringB": "And We appointed for Moses thirty nights, and completed them with ten, so the appointed time of his Lord was complete forty nights. And Moses said to his brother Aaron: Take my place among my people, and act well and follow not the way of the mischief-makers."
    },
    {
      "verseNumber": 143,
      "verseString": "وَلَمَّا جَاءَ مُوسَىٰ لِمِيقَاتِنَا وَكَلَّمَهُ رَبُّهُ قَالَ رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ ۚ قَالَ لَنْ تَرَانِي وَلَٰكِنِ انْظُرْ إِلَى الْجَبَلِ فَإِنِ اسْتَقَرَّ مَكَانَهُ فَسَوْفَ تَرَانِي ۚ فَلَمَّا تَجَلَّىٰ رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا وَخَرَّ مُوسَىٰ صَعِقًا ۚ فَلَمَّا أَفَاقَ قَالَ سُبْحَانَكَ تُبْتُ إِلَيْكَ وَأَنَا أَوَّلُ الْمُؤْمِنِينَ",
      "verseStringB": "And when Moses came at Our appointed time and his Lord spoke to him, he said: My Lord, show me (Thyself) so that I may look at Thee. He said: Thou canst not see Me; but look at the mountain; if it remains firm in its place, then wilt thou see Me. So when his Lord manifested His glory to the mountain, He made it crumble and Moses fell down in a swoon. Then when he recovered, he said: Glory be to Thee! I turn to Thee, and I am the first of the believers.ᵃ"
    },
    {
      "verseNumber": 144,
      "verseString": "قَالَ يَا مُوسَىٰ إِنِّي اصْطَفَيْتُكَ عَلَى النَّاسِ بِرِسَالَاتِي وَبِكَلَامِي فَخُذْ مَا آتَيْتُكَ وَكُنْ مِنَ الشَّاكِرِينَ",
      "verseStringB": "He said: O Moses, surely I have chosen thee above the people by My messages and My words. So take hold of what I give thee and be of the grateful."
    },
    {
      "verseNumber": 145,
      "verseString": "وَكَتَبْنَا لَهُ فِي الْأَلْوَاحِ مِنْ كُلِّ شَيْءٍ مَوْعِظَةً وَتَفْصِيلًا لِكُلِّ شَيْءٍ فَخُذْهَا بِقُوَّةٍ وَأْمُرْ قَوْمَكَ يَأْخُذُوا بِأَحْسَنِهَا ۚ سَأُرِيكُمْ دَارَ الْفَاسِقِينَ",
      "verseStringB": "And We ordaineda for him in the tablets admonition of every kind and clear explanation of all things. So take hold of them with firmness and enjoin thy people to take hold of what is best thereof. I shall show you the abode of the transgressors.ᵇ"
    },
    {
      "verseNumber": 146,
      "verseString": "سَأَصْرِفُ عَنْ آيَاتِيَ الَّذِينَ يَتَكَبَّرُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَإِنْ يَرَوْا كُلَّ آيَةٍ لَا يُؤْمِنُوا بِهَا وَإِنْ يَرَوْا سَبِيلَ الرُّشْدِ لَا يَتَّخِذُوهُ سَبِيلًا وَإِنْ يَرَوْا سَبِيلَ الْغَيِّ يَتَّخِذُوهُ سَبِيلًا ۚ ذَٰلِكَ بِأَنَّهُمْ كَذَّبُوا بِآيَاتِنَا وَكَانُوا عَنْهَا غَافِلِينَ",
      "verseStringB": "I shall turn away from My messages those who are unjustly proud in the earth. And if they see every sign, they will not believe in it; and if they see the way of rectitude, they take it not for a way; and if they see the way of error, they take it for a way. This is because they reject Our messages and are heedless of them."
    },
    {
      "verseNumber": 147,
      "verseString": "وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا وَلِقَاءِ الْآخِرَةِ حَبِطَتْ أَعْمَالُهُمْ ۚ هَلْ يُجْزَوْنَ إِلَّا مَا كَانُوا يَعْمَلُونَ",
      "verseStringB": "And those who reject Our messages and the meeting of the Hereafter — their deeds are fruitless. Can they be rewarded except for what they do?"
    },
    {
      "verseNumber": 148,
      "verseString": "وَاتَّخَذَ قَوْمُ مُوسَىٰ مِنْ بَعْدِهِ مِنْ حُلِيِّهِمْ عِجْلًا جَسَدًا لَهُ خُوَارٌ ۚ أَلَمْ يَرَوْا أَنَّهُ لَا يُكَلِّمُهُمْ وَلَا يَهْدِيهِمْ سَبِيلًا ۘ اتَّخَذُوهُ وَكَانُوا ظَالِمِينَ",
      "verseStringB": "And Moses’ people made of their ornaments a calf after him — a (lifeless) body,ᵃ having a lowing sound. Could they not see that it spoke not to them, nor guided them in the way? They took it (for worship) and they were unjust."
    },
    {
      "verseNumber": 149,
      "verseString": "وَلَمَّا سُقِطَ فِي أَيْدِيهِمْ وَرَأَوْا أَنَّهُمْ قَدْ ضَلُّوا قَالُوا لَئِنْ لَمْ يَرْحَمْنَا رَبُّنَا وَيَغْفِرْ لَنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
      "verseStringB": "And when they repenteda and saw that they had gone astray, they said: If our Lord have not mercy on us and forgive us, we shall certainly be of the losers."
    },
    {
      "verseNumber": 150,
      "verseString": "وَلَمَّا رَجَعَ مُوسَىٰ إِلَىٰ قَوْمِهِ غَضْبَانَ أَسِفًا قَالَ بِئْسَمَا خَلَفْتُمُونِي مِنْ بَعْدِي ۖ أَعَجِلْتُمْ أَمْرَ رَبِّكُمْ ۖ وَأَلْقَى الْأَلْوَاحَ وَأَخَذَ بِرَأْسِ أَخِيهِ يَجُرُّهُ إِلَيْهِ ۚ قَالَ ابْنَ أُمَّ إِنَّ الْقَوْمَ اسْتَضْعَفُونِي وَكَادُوا يَقْتُلُونَنِي فَلَا تُشْمِتْ بِيَ الْأَعْدَاءَ وَلَا تَجْعَلْنِي مَعَ الْقَوْمِ الظَّالِمِينَ",
      "verseStringB": "And when Moses returned to his people, wrathful, grieved, he said: Evil is that which you have done after me! Did you hasten on the judgment of your Lord? a And he threw down the tablets and seized his brother by the head, dragging him towards him. He said: Son of my mother, the people reckoned me weak and had well-nigh slain me. So make not the enemies to rejoice over me and count me not among the unjust people."
    },
    {
      "verseNumber": 151,
      "verseString": "قَالَ رَبِّ اغْفِرْ لِي وَلِأَخِي وَأَدْخِلْنَا فِي رَحْمَتِكَ ۖ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ",
      "verseStringB": "He said: My Lord, forgive me and my brother, and admit us to Thy mercy, and Thou art the Most Merciful of those who show mercy.ᵃ"
    },
    {
      "verseNumber": 152,
      "verseString": "إِنَّ الَّذِينَ اتَّخَذُوا الْعِجْلَ سَيَنَالُهُمْ غَضَبٌ مِنْ رَبِّهِمْ وَذِلَّةٌ فِي الْحَيَاةِ الدُّنْيَا ۚ وَكَذَٰلِكَ نَجْزِي الْمُفْتَرِينَ",
      "verseStringB": "Those who took the calf (for a god) — wrath from their Lord, and disgrace in this world’s life, will surely overtake them. And thus do We recompense those who invent lies."
    },
    {
      "verseNumber": 153,
      "verseString": "وَالَّذِينَ عَمِلُوا السَّيِّئَاتِ ثُمَّ تَابُوا مِنْ بَعْدِهَا وَآمَنُوا إِنَّ رَبَّكَ مِنْ بَعْدِهَا لَغَفُورٌ رَحِيمٌ",
      "verseStringB": "And those who do evil deeds, then repent after that and believe — thy Lord after that is surely Forgiving, Merciful."
    },
    {
      "verseNumber": 154,
      "verseString": "وَلَمَّا سَكَتَ عَنْ مُوسَى الْغَضَبُ أَخَذَ الْأَلْوَاحَ ۖ وَفِي نُسْخَتِهَا هُدًى وَرَحْمَةٌ لِلَّذِينَ هُمْ لِرَبِّهِمْ يَرْهَبُونَ",
      "verseStringB": "And when Moses’ anger calmed down, he took up the tablets; and in the writing thereof was guidance and mercy for those who fear their Lord.ᵃ"
    },
    {
      "verseNumber": 155,
      "verseString": "وَاخْتَارَ مُوسَىٰ قَوْمَهُ سَبْعِينَ رَجُلًا لِمِيقَاتِنَا ۖ فَلَمَّا أَخَذَتْهُمُ الرَّجْفَةُ قَالَ رَبِّ لَوْ شِئْتَ أَهْلَكْتَهُمْ مِنْ قَبْلُ وَإِيَّايَ ۖ أَتُهْلِكُنَا بِمَا فَعَلَ السُّفَهَاءُ مِنَّا ۖ إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِهَا مَنْ تَشَاءُ وَتَهْدِي مَنْ تَشَاءُ ۖ أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا ۖ وَأَنْتَ خَيْرُ الْغَافِرِينَ",
      "verseStringB": "And Moses chose of his people seventy men for Our appointment.ᵃ So when the earthquake overtook them, he said: My Lord, if Thou hadst pleased, Thou hadst destroyed them before and myself (too). Wilt Thou destroy us for that which the foolish among us have done? It is naught but Thy trial. Thou causest to perish thereby whom Thou pleasest and guidest whom Thou pleasest. Thou art our Protector, so forgive us and have mercy on us, and Thou art the Best of those who forgive."
    },
    {
      "verseNumber": 156,
      "verseString": "وَاكْتُبْ لَنَا فِي هَٰذِهِ الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ إِنَّا هُدْنَا إِلَيْكَ ۚ قَالَ عَذَابِي أُصِيبُ بِهِ مَنْ أَشَاءُ ۖ وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ ۚ فَسَأَكْتُبُهَا لِلَّذِينَ يَتَّقُونَ وَيُؤْتُونَ الزَّكَاةَ وَالَّذِينَ هُمْ بِآيَاتِنَا يُؤْمِنُونَ",
      "verseStringB": "And ordain for us good in this world’s life and in the Hereafter, for surely we turn to Thee. He said: I afflict with My chastisement whom I please, and My mercy encompasses all things. So I ordain it for those who keep their duty and pay the poor-rate, and those who believe in Our messagesa—"
    },
    {
      "verseNumber": 157,
      "verseString": "الَّذِينَ يَتَّبِعُونَ الرَّسُولَ النَّبِيَّ الْأُمِّيَّ الَّذِي يَجِدُونَهُ مَكْتُوبًا عِنْدَهُمْ فِي التَّوْرَاةِ وَالْإِنْجِيلِ يَأْمُرُهُمْ بِالْمَعْرُوفِ وَيَنْهَاهُمْ عَنِ الْمُنْكَرِ وَيُحِلُّ لَهُمُ الطَّيِّبَاتِ وَيُحَرِّمُ عَلَيْهِمُ الْخَبَائِثَ وَيَضَعُ عَنْهُمْ إِصْرَهُمْ وَالْأَغْلَالَ الَّتِي كَانَتْ عَلَيْهِمْ ۚ فَالَّذِينَ آمَنُوا بِهِ وَعَزَّرُوهُ وَنَصَرُوهُ وَاتَّبَعُوا النُّورَ الَّذِي أُنْزِلَ مَعَهُ ۙ أُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
      "verseStringB": "Those who follow the Messenger-Prophet, the Ummi,ᵃ whom they find mentioned in the Torah and the Gospel.ᵇ He enjoins them good and forbids them evil, and makes lawful to them the good things and prohibits for them impure things, and removes from them their burden and the shackles which were on them. So those who believe in him and honour him and help him,ᶜ and follow the light which has been sent down with him — these are the successful."
    },
    {
      "verseNumber": 158,
      "verseString": "قُلْ يَا أَيُّهَا النَّاسُ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ جَمِيعًا الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۖ لَا إِلَٰهَ إِلَّا هُوَ يُحْيِي وَيُمِيتُ ۖ فَآمِنُوا بِاللَّهِ وَرَسُولِهِ النَّبِيِّ الْأُمِّيِّ الَّذِي يُؤْمِنُ بِاللَّهِ وَكَلِمَاتِهِ وَاتَّبِعُوهُ لَعَلَّكُمْ تَهْتَدُونَ",
      "verseStringB": "Say: O mankind, surely I am the Messenger of Allāh to you all, of Him, Whose is the kingdom of the heavens and the earth.ᵃ There is no god but He; He gives life and causes death. So believe in Allāh and His Messenger, the Ummi Prophet who believes in Allāh and His words, and follow him so that you may be guided aright."
    },
    {
      "verseNumber": 159,
      "verseString": "وَمِنْ قَوْمِ مُوسَىٰ أُمَّةٌ يَهْدُونَ بِالْحَقِّ وَبِهِ يَعْدِلُونَ",
      "verseStringB": "And of Moses’ people is a party who guide with truth, and therewith they do justice.ᵃ"
    },
    {
      "verseNumber": 160,
      "verseString": "وَقَطَّعْنَاهُمُ اثْنَتَيْ عَشْرَةَ أَسْبَاطًا أُمَمًا ۚ وَأَوْحَيْنَا إِلَىٰ مُوسَىٰ إِذِ اسْتَسْقَاهُ قَوْمُهُ أَنِ اضْرِبْ بِعَصَاكَ الْحَجَرَ ۖ فَانْبَجَسَتْ مِنْهُ اثْنَتَا عَشْرَةَ عَيْنًا ۖ قَدْ عَلِمَ كُلُّ أُنَاسٍ مَشْرَبَهُمْ ۚ وَظَلَّلْنَا عَلَيْهِمُ الْغَمَامَ وَأَنْزَلْنَا عَلَيْهِمُ الْمَنَّ وَالسَّلْوَىٰ ۖ كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ ۚ وَمَا ظَلَمُونَا وَلَٰكِنْ كَانُوا أَنْفُسَهُمْ يَظْلِمُونَ",
      "verseStringB": "And We divided them into twelve tribes, as nations. And We revealed to Moses when his people asked him for water: Strike the rock with thy staff; so out flowed from it twelve springs. Each tribe knew its drinkingplace. And We made the clouds to give shade over them and We sent to them manna and quails. Eat of the good things We have given you. And they did not do Us any harm, but they wronged themselves."
    },
    {
      "verseNumber": 161,
      "verseString": "وَإِذْ قِيلَ لَهُمُ اسْكُنُوا هَٰذِهِ الْقَرْيَةَ وَكُلُوا مِنْهَا حَيْثُ شِئْتُمْ وَقُولُوا حِطَّةٌ وَادْخُلُوا الْبَابَ سُجَّدًا نَغْفِرْ لَكُمْ خَطِيئَاتِكُمْ ۚ سَنَزِيدُ الْمُحْسِنِينَ",
      "verseStringB": "And when it was said to them: Dwell in this town and eat from it whence you wish, and make petition for forgiveness, and enter the gate submissively, We shall forgive you your wrongs. We shall give more to the doers of good."
    },
    {
      "verseNumber": 162,
      "verseString": "فَبَدَّلَ الَّذِينَ ظَلَمُوا مِنْهُمْ قَوْلًا غَيْرَ الَّذِي قِيلَ لَهُمْ فَأَرْسَلْنَا عَلَيْهِمْ رِجْزًا مِنَ السَّمَاءِ بِمَا كَانُوا يَظْلِمُونَ",
      "verseStringB": "But those who were unjust among them changed it for a word other than that which they were told, so We sent upon them a pestilence from heaven for their wrongdoing.ᵃ"
    },
    {
      "verseNumber": 163,
      "verseString": "وَاسْأَلْهُمْ عَنِ الْقَرْيَةِ الَّتِي كَانَتْ حَاضِرَةَ الْبَحْرِ إِذْ يَعْدُونَ فِي السَّبْتِ إِذْ تَأْتِيهِمْ حِيتَانُهُمْ يَوْمَ سَبْتِهِمْ شُرَّعًا وَيَوْمَ لَا يَسْبِتُونَ ۙ لَا تَأْتِيهِمْ ۚ كَذَٰلِكَ نَبْلُوهُمْ بِمَا كَانُوا يَفْسُقُونَ",
      "verseStringB": "And ask them about the town which stood by the sea. When they violated the Sabbath, when their fish came to them on their Sabbath day on the surface, and when it was not their Sabbath they came not to them. Thus did We try them because they transgressed.ᵃ"
    },
    {
      "verseNumber": 164,
      "verseString": "وَإِذْ قَالَتْ أُمَّةٌ مِنْهُمْ لِمَ تَعِظُونَ قَوْمًا ۙ اللَّهُ مُهْلِكُهُمْ أَوْ مُعَذِّبُهُمْ عَذَابًا شَدِيدًا ۖ قَالُوا مَعْذِرَةً إِلَىٰ رَبِّكُمْ وَلَعَلَّهُمْ يَتَّقُونَ",
      "verseStringB": "And when a party of them said: Why preach you to a people whom Allāh would destroy or whom He would chastise with a severe chastisement? They said: To be free from blame before your Lord, and that haply they may guard against evil"
    },
    {
      "verseNumber": 165,
      "verseString": "فَلَمَّا نَسُوا مَا ذُكِّرُوا بِهِ أَنْجَيْنَا الَّذِينَ يَنْهَوْنَ عَنِ السُّوءِ وَأَخَذْنَا الَّذِينَ ظَلَمُوا بِعَذَابٍ بَئِيسٍ بِمَا كَانُوا يَفْسُقُونَ",
      "verseStringB": "So when they neglected that whereof they had been reminded, We delivered those who forbade evil and We overtook those who were iniquitous with an evil chastisement because they transgressed."
    },
    {
      "verseNumber": 166,
      "verseString": "فَلَمَّا عَتَوْا عَنْ مَا نُهُوا عَنْهُ قُلْنَا لَهُمْ كُونُوا قِرَدَةً خَاسِئِينَ",
      "verseStringB": "So when they revoltingly persisted in that which they had been forbidden, We said to them: Be (as) apes, despised and hated.ᵃ"
    },
    {
      "verseNumber": 167,
      "verseString": "وَإِذْ تَأَذَّنَ رَبُّكَ لَيَبْعَثَنَّ عَلَيْهِمْ إِلَىٰ يَوْمِ الْقِيَامَةِ مَنْ يَسُومُهُمْ سُوءَ الْعَذَابِ ۗ إِنَّ رَبَّكَ لَسَرِيعُ الْعِقَابِ ۖ وَإِنَّهُ لَغَفُورٌ رَحِيمٌ",
      "verseStringB": "And when thy Lord declared that He would send against them to the day of Resurrection those who would subject them to severe torment. Surely thy Lord is Quick in requiting; and surely He is Forgiving, Merciful."
    },
    {
      "verseNumber": 168,
      "verseString": "وَقَطَّعْنَاهُمْ فِي الْأَرْضِ أُمَمًا ۖ مِنْهُمُ الصَّالِحُونَ وَمِنْهُمْ دُونَ ذَٰلِكَ ۖ وَبَلَوْنَاهُمْ بِالْحَسَنَاتِ وَالسَّيِّئَاتِ لَعَلَّهُمْ يَرْجِعُونَ",
      "verseStringB": "And We divided them in the earth into parties — some of them are righteous and some of them are otherwise. And We tried them with blessings and misfortunes that they might turn."
    },
    {
      "verseNumber": 169,
      "verseString": "فَخَلَفَ مِنْ بَعْدِهِمْ خَلْفٌ وَرِثُوا الْكِتَابَ يَأْخُذُونَ عَرَضَ هَٰذَا الْأَدْنَىٰ وَيَقُولُونَ سَيُغْفَرُ لَنَا وَإِنْ يَأْتِهِمْ عَرَضٌ مِثْلُهُ يَأْخُذُوهُ ۚ أَلَمْ يُؤْخَذْ عَلَيْهِمْ مِيثَاقُ الْكِتَابِ أَنْ لَا يَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ وَدَرَسُوا مَا فِيهِ ۗ وَالدَّارُ الْآخِرَةُ خَيْرٌ لِلَّذِينَ يَتَّقُونَ ۗ أَفَلَا تَعْقِلُونَ",
      "verseStringB": "Then after them came an evil posteritya who inherited the Book, taking the frail goods of this low life and saying: It will be forgiven us. And if the like good came to them, they would take it (too).ᵇ Was not a promise taken from them in the Book that they would not speak anything about Allāh but the truth? And they study what is in it. And the abode of the Hereafter is better for those who keep their duty. Do you not then understand?"
    },
    {
      "verseNumber": 170,
      "verseString": "وَالَّذِينَ يُمَسِّكُونَ بِالْكِتَابِ وَأَقَامُوا الصَّلَاةَ إِنَّا لَا نُضِيعُ أَجْرَ الْمُصْلِحِينَ",
      "verseStringB": "And as for those who hold fast by the Book and keep up prayer — surely We waste not the reward of the reformers."
    },
    {
      "verseNumber": 171,
      "verseString": "وَإِذْ نَتَقْنَا الْجَبَلَ فَوْقَهُمْ كَأَنَّهُ ظُلَّةٌ وَظَنُّوا أَنَّهُ وَاقِعٌ بِهِمْ خُذُوا مَا آتَيْنَاكُمْ بِقُوَّةٍ وَاذْكُرُوا مَا فِيهِ لَعَلَّكُمْ تَتَّقُونَ",
      "verseStringB": "And when We shook the mountain over them as if it were a covering, and they thought that it was going to fall down upon them: Hold on firmly that which We have given you, and be mindful of that which is in it, so that you may guard against evil.ᵃ"
    },
    {
      "verseNumber": 172,
      "verseString": "وَإِذْ أَخَذَ رَبُّكَ مِنْ بَنِي آدَمَ مِنْ ظُهُورِهِمْ ذُرِّيَّتَهُمْ وَأَشْهَدَهُمْ عَلَىٰ أَنْفُسِهِمْ أَلَسْتُ بِرَبِّكُمْ ۖ قَالُوا بَلَىٰ ۛ شَهِدْنَا ۛ أَنْ تَقُولُوا يَوْمَ الْقِيَامَةِ إِنَّا كُنَّا عَنْ هَٰذَا غَافِلِينَ",
      "verseStringB": "And when thy Lord brought forth from the children of Adam, from their loins, their descendants, and made them bear witness about themselves: Am I not your Lord? They said: Yes; we bear witness. Lest you should say on the day of Resurrection: We were unaware of this,ᵃ"
    },
    {
      "verseNumber": 173,
      "verseString": "أَوْ تَقُولُوا إِنَّمَا أَشْرَكَ آبَاؤُنَا مِنْ قَبْلُ وَكُنَّا ذُرِّيَّةً مِنْ بَعْدِهِمْ ۖ أَفَتُهْلِكُنَا بِمَا فَعَلَ الْمُبْطِلُونَ",
      "verseStringB": "Or (lest) you should say: Only our fathers ascribed partners (to Allāh) before (us), and we were (their) descendants after them. Wilt Thou destroy us for what liars did?ᵃ"
    },
    {
      "verseNumber": 174,
      "verseString": "وَكَذَٰلِكَ نُفَصِّلُ الْآيَاتِ وَلَعَلَّهُمْ يَرْجِعُونَ",
      "verseStringB": "And thus do We make the messages clear, and that haply they may return."
    },
    {
      "verseNumber": 175,
      "verseString": "وَاتْلُ عَلَيْهِمْ نَبَأَ الَّذِي آتَيْنَاهُ آيَاتِنَا فَانْسَلَخَ مِنْهَا فَأَتْبَعَهُ الشَّيْطَانُ فَكَانَ مِنَ الْغَاوِينَ",
      "verseStringB": "And recite to them the news of him to whom We give Our messages, but he withdraws himself from them, so the devil follows him up, and he is of those who perish.ᵃ"
    },
    {
      "verseNumber": 176,
      "verseString": "وَلَوْ شِئْنَا لَرَفَعْنَاهُ بِهَا وَلَٰكِنَّهُ أَخْلَدَ إِلَى الْأَرْضِ وَاتَّبَعَ هَوَاهُ ۚ فَمَثَلُهُ كَمَثَلِ الْكَلْبِ إِنْ تَحْمِلْ عَلَيْهِ يَلْهَثْ أَوْ تَتْرُكْهُ يَلْهَثْ ۚ ذَٰلِكَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِنَا ۚ فَاقْصُصِ الْقَصَصَ لَعَلَّهُمْ يَتَفَكَّرُونَ",
      "verseStringB": "And if We had pleased, We would have exalted him thereby; but he clings to the eartha and follows his low desire. His parable is as the parable of the dog — if thou drive him away, he lolls out his tongue, and if thou leave him alone, he lolls out his tongue. Such is the parable of the people who reject Our messages. So relate the narrative that they may reflect."
    },
    {
      "verseNumber": 177,
      "verseString": "سَاءَ مَثَلًا الْقَوْمُ الَّذِينَ كَذَّبُوا بِآيَاتِنَا وَأَنْفُسَهُمْ كَانُوا يَظْلِمُونَ",
      "verseStringB": "Evil is the likeness of the people who reject Our messages and wrong their own souls."
    },
    {
      "verseNumber": 178,
      "verseString": "مَنْ يَهْدِ اللَّهُ فَهُوَ الْمُهْتَدِي ۖ وَمَنْ يُضْلِلْ فَأُولَٰئِكَ هُمُ الْخَاسِرُونَ",
      "verseStringB": "He whom Allāh guides is on the right way; and he whom He leaves in error — they are the losers."
    },
    {
      "verseNumber": 179,
      "verseString": "وَلَقَدْ ذَرَأْنَا لِجَهَنَّمَ كَثِيرًا مِنَ الْجِنِّ وَالْإِنْسِ ۖ لَهُمْ قُلُوبٌ لَا يَفْقَهُونَ بِهَا وَلَهُمْ أَعْيُنٌ لَا يُبْصِرُونَ بِهَا وَلَهُمْ آذَانٌ لَا يَسْمَعُونَ بِهَا ۚ أُولَٰئِكَ كَالْأَنْعَامِ بَلْ هُمْ أَضَلُّ ۚ أُولَٰئِكَ هُمُ الْغَافِلُونَ",
      "verseStringB": "And certainly We have created for hell many of the jinn and the men — they have hearts wherewith they understand not, and they have eyes wherewith they see not, and they have ears wherewith they hear not. They are as cattle; nay, they are more astray. These are the heedless ones.ᵃ"
    },
    {
      "verseNumber": 180,
      "verseString": "وَلِلَّهِ الْأَسْمَاءُ الْحُسْنَىٰ فَادْعُوهُ بِهَا ۖ وَذَرُوا الَّذِينَ يُلْحِدُونَ فِي أَسْمَائِهِ ۚ سَيُجْزَوْنَ مَا كَانُوا يَعْمَلُونَ",
      "verseStringB": "And Allāh’s are the best names,ᵃ so call on Him thereby and leave alone those who violate the sanctityb of His names. They will be recompensed for what they do."
    },
    {
      "verseNumber": 181,
      "verseString": "وَمِمَّنْ خَلَقْنَا أُمَّةٌ يَهْدُونَ بِالْحَقِّ وَبِهِ يَعْدِلُونَ",
      "verseStringB": "And of those whom We have created is a communitya who guide with the truth and therewith do justice."
    },
    {
      "verseNumber": 182,
      "verseString": "وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ",
      "verseStringB": "And those who reject Our messages — We lead them (to destruction) step by step from whence they know not."
    },
    {
      "verseNumber": 183,
      "verseString": "وَأُمْلِي لَهُمْ ۚ إِنَّ كَيْدِي مَتِينٌ",
      "verseStringB": "And I grant them respite. Surely My scheme is effective.ᵃ"
    },
    {
      "verseNumber": 184,
      "verseString": "أَوَلَمْ يَتَفَكَّرُوا ۗ مَا بِصَاحِبِهِمْ مِنْ جِنَّةٍ ۚ إِنْ هُوَ إِلَّا نَذِيرٌ مُبِينٌ",
      "verseStringB": "Do they not reflect (that) there is no madness in their companion? He is only a plain warner."
    },
    {
      "verseNumber": 185,
      "verseString": "أَوَلَمْ يَنْظُرُوا فِي مَلَكُوتِ السَّمَاوَاتِ وَالْأَرْضِ وَمَا خَلَقَ اللَّهُ مِنْ شَيْءٍ وَأَنْ عَسَىٰ أَنْ يَكُونَ قَدِ اقْتَرَبَ أَجَلُهُمْ ۖ فَبِأَيِّ حَدِيثٍ بَعْدَهُ يُؤْمِنُونَ",
      "verseStringB": "Do they not consider the kingdom of the heavens and the earth and what things Allāh has created, and that it may be that their doom has drawn nigh? In what announcement after this will they then believe?"
    },
    {
      "verseNumber": 186,
      "verseString": "مَنْ يُضْلِلِ اللَّهُ فَلَا هَادِيَ لَهُ ۚ وَيَذَرُهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ",
      "verseStringB": "Whomsoever Allāh leaves in error, there is no guide for him. And He leaves them alone in their inordInᵃ cy, blindly wandering on."
    },
    {
      "verseNumber": 187,
      "verseString": "يَسْأَلُونَكَ عَنِ السَّاعَةِ أَيَّانَ مُرْسَاهَا ۖ قُلْ إِنَّمَا عِلْمُهَا عِنْدَ رَبِّي ۖ لَا يُجَلِّيهَا لِوَقْتِهَا إِلَّا هُوَ ۚ ثَقُلَتْ فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ لَا تَأْتِيكُمْ إِلَّا بَغْتَةً ۗ يَسْأَلُونَكَ كَأَنَّكَ حَفِيٌّ عَنْهَا ۖ قُلْ إِنَّمَا عِلْمُهَا عِنْدَ اللَّهِ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ",
      "verseStringB": "They ask thee about the Hour,ᵃ when will it come to pass? Say: The knowledge thereof is with my Lord only. None but He will manifest it at its time. It is momentous in the heavens and the earth. It will not come to you but of a sudden. They ask thee as if thou wert solicitous about it. Say: Its knowledge is with Allāh only, but most people know not."
    },
    {
      "verseNumber": 188,
      "verseString": "قُلْ لَا أَمْلِكُ لِنَفْسِي نَفْعًا وَلَا ضَرًّا إِلَّا مَا شَاءَ اللَّهُ ۚ وَلَوْ كُنْتُ أَعْلَمُ الْغَيْبَ لَاسْتَكْثَرْتُ مِنَ الْخَيْرِ وَمَا مَسَّنِيَ السُّوءُ ۚ إِنْ أَنَا إِلَّا نَذِيرٌ وَبَشِيرٌ لِقَوْمٍ يُؤْمِنُونَ",
      "verseStringB": "Say: I control not benefit or harm for myself except as Allāh please. And had I known the unseen, I should have much of good, and no evil would touch me. I am but a warner and the giver of good news to a people who believe.ᵃ"
    },
    {
      "verseNumber": 189,
      "verseString": "هُوَ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ وَجَعَلَ مِنْهَا زَوْجَهَا لِيَسْكُنَ إِلَيْهَا ۖ فَلَمَّا تَغَشَّاهَا حَمَلَتْ حَمْلًا خَفِيفًا فَمَرَّتْ بِهِ ۖ فَلَمَّا أَثْقَلَتْ دَعَوَا اللَّهَ رَبَّهُمَا لَئِنْ آتَيْتَنَا صَالِحًا لَنَكُونَنَّ مِنَ الشَّاكِرِينَ",
      "verseStringB": "He it is Who created you from a single soul, and of the same did He make his mate, that he might find comfort in her.ᵃ So when he covers her she bears a light burden, then moves about with it. Then when it grows heavy, they both call upon Allāh, their Lord: If Thou givest us a good one, we shall certainly be of the grateful.ᵇ"
    },
    {
      "verseNumber": 190,
      "verseString": "فَلَمَّا آتَاهُمَا صَالِحًا جَعَلَا لَهُ شُرَكَاءَ فِيمَا آتَاهُمَا ۚ فَتَعَالَى اللَّهُ عَمَّا يُشْرِكُونَ",
      "verseStringB": "But when He gives them a good one, they set up with Him associates in that which He has given them. High is Allāh above what they associate (with Him)."
    },
    {
      "verseNumber": 191,
      "verseString": "أَيُشْرِكُونَ مَا لَا يَخْلُقُ شَيْئًا وَهُمْ يُخْلَقُونَ",
      "verseStringB": "Do they associate (with Him) that which has created naught, while they are themselves created?"
    },
    {
      "verseNumber": 192,
      "verseString": "وَلَا يَسْتَطِيعُونَ لَهُمْ نَصْرًا وَلَا أَنْفُسَهُمْ يَنْصُرُونَ",
      "verseStringB": "And they cannot give them help, nor can they help themselves."
    },
    {
      "verseNumber": 193,
      "verseString": "وَإِنْ تَدْعُوهُمْ إِلَى الْهُدَىٰ لَا يَتَّبِعُوكُمْ ۚ سَوَاءٌ عَلَيْكُمْ أَدَعَوْتُمُوهُمْ أَمْ أَنْتُمْ صَامِتُونَ",
      "verseStringB": "And if you invite them to guidance, they will not follow you. It is the same to you whether you invite them or you are silent.ᵃ"
    },
    {
      "verseNumber": 194,
      "verseString": "إِنَّ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ عِبَادٌ أَمْثَالُكُمْ ۖ فَادْعُوهُمْ فَلْيَسْتَجِيبُوا لَكُمْ إِنْ كُنْتُمْ صَادِقِينَ",
      "verseStringB": "Those whom you call on besides Allāh are slaves like yourselves;ᵃ so call on them, then let them answer you, if you are truthful."
    },
    {
      "verseNumber": 195,
      "verseString": "أَلَهُمْ أَرْجُلٌ يَمْشُونَ بِهَا ۖ أَمْ لَهُمْ أَيْدٍ يَبْطِشُونَ بِهَا ۖ أَمْ لَهُمْ أَعْيُنٌ يُبْصِرُونَ بِهَا ۖ أَمْ لَهُمْ آذَانٌ يَسْمَعُونَ بِهَا ۗ قُلِ ادْعُوا شُرَكَاءَكُمْ ثُمَّ كِيدُونِ فَلَا تُنْظِرُونِ",
      "verseStringB": "Have they feet with which they walk, or have they hands with which they hold, or have they eyes with which they see, or have they ears with which they hear? Say: Call upon your associate-gods, then plot against me and give me no respite."
    },
    {
      "verseNumber": 196,
      "verseString": "إِنَّ وَلِيِّيَ اللَّهُ الَّذِي نَزَّلَ الْكِتَابَ ۖ وَهُوَ يَتَوَلَّى الصَّالِحِينَ",
      "verseStringB": "Surely my Friend is Allāh, Who revealed the Book, and He befriends the righteous."
    },
    {
      "verseNumber": 197,
      "verseString": "وَالَّذِينَ تَدْعُونَ مِنْ دُونِهِ لَا يَسْتَطِيعُونَ نَصْرَكُمْ وَلَا أَنْفُسَهُمْ يَنْصُرُونَ",
      "verseStringB": "And those whom you call upon besides Him are not able to help you, nor can they help themselves.ᵃ"
    },
    {
      "verseNumber": 198,
      "verseString": "وَإِنْ تَدْعُوهُمْ إِلَى الْهُدَىٰ لَا يَسْمَعُوا ۖ وَتَرَاهُمْ يَنْظُرُونَ إِلَيْكَ وَهُمْ لَا يُبْصِرُونَ",
      "verseStringB": "And if you invite them to guidance , they hear not; and thou seest them looking towards thee, yet they see not."
    },
    {
      "verseNumber": 199,
      "verseString": "خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ",
      "verseStringB": "Take to forgiveness and enjoin good and turn away from the ignorant."
    },
    {
      "verseNumber": 200,
      "verseString": "وَإِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطَانِ نَزْغٌ فَاسْتَعِذْ بِاللَّهِ ۚ إِنَّهُ سَمِيعٌ عَلِيمٌ",
      "verseStringB": "And if a false imputationa from the devil afflict thee, seek refuge in Allāh. Surely He is Hearing, Knowing."
    },
    {
      "verseNumber": 201,
      "verseString": "إِنَّ الَّذِينَ اتَّقَوْا إِذَا مَسَّهُمْ طَائِفٌ مِنَ الشَّيْطَانِ تَذَكَّرُوا فَإِذَا هُمْ مُبْصِرُونَ",
      "verseStringB": "Those who guard against evil, when a visitation a from the devil afflicts them, they become mindful, then lo! they see.ᵇ"
    },
    {
      "verseNumber": 202,
      "verseString": "وَإِخْوَانُهُمْ يَمُدُّونَهُمْ فِي الْغَيِّ ثُمَّ لَا يُقْصِرُونَ",
      "verseStringB": "And their brethrena increase them in error, then they cease not."
    },
    {
      "verseNumber": 203,
      "verseString": "وَإِذَا لَمْ تَأْتِهِمْ بِآيَةٍ قَالُوا لَوْلَا اجْتَبَيْتَهَا ۚ قُلْ إِنَّمَا أَتَّبِعُ مَا يُوحَىٰ إِلَيَّ مِنْ رَبِّي ۚ هَٰذَا بَصَائِرُ مِنْ رَبِّكُمْ وَهُدًى وَرَحْمَةٌ لِقَوْمٍ يُؤْمِنُونَ",
      "verseStringB": "And when thou bringest them not a sign, they say: Why dost thou not demand it? Say: I follow only that which is revealed to me from my Lord. These are clear proofs from your Lord and a guidance and a mercy for a people who believe."
    },
    {
      "verseNumber": 204,
      "verseString": "وَإِذَا قُرِئَ الْقُرْآنُ فَاسْتَمِعُوا لَهُ وَأَنْصِتُوا لَعَلَّكُمْ تُرْحَمُونَ",
      "verseStringB": "And when the Qur’ān is recited, listen to it and remain silent, that mercy may be shown to you."
    },
    {
      "verseNumber": 205,
      "verseString": "وَاذْكُرْ رَبَّكَ فِي نَفْسِكَ تَضَرُّعًا وَخِيفَةً وَدُونَ الْجَهْرِ مِنَ الْقَوْلِ بِالْغُدُوِّ وَالْآصَالِ وَلَا تَكُنْ مِنَ الْغَافِلِينَ",
      "verseStringB": "And remember thy Lord within thyself humbly and fearing, and in a voice not loud, in the morning and the evening, and be not of the heedless.ᵃ"
    },
    {
      "verseNumber": 206,
      "verseString": "إِنَّ الَّذِينَ عِنْدَ رَبِّكَ لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِ وَيُسَبِّحُونَهُ وَلَهُ يَسْجُدُونَ ۩",
      "verseStringB": "Surely those who are with thy Lord are not too proud to serve Him, and they glorify Him and prostrate themselves before Him"
    }
  ],
  "nameEnglish": "The Elevations",
  "nameTrans": "al-A'raf",
  "nameArabic": "الأعراف",
  "chapterNumber": 7,
  "nVerses": 206,
  "footnotes": [
    {
      "note": "1a. Of the four letters alif, låm, mßm, and ©åd, the first three are the same as at thecommencement of ch. 2, for which see 2:1a; while ©åd stands for ˝ådiq, meaningTruthful, Whose promise would not fail (AH), or for Af©al, i.e., the best Decider (I’AbAH), or for ˝ab∂r, meaning the Patient or Long-suffering God Who gives a respite to thewicked and makes His righteous servants to suffer persecution and hardships at theirhands for a time.\n\n2a. Ïaraj signifies straitness, and the parenthetical passage, so let there be no straitness in thy breast concerning it, is introduced to console the Prophet, who at this timewas encountering the greatest opposition and was surrounded by difficulties on all sides,and whose mission so far had made very little progress.\n\n2b. The Qur’ån is very often call dhikr or dhikrå, i.e., a reminder, because, being inconsonance with human nature, it is a reminder of what is imprinted on human nature.Or dhikrå has here the meaning of dhikr, i.e., an honour or eminence, as 43:44 may bealternatively rendered: “Surely it is an honour to thee and to thy people” (T, LL), and in38:1: “By the Qur’ån, possessing eminence” (S, LL).\n\n4a. The Prophet’s opponents are here warned of a doom similar to the doom of theopponents of truth before them. Truth must be established, be it by the destruction of itsopponents or the overthrow of their power, or their ultimate surrender.\n\n6a. Those to whom messengers were sent will be questioned as to how they treatedthe messengers, and the latter as to how they were received.\n\n7a. Allåh, being the Knower of all things, will declare to them what they had done;in other words, the consequences of their actions will become manifest.\n\n8a. Wazn means the knowing of the measure of the thing (R). And referring to theopening words of this verse, it is added the allusion is to justice in the reckoning of men.Mjd says wazn here means qa˙å, or judging (IJ).The word mawåzin occuring in the latter part of the verse is plural of mauz∂nmeaning what is weighed and mßzån meaning that by which things are weighed or abalance. In the first case mawåzßn means good deeds or virtues, because only gooddeeds are weighed — accepted by Mjd; in the second case, the words would betranslated as the scales being heavy or light, but the heaviness or lightness of the scalesis meaningless, unless it means the heaviness or lightness of the good deeds which onehas to his credit.\n\n9a. Òulm, when made transitive by means of bå, has the meaning of kufr. Thus,explaining ˚alam∂ bi-hå in v. 103, LL says: “It is also made transitive by means of bå,as in the phrase in the Qur’ån (7:103 and 17:59), because the meaning is kafar∂.”\n\n11a. That what is stated here of Adam is true of all men is made clear by the wordsof this verse. Men are created first, then fashioned, then the order is given to the angelsto make obeisance to Adam, who in this sense typifies man, the verse speaking of mengenerally in the opening words. Thus the angels are really required to make submissionto every man; see 2:34a, 34b, 34c.\n\n12a. The creation of man from dust is frequently referred to in the Holy Qur’ån. Notonly is Adam created from dust, but all men are spoken of as being similarly created;see 3:59a. As a contrast to man’s creation from dust, the devil claims to have been created from fire. The meaning may be that the preponderating element in the creation ofman is earth, while in that of the devil it is fire. There may be a reference here to thenature of the temperaments of the two classes, men and devils. The Holy Qur’ån sayselsewhere: “Man is created of haste” (21:37), which means that he is hasty. In like manner the devil’s creation of fire may mean that he is made of a fiery temperament, whilethe perfect man is humble and meek, being created of dust, which stands for humilityand meekness. Thus the description given here may stand for the prominent characteristics of the temperaments of the two classes of beings. Elsewhere it is stated that the jinnwere created of fire (15:27), and also that Iblßs was of the jinn (18:50).\n\n13a. Degradation has always been the punishment of those who oppose the prophetsof God. He abases those who consider themselves mighty.\n\n14a. The devil’s grip continues only so long as man is not spiritually raised to life. Theraising here stands for the spiritual resurrection of man. If the Resurrection is meant, thesignificance would be that the devil would mislead man so long as man lives on this earth.\n\n16a. Aghwå-hu (from ghawå, he erred) ordinarly signifies he caused him to err, butsometimes also indicates punishing for error. Thus yughwiya-kum in 11:34 is said tomean if Allåh desire to punish you for erring (LL); or, according to T, it means ya√kuma‘alai-kum bi-ghayyi-kum or adjudge you to be erring. According to Rz, the meaning isthat He should cause you to perish. But ghawå (of which aghwa is the causative form)means also khåba (T, LA), i.e. he was disappointed or failed to attain his desire, andalso fasada ‘alai-hi ‘aishu-h∂ (LA), i.e. his life became evil to him (which is the correctsignificance of ghawå in 20:121). Therefore the words may also be interpreted as meaning Thou hast made life evil to me, or Thou hast caused me to remain disappointed.\n\n19a. See 2:35c for the significance of the tree.\n\n20a. Sau’at signifies shame or parts of the body which it is necessary to cover, andalso any saying or action of which one is ashamed when exposed to view, or any evil,abominable or unseemly property, quality, custom, or practice (T, LL). The devil’s suggestions always lead man to the disclosure of his shame.\n\n22a. The consciousness of having done something unworthy of oneself is the surestway to the attainment of perfection. The covering with the leaves of the garden is thedesire to make up by human effort any fault that may have been committed. The clothing that guards against evil, which is spoken of in v. 26 as being the best clothing,explains the meaning of covering here. Divine revelation points out to man the true way,enabling him to cover himself or guard himself against evil. And, further, the statementin v. 27, pulling off from them both their clothing that he might show them their shameshows that covering with the leaves of the garden is an allegorical statement; see\n\n27a. The Qur’ån gives directions regarding the physical requirements of man, too, yetthere is even in these an underlying idea of the spiritual elevation of man.\n\n25a. This verse proves conclusively that every man must live and die upon thisearth. Jesus could not be an exception to this rule.\n\n26a. Rßsh means originally feathers or plumage, constituting the clothing and ornament of birds, and is then applied to superb or excellent clothing, or ornament and beauty (LL).\n\n26b. Clothing at first simply served to cover shame; with further progress men soughtto embellish their persons with it; but there is yet a third kind of clothing, says theQur’ån, which is the best, and that is libås al-taqwå, or the clothing of piety, literally theclothing that guards one against evil. It indicates a further step in the progress of man, forvirtue is an embellishment of the mind, and when man has seen the good of embellishinghis person, he will soon be aware of the necessity of embellishing his mind.\n\n27a. That the clothing for the body is not meant here is clear from the fact that all menare warned against a similar attack of the devil. As to the clothing of which Adam wasdivested, there remains no doubt, when it is seen that the devil tries to divest every child ofAdam of the same clothing. Mjd says: It is the clothing that guards against evil, and bytheir sau’at is meant the evil that afflicted them on account of their disobedience (AH).\n\n27b. It is because they do not believe in the Truth that the devils are made theirfriends; those who sever their connection with the Source of purity must fall into impurity.\n\n28a. The indecency here referred to is considered by some their going naked roundthe Ka‘bah (Mjd-IJ). But the statement is general, and need not be limited.\n\n29a. The word qisΔ is variously explained as meaning Divine Unity; what is goodand right; truth (AH). All these are really included in the literal meaning of the wordqisΔ, which signifies justice in its broadest sense.\n\n30a. Ïaqqa ‘alai-hi kadhå means wajaba or thabata (T) and, according to LL, thesignificance in such cases is that a certain thing has become necessary as suited to therequirements of justice in his case. And ˙alålah sometimes signifies the punishment for˙alålah (R), or a state of perdition (LL). Or, the meaning is that going astray or remaining in error is suitable to the requirements of justice in their case. In fact, the wordsexplain themselves: Error is justly their due because they have taken the devils for theirfriends. Whoever continues to follow the devil must surely remain in error.\n\n31a. Zßnat or adornment is here generally understood to mean apparel, with reference to the practice of going naked round the Ka‘bah, but the word itself has a widersignificance. According to R, real adornment is that which does not disgrace or renderunseemly a man in any one of his conditions either in the present life or in that which isto come. Attending to one’s adornment, therefore, carries a double significance here. Itrequires adorning oneself physically, i.e. a man must have his clothes on when he offersa prayer to God. In congregational prayers, in the vast gatherings on Fridays and ‘Íd, theMuslims are required to have a bath before coming to the Mosque, to put their bestclothes on and to use scent. But what is specially aimed at is adornment in a spiritualsense. A Muslim must attend to inner beautification, for prayer is really meant as an aidto the beauty of the soul. He must come to prayer with a heart free from all impuritiesand full of the highest aspirations and noblest sentiments.\n\n32a. By the adornment of Allåh is meant the adornment which Allåh has madelawful for men to avail themselves of.\n\n32b. The meaning is that in the life of this world the believer and the disbelieverequally profit by the good things, but in the life after death all good shall be exclusivelyfor those who have accepted and acted on the right principles.\n\n34a. The term of a nation is the time when it is destroyed or punished for its evildeeds. The verse really speaks in general terms of the doom awaiting the opponents ofIslåm.\n\n37a. That is, the punishment promised in the Book will overtake them.\n\n38a. By the sister nation is meant the nation which resembles it in its deeds.\n\n38b. By the last and the first are meant here the common people and the leaders,because, though the words would bear both interpretations, i.e. the last and the first intime or the last and the first in position, the latter significance is corroborated by similarexpressions in several other places, such as 2:166, 14:21, 34:31–33, 40:47, etc.\n\n38c. The common people would desire that the leaders should suffer a double torment, for their own sins as well as for having misled others. They are told that if theleaders were guilty of misleading them, they themselves deserved a double chastisementfor having blindly followed the leaders.\n\n40a. That is, they cannot enter into the kingdom of heaven, nor can they rise abovethe low earthly desires, soaring upward to the higher regions of spiritual life.\n\n45a. By seeking to make Allåh’s way crooked is meant that they suggest doubtsregarding the Truth.\n\n46a. The veil which here separates the wicked from the righteous and on account ofwhich the former fail to see the bliss which the latter enjoy will assume a perceptibleform in the next life. Thus it is not distance that separates heaven from hell but only aveil, and they hear and even see one another.\n\n46b. A‘råf is a plural of ‘arf, meaning literally an elevated place, and hence al-a‘råfmeans the elevated places. There has been much discussion as to what a‘råf is.The majority of commentators say that it is the √ijåb or veil spoken of in the previouswords, or the s∂r or wall spoken of in 57:13; while others, among whom are Ïasan andZj, hold that ‘ala-l-a‘råf is only equivalent to ‘alå ma‘rifati ahl al-Jannat wa-l-Når,i.e. knowing the inmates of Paradise and the inmates of Hell (RZ). I have alreadyexplained the nature of the veil mentioned in v. 46. And the wall in 57:13 is mentionedin connection with the bringing about of a separation between the sincere believers andthe hypocrites. Hence the two verses lend no support to the idea that A‘råf is a particularplace midway between paradise and hell. The men spoken of here as being on the elevated places are the same righteous servants of Allåh who are distinctly mentioned in56:10, 11: “And the foremost are the foremost — these are drawn nigh to Allåh”. Besidesthis, the prophets are again and again spoken of as a class by themselves, being witnesses over their people.\n\n46c. They are, as it were, standing at the door of the Garden, ready to enter it.\n\n47a. Thus do pray those who hope to enter paradise.\n\n48a. The word jam‘u-kum may mean either your amassing worldly wealth, or it maymean your multitude or strength in numbers.\n\n51a. The use of nisyån is not limited to forgetting; the word applies as well to dismissing a thing from the mind intentionally (R). And when the word is used about Allåh,it means His forsaking them to show His contempt for them (R).\n\n53a. By final sequel is meant the ultimate state of the perfect manifestation of truthby the fulfilment of the prophecies, the end or the ultimate consequence; see 4:59b.\n\n54a. For yaum as meaning a period, whatever period it may be, see 1:3b. The sixperiods of time in which the heavens and the earth are created refer in fact to the sixstages in which they have grown to their present condition. In the case of the earth thesesix stages are detailed in 41:9, 10; see 41:10a.\n\n54b. ‘Arsh (“Throne of Power”) literally means a thing constructed for shade (LL),or anything roofed (R). According to the latter authority the court or sitting-place of theking is called ‘arsh on account of its eminence. And he adds: It is used to indicate mightor power and authority and dominion. LL accepts the interpretation of R, who says that“the ‘arsh of God is one of the things which mankind know not in reality but only byname, and it is not as the imaginations of the vulgar hold it to be”. In fact, both thewords ‘arsh and kursß have been misunderstood as meaning resting-places forAllåh. The latter has already been explained as meaning knowledge (2:255b), and thetrue significance of the former is power or control of the creation.Istawå signifies, when followed by ‘alå, he had the mastery or control of a thing orascendancy over it, being synonymous with istaulå (LL), or he was or became firm(LL).Thumma, as already shown in 2:29a, has often the same significance as wåw andmeans and.The phrase Istawå ‘ala-l-‘arsh (“He is established on the Throne of Power”) is used inthe Holy Qur’ån here and on six other occasions, viz., in 10:3, 13:2, 20:5, 25:59, 32:4 and57:4. A reference to all these places will show that it is invariably used after mentioningthe creation of the heavens and the earth and in relation to the Divine control of His creation and the law and order to which the universe is made to submit by its great Author, asshown by the words that follow here, His is the creation and the command. The two thingsmentioned are, in the opening words, creation and ‘arsh, and in the concluding words, creation and command. Similarly in 10:3 where ‘arsh is spoken of after the creation of theheavens and the earth, it is followed by the explanatory words yudabbiru-l-amr, i.e., Heregulates the affair. What is, therefore, aimed at is that after creating the universe, God hasnot left it to run its course independently of Him, but He it is Whose command holds swayand Who regulates the affairs as He has planned them. There are many people in this ageof scientific advancement who think that, though the conclusion cannot be avoided thatthere is a God Who created this universe, Whom they call the First or Primal Cause, yetafter its creation it runs its course according to certain immutable laws, and God — or theFirst Cause — has no concern with its affairs. The Holy Qur’ån does not accept this viewand hence, when it speaks of the creation of the heavens and the earth, it speaks also of the‘arsh which stands for God’s control of the universe, as shown above. To make it furtherclear, the verse is made to end with the words tabårak Allåhu Rabbu-l-‘ålamin, i.e.,blessed is Allåh, the Nourisher of the worlds unto perfection. These words show that theworld is still in the process of growth, and according to the Divine plan, it is advancingfrom one stage to another to attain its perfection. God has not only created it but He is alsoregulating its affairs to make it perfect.In the words Rabb al-‘ålamßn there is also a deeper reference, as shown in 1:1a, tothe spiritual evolution of man which is being worked out under the Divine plan, and the‘arsh is mentioned specially in this connection, as man’s perfection does not consist inthe working of the material laws which prevail in the universe but in the spiritual lawswhich are needed for his perfection. The amr (affair) whose regulation is so oftenmentioned in connection with ‘arsh is really the spiritual kingdom, what Jesus calls thekingdom of God. This is made clear in 32:5; see 32:5a. The spiritual perfection of manis specially mentioned in connection with ‘arsh in 40:15: “Exalter of degrees, Lord ofthe ‘arsh, He makes the spirit (i.e., Divine revelation) to light by His command uponwhom He pleases of His servants, that he may warn (men) of the day of Meeting.” TheLord of the ‘arsh is thus clearly stated to be the Sender of revelation to man to bringabout his spiritual perfection. Still more clearly in the same s∂rah, the righteous servantsof God who deliver the Divine messages to men are called the bearers of the‘arsh. Speaking of the messages of the messengers of God and how the people givethem the lie, it is added: “Those who bear the ‘arsh and those around it celebrate thepraise of their Lord and believe in Him and ask protection for those who believe”(40:7). The bearers of the ‘arsh are, in fact, the bearers of the Divine message.\n\n56a. The feeling which should be entertained towards Allåh should be a combination of fear and hope, of awe as well as love, because the fear of His displeasureennobles the mind no less than the hope of His mercy.\n\n57a. His mercy represents the rain in the physical world.\n\n57b. The bringing forth of the spiritually dead to life through the revelation of theQur’ån is always likened to the bringing of the dead earth to life by rain. The wind bearing the good news was the movement towards Islåm, which was daily becoming moreand more powerful.\n\n58a. Revelation is here likened to the rain and the good or bad nature of man togood or inferior land. If some men do not profit by the revelation, it is their own fault,not that of the revelation, just as, if some lands do not profit by rain, it is due to theirown inferiority.\n\n59a. Having warned the opponents of the evil consequences of their opposition tothe Holy Prophet, several illustrations are now given from sacred history, showing howthose people were dealt with who refused to listen to the voice of the warners. It shouldbe borne in mind in reading the histories of the prophets as given in the Holy Qur’ånthat the object is not to narrate history as such, but to bring out common characteristicsof the histories of different nations, to mention incidents which contain prophetical allusion to the Holy Prophet’s life and to illustrate the general warnings made regarding theultimate consequences attendant upon the rejection of Truth. The Qur’ån does not concern itself with the details of what messages a prophet delivered to his people and ofhow he was received; it simply contents itself with the broad facts that every prophetpreached Divine Unity, every prophet laid stress on the doing of good, every prophetwas received with severe opposition, and that every prophet ultimately succeeded inestablishing the truth. This, with slight variations, is the sum and substance of the histories of the prophets that are recorded in the Holy Qur’ån. It is not, as stated by aChristian critic, “the experience of Mu√ammad” that is recorded in the histories ofprophets; it is the common experience of the prophets of different nations, containing aprophetical allusion to the ultimate triumph of the Prophet. This is clear from the factthat the histories of the prophets relating the destruction of their opponents are containedchiefly in Makkan revelations, whereas at Makkah the opponents of the Holy Prophetwere at the zenith of their power, and the cause of the Prophet was to all appearanceshopeless.References to Noah and his history are contained in the following places in the HolyQur’ån:3:33; 6:84; 7:59–64; 10:71–73; 11:25– 48; 14:9; 17:3; 21:76, 77; 23:23–29;25:37; 26:105–122; 29:14, 15; 37:75–82; 51:46; 53:52; 54:9–16; 57:26; 66:10;69:11–12; 71:1–28.\n\n64a. Fuller references to the deluge and the making of the ark are contained in11:37– 48 and 23:27–29. It may be noted here, however, that the Holy Qur’ån does notsupport the idea of a world deluge, for it plainly states here that Noah was sent only tohis people, i.e. not to all nations. Only the people to whom Noah delivered his messagecalled him a liar, and only those were drowned who rejected the message of Allåhdelivered through Noah.\n\n65a. The tribe of ‘Åd, with its prophet H∂d, is mentioned in the Holy Qur’ån in thefollowing places: 7:65–72; 11:50– 60; 14:9; 25:38; 26:123–140; 29:38; 41:13–16;46:21–26; 51:41, 42; 53:50; 54:18–21; 69:4; 69:6 – 8; 89:6– 8.‘Åd was the grandson of Aram (mentioned in 89:7), who was a grandson of Noah,and the tribe of ‘Åd spoken of here is called the first ‘Åd (53:50), as distinguished fromthe tribe of Tham∂d, which is called the second ‘Åd. This tribe lived in the desert ofal-A√qåf (46:21) which is marked on the maps of Arabia and extends from Oman toÏa˙ramaut. Rodwell’s view, that “the two tribes of ‘Åd and Tham∂d — the latter ofwhom is mentioned by Diod. Sic. and Ptolemy — lay to the north of Mecca”, is wrongin respect of the tribe of ‘Ad, though it is tolerably true so far as the tribe of Tham∂d isconcerned. Sale has the following account of this tribe in his Pr. Dis.: “ ‘Åd was anancient and potent tribe of Arabs and zealous idolaters. They chiefly worshipped fourdeities, Såqiyah, Ïåfi˚ah, Råziqah, and Sålimah, the first, as they imagined, supplyingthem with rain, the second preserving them from all dangers abroad, the third providingfood for their sustenance, and the fourth restoring them to health when afflicted withsickness”.\n\n65b. The male member of a tribe is generally spoken of as their brother: “Thus yåakhå Bakr-in means, O thou of the tribe of Bakr” (LL).\n\n65c. The prophet H∂d is the Eber of the Bible, because H∂d is said to be the grandson of Arphaxad, the grandson of Noah (Rz). Compare Gen. 10:24 for Eber’s genealogy. His son Joktan is said to have established a kingdom in Y∂nån. There is no mentionin the Bible that H∂d was a prophet for ‘Åd.\n\n69a. By making the ‘Ådites khulafå’ or successors is meant that they were made aruling nation and possessors of a vast kingdom.\n\n69b. Some commentators have related unfounded legends as to the incredibletallness of their stature. The words used in the Qur’ån signify only that they were astrong and powerful people.\n\n71a. Sticking to their idols and refusing to believe in Allåh is here spoken of asuncleanness. The wrath of Allåh was due to their evil deeds. There is also a secondarysignificance of the word rijs, i.e. punishment, and in that case the past tense wouldindicate the certainty of the event, because punishment was so sure to come that it couldbe spoken of as having lighted upon them.\n\n71b. The reference here is to their deities, for which see 65a.\n\n72a. They were destroyed by a storm blowing on them continuously for eight days(69:7).\n\n73a. The tribe of Tham∂d is often mentioned in the Holy Qur’ån conjointly with thetribe of ‘Åd. It is spoken of in the following places: 7:73–79; 11:61– 68; 14:9; 15:80–84; 25:38; 26:141–159; 27:45–53; 29:38; 41:13, 14, 17, 18; 51:43 – 45; 53:51; 54:23–31; 69:4, 5; 89:9; 91:11–15.‘Åd and Tham∂d, though two nearly related tribes, were separated both as regardstime and place. Tham∂d is known after a grandson of Aram, the grandson of Noah.Historical traces of it are met with in Ptolemy. The tribe flourished more than two hundred years after ‘Åd, and occupied the territory known as al-Ïijr (15:80), and the plainknown by the name of Wådi-l-Qurå, which forms the southern boundary of Syria andthe northern one of Arabia.\n\n73b. ˝åli√ was a descendant in the sixth generation after Tham∂d.\n\n73c. Neither the Qur’ån nor any reliable saying of the Holy Prophet lends any support to the numerous legends regarding the miraculous appearance and prodigious sizeof the she-camel. It is called Allåh’s she-camel because it was given as a sign fromAllåh. It was an ordinary she-camel, which was given as a sign to a people. Their slaying of it was a sign that they would neither accept the truth, nor cease persecuting ˝åli√and his followers.\n\nIt may be noted here that there is nothing strange that a camel should be given as asign, when even now we can see that a roughly constructed house known as the Ka‘bahis given as a sign to the whole world, so that whoever tries to destroy it will perish.\n\n74a. In his Essays on the Life of Mu√ammad, Sir Syed A√mad Khån says: “Theyexcavated various rocks, and after having hewn and carved them, took up their abodetherein. These rocks are to this very day known by the name of Athålib. Almost everyArab, as well as several foreigners who have travelled in Arabia, can bear testimony tothe existence of these rock habitations, which stand there at once to satisfy curiosity andto afford information respecting the nations who made them. These habitations likewisecorroborate and bear testimony to the truth of that portion of the history of the Tham∂dtribe which is mentioned in the Holy Qur’ån.”\n\n78a. The punishment which overtook Tham∂d is described under different names.Here it is called rajfah, which means earthquake. The description of their abodes in27:52 as fallen down also shows that they were destroyed by an earthquake. In 54:31the same punishment is referred to as ©ai√ah, i.e. a cry or a shout, and it evidently refersto the rumbling noise which precedes an earthquake. In 51:44 and elsewhere it is spokenof as ©å’iqah, which means any destructive punishment (LL), carrying sometimes thesame significance as ©ai√ah. In 69:5, Tham∂d is said to have been destroyed by meansof Δåghiyah, which means an excessively severe punishment. Both of these descriptionsare applicable to an earthquake.\n\n79a. This evidently refers to the survivors from the great disaster.\n\n80a. In the chronological order which this chapter keeps in view, Abraham shouldhave been mentioned next, but his name is here omitted for two reasons; firstly, becauseonly those prophets are mentioned whose enemies were destroyed before their eyes; and,secondly, because Abraham’s history has already been dealt with in the last chapter, towhich this forms, as it were, a supplement. Hence, we come to Lot, Abraham’s nephew.For other references to Lot in the Holy Qur’ån, see 6:86; 11:77–83; 15:61–74; 21:74,75; 26:160–173; 27:54–58; 29:32 –35; 37:133 –136; 51:32–37; 53:53– 54; 54:34–38;66:10. Lot is one of those prophets who have been maligned not only in Rabbinicalliterature but also in the Bible. It is clear that Lot was considered a righteous servant byAbraham (Gen. 18:23), but a little further on we are told that Lot was guilty of incestuous intercourse with his daughters, which shows him to be extremely licentious. Therecord here has evidently been manipulated.The question whether Lot was a prophet is answered in the affirmative by Sale, butWherry denies it.If Gen. 19:30–38 is a faithful record, Lot cannot take his place even among therighteous; whereas, his being saved in the destruction of Sodom is clear proof of hisrighteousness, when read along with Gen. 18:23. Sale has, however, produced theadditional testimony of the apostle Peter, who says: “And delivered just Lot, vexed withthe filthy conversation of the wicked (for that righteous man dwelling among them, inseeing and hearing, vexed his righteous soul from day to day with their unlawful deeds)”(2 Pet. 2:7, 8). His vexing his soul with the wickedness of the people of Sodom can onlybe true if he was a preacher of righteousness among those people. And again, whyshould Lot have gone, being a just man, to settle among a wicked people, had he notbeen charged with the duty of reforming them?\n\n83a. The word ahl is here interpreted as meaning those who believed in him (Bd). Itmeans in the first place a man’s family or near relatives, being, in fact, the equivalent ofål, but with reference to root-meaning both have a wider significance, including all thosewho bear a relation to a man, as members to a head (from the root åla, meaning hereturned or bore a relation, to a man) by religion or persuasion or kindred. There is,however, this difference between ål and ahl, that the former is used only in relation toeminent men while the latter may refer to men in general (R).\n\n84a. MaΔr or maΔar (lit. raining) is also used in the sense of doing good or evil,according to the object by which it is followed, but amΔara (which is the form used here)is only used in relation to punishment (T). The punishment which overtook the people ofLot is frequently called maΔar or rain, while in 11:82 and 15:74 stones are said to havebeen rained down upon them, and in 54:34 it is called √å©ib, which primarily signifies athrower or pelter of stones. It was a volcanic eruption combined with an earthquake.\n\n85a. References to Shu‘aib are contained in the Holy Qur’ån here and in 11:84– 95;15:78, 79; 26:176–191, and 29:36, 37. Shu‘aib was a descendant of Abraham in thefifth generation. Madyan or Midian was the name of Abraham’s son by Keturah (Gen.25:2), and a city of the same name grew up on the Red Sea, southeast of Mount Sinai,where his descendants settled, and is mentioned by Ptolemy as Modiana. Shu‘aib isgenerally supposed to be another name for Jethro.The injunction diminish not to men their things stands for not depriving or defrauding men of their rights, or not acting wrongfully towards men in respect of their thingsor dues.\n\n91a. This punishment is twice referred to as rajfah, or the earthquake, and once in11:94 as ©aiƒah, which also stands for earthquake.\n\n93a. He had fully warned his people, and it was their own fault that they did notbenefit by his good advice.\n\n94a. That the histories of the nations are meant as a warning to all opponents oftruth is evident. It is also plain that even afflictions and distress, when sent on a people,are meant for their spiritual betterment, that they might humble themselves.\n\n95a. By good and evil are meant here ease and distress respectively.\n\n98a. Óuƒ-an, which is here translated as morning, begins after sunrise, according tosome when the sun is yet low, and according to others when it is somewhat high (LL).The playing may be taken either literally or it may indicate the worldly engagements inwhich they were occupied to the utter neglect of higher aspirations.\n\n103a. The history of Moses has already been briefly referred to in connection with thestubbornness of the Israelites, but here it is taken up in greater detail, and is continued fromhere to the end of the 21st section. The reason for this enlargement is to be found in the factthat the Holy Prophet had more in common with Moses than with any other prophet, and heis called the like of Moses in the Mosaic prophecies. References to Moses’ history are contained in the following places in the Holy Qur’ån: 2:49–71; 4:153; 5:20–26; 7:103–156;7:159 –160; 10:75– 92; 11:96– 99; 17:101–104; 18:60–82; 19:51–53; 20:9–98; 23:45–49; 26:10– 68; 27:7–14; 28:3– 44; 37:114–122; 40:23–54; 43:46– 56; 44:17– 33; 51:38–40; 61:5 and 79:15 –26.\n\n108a. Here again we have an instance of the correctness of the Quranic statementwhere it differs with the Bible, showing the incompleteness of the Bible narrative. In thefourth chapter of Exodus it is clearly stated that two signs were given to Moses — thatof his rod turning into a serpent and that of his hand becoming white when put into hisbosom; and Exod. 4:8 clearly states that Moses was commanded to show both thesesigns to Pharaoh. But when we read ch. 7, where the performance of those miraclesbefore Pharaoh is recorded, we find mention only of the miracle of the rod.Another question worth considering here is as to the nature of these miracles. As isstated elsewhere in the Holy Qur’an, Moses’ rod was an ordinary staff: “I lean on it, andI beat the leaves with it for my sheep, and I have other uses for it” (20:18). It is nowherestated that whenever he threw it down his rod turned into a serpent. Even when theIsraelites were in the greatest danger, Moses made no use of it. Only on two occasionsthe rod is stated to have turned into a serpent, viz. (1) when Moses held communionwith God before going to Pharaoh; (2) when he first came before Pharaoh, or whenPharaoh summoned the enchanters to his help.Now on the first of these occasions it is certain that the rod was seen turning into aserpent by Moses alone, when he was in a state of vision — a state in which a person istemporarily transported to a spiritual sphere. This is the state in which the prophets andother righteous men receive Divine revelation; and while it is certainly not a state ofsleep, it is equally certain that it is a state in which the mind rises above the limitationsof physical environment, beholding things which are invisible to the physical eye, andhearing things which the physical ear cannot hear. It is therefore certain that on the firstoccasion Moses observed the change whilst in the same state of temporary transportation in which he received revelation. The miracle took place on the latter occasion whenothers besides Moses witnessed the change. But it is a fact that the effect of inspiredvision is sometimes so strong that others besides the seer partake in it.Yet, whatever their real nature, these miracles of Moses were not mere play. The greattruth underlying the ‘a©å or the rod turning into a serpent, was that the followers of Moses,as represented by his rod, would prevail over their enemies; and the significance underlying the whitening of Moses’ hand was that his arguments would shine forth with clearness.For these interpretations of the two occurrences, see 20:20a, 22a.\n\n110a. Amr here carries the significance of advising or counselling. One says mur-nßmeaning counsel me, advise me (LL). The words are apparently Pharaoh’s.\n\n113a. Compare Exod. 7:11: “Then Pharaoh also called the wise men and the sorcerers”.\n\n117a. Compare Exod. 7:12: “For they cast every man his rod, and they becameserpents: but Aaron’s rod swallowed up their rods”. The enchanters’ show is herespoken of as the lies they told.\n\n126a. The Bible does not speak of the magicians as believing in the Divine missionof Moses when they were vanquished. On the other hand, they are shown as still opposing Moses when other signs were shown later on, though their hearts seem to have beenimpressed with Moses’ truth, as on one occasion they are shown as saying to Pharaohthat there was “the finger of God” in what Moses did (Ex. 8:19). Notwithstanding thisconviction, they are still shown as opposing Moses and as suffering from boils likePharaoh’s followers (Ex. 9:11). But according to Rabbinical literature, some Egyptiansaccompanied Moses when he departed from Egypt, which is corroborated by the Biblenarrative: “And a mixed multitude went up also with them” (Exod. 12:38). “For theEgyptians, when the time fixed for Moses’ descent from the mountain had expired, camein a body, forty thousand of them, accompanied by two Egyptian magicians, Yanos andYambros, the same who imitated Moses in producing the signs and the plagues inEgypt” (Jewish Ency.). These two magicians are also mentioned in 2 Tim. 3:8, which isa further corroboration of the truth of the statement made in the Qur’ån and of theincompleteness of the Bible narrative.It should be further noted that the magicians could not have believed unless theyhad heard the arguments of Moses as to the existence of God and as to a life after deathin which they now believed so staunchly that they were ready to sacrifice their very livesfor their faith. It shows that Moses had explained the essential religious truths to thewhole gathering before he showed the signs.\n\n127a. The word translated as dominant is qåhir, which signifies one who has overcome, conquered, or subdued another (LL).\n\n129a. By the land is meant the Promised Land, for thither was Moses taking them.Their being made rulers in the land was conditional upon their doing good; this issuggested in the concluding words of the verse.\n\n131a. The original word for evil fortune is †å’ir, lit., a bird. See 17:13a for explanation. Their evil fortune is from Allåh means that the misfortunes which they were madeto suffer were brought about by Allåh as a result of their own evil deeds.\n\n133a. Ô∂f ån (from Δåfa, he went round or circuited the thing) is originally everyaccident that besets men on all sides (R), and hence it is also applied to flood or deluge.It also means death, or quick and widespread death; or death prevailing generally (LL).Hence it might mean either plague causing excessive death or flood. Widespread death,as the true interpretation of Δ∂fån, is also accepted by Bukhårß (B. 65: vii).\n\n133b. The Bible mentions the following signs: (1) Turning of the water into blood;(2) frogs; (3) lice; (4) flies; (5) plague upon beasts and men; (6) hail; (7) locusts;(8) darkness; (9) death of the first-born. Of these the Qur’ån mentions the first two, thethird, and the seventh in clear words; the fourth is included in the third; the fifth and theninth are mentioned together as Δ∂f ån or widespread death; the hail is not mentioned,but the destruction of fruits, which was brought about by it, is mentioned in v. 130;while instead of the darkness we have the drought in that verse, which seems to havebeen the actual affliction, and of which darkness may have been a result eithermetaphorically or actually, because of hurricanes and storms darkening the land, as isusually the case in time of drought. The two signs of v. 130, with the five mentionedhere, are the seven signs which, with the two signs of the rod and the white hand, makeup the nine signs of 17:101 and 27:12.\n\n134a. The reference is to the plague mentioned in the previous verse.\n\n135a. A reference to Exodus, ch. 8–11, will show that Pharaoh again and againbroke his promise to let the Children of Israel go — promises which he made oncondition that a certain affliction should be removed.\n\n137a. The land that was blessed is none other than the Holy Land, for which aDivine promise was given to Abraham. The good word referred to here is that containedin Gen. 17:8. The eastern and the western lands might signify the eastern and the western tracts of the Holy Land, or the lands on the eastern and western sides of the Jordan.\n\n138a. The Israelites undoubtedly came across idolatrous nations in their wanderingsin Syria. They themselves had idolatrous leanings: “The people gathered themselvestogether unto Aaron and said unto him, Up, make us gods which shall go before us!”(Exod. 32:1). Many other anecdotes show a similar tendency to idol-worship.\n\n140a. Moses’ argument against idolatry is the one to which the Holy Qur’ån repeatedly calls attention, viz. that man, being as it were the lord of creation under God, andexcelling the whole of creation, should not take objects lower than himself as his gods.\n\n143a. The highest bliss of paradise is said to be the sight of the Diving Being. Thewords addressed to Moses, thou canst not see Me, do not negative the sight of theDivine Being in the life after death. All that they negative is the seeing of the DivineBeing with the physical eye. Moses’ request seems to have been based on the elders’demand spoken of in 2:55. The crumbling of the mountain is the same as the rumblingof the earthquake of 2:55. I venture, however, another explanation. What Moses wantedto see was the great manifestation of Divine glory which was reserved for the HolyProphet Muƒammad. In fact, both Moses and Jesus were not equal to the task which wasreserved for the Prophet Muƒammad. Jesus said that he could not teach his followers allthings, but that when the Comforter made his appearance he would guide them into alltruth. That Moses was unequal to the Holy Prophet’s task was clearly demonstrated byhis falling down in a swoon when he beheld the Great Manifestation.\n\n145a. Kataba means He (God) prescribed, appointed or ordained and made obligatory (LL). The words admonition of every kind and explanation of all things cannot betaken generally, but are limited by the requirements of the time in which Mosesappeared.\n\n145b. The meaning is that a time will come to the Israelites when they will becometransgressors, i.e. they will not keep the Divine commandments.\n\n148a. The word jasad means a body, as well as red or intensely yellow. The formermeaning is the one generally adopted by the commentators, the significance being thatthe calf made was a mere body without a soul. Yet it was so made that it gave a lowingsound like that of a calf. The other meaning also affords a true description of the calf,for, being made of gold ornaments, it was of a red or an intensely yellow colour.\n\n149a. SuqiΔa f ß aidß-him is a phrase which, by the consensus of opinion, means theyrepented (from saqaΔa, it fell down). The phrase is said not to have been known beforethe Qur’ån (LL). Explaining the word in his commentary, Bukhårß says: Everyone whorepents is spoken of as suqiΔa fß yadi-hß (B. 65: vii). Or nadm is understood and themeaning is, when regret was brought before them. The Israelites’ repentance, thoughmentioned first, was subsequent to Moses’ return (2:54). In fact, the order here is nothistorical, but one connecting the repentance with the sin, mentioning the events whichbrought about that repentance afterwards.\n\n150a. The word ‘ajila is used as a transitive in the sense of sabaqa, and the meaningis, did you hasten the commandment of your Lord? The amr, or the commandment, hasbeen explained as meaning the appointed time or the judgment.\n\n151a. Aaron’s excuse and Moses’ acceptance of it show clearly that Aaron was quiteinnocent, having had a share neither in making the calf nor in worshipping it. The Bibleaccount, which makes a righteous prophet of God guilty of the most heinous crime, mustbe rejected as untrue. That forgiveness was not sought for any fault in connection withcalf-worship is clear from the fact that Moses joins himself with Aaron in the prayergiven in this verse. Forgiveness here, as frequently elsewhere in the Holy Qur’ån, isequivalent to the Divine protection, which every man should seek against the frailties andshortcomings of human nature. See 2:286a for a full explanation of the word ghafr.\n\n154a. According to Exod. 32:19 Moses “brake them beneath the mountain” in hisanger, and Exod. ch. 34 describes how the tablets were renewed. The Qur’ån differsfrom this narrative. It does not state that the tablets were broken or renewed, but mentions their being taken up by Moses after his anger had calmed and while the writingwas still on them.\n\n155a. Exod. 24:1 speaks of Moses having taken up seventy elders of Israel alongwith him, though they were forbidden to “come near the Lord”, and on this occasionMoses was in the mountain forty days and forty nights (Exod. 24:18). Although he isalso spoken of in the Bible as having gone into the mountains after the incident of thecalf-worship and to have remained there for forty days and forty nights (Exod. 34:28),the allusion in the Qur’ån is to the first incident. There was no occasion for a secondvisit according to the Holy Qur’ån.\n\n156a. No attribute of the Divine Being receives such prominence in the Holy Qur’ånas the attribute of mercy. Evil there is in the world, and the evil-doers must receive theirdue, but mark the contrast: And My mercy encompasses all things. The truth is that evenchastisement is a phase of Divine mercy, because it seeks not to punish, but to correctthe evil-doers. Divine mercy, we are here told, is specially ordained for those who keeptheir duty and who believe in the Divine revelations given to Prophet Muƒammad.\n\n157a. For ummß, meaning one who neither writes nor reads a writing, see 2:78a.Hence the Arabs are called an ummß people, and the Ummß Prophet is either the prophetof the ummß people (i.e. the Arabs) because he was like them, or he was so calledbecause he himself did not know reading and writing (R). But according to some, theprophet is called Ummß because he came from the Umm al-Qurå, i.e. Makkah, which isthe Metropolis of Arabia (MB).The suggestion of Rodwell that the word ummß means gentile in the sense of a nonJewish or heathen people is not supported by any recognized authority; see 2:78, wherethe Jews are called ummß. LL, it is true, gives gentile as the signification of ummß, but areference to the authorities he quotes clearly shows that if the word gentile expresses themeaning of ummß, it does so in the general sense of one belonging to a gens or clan;therefore Lane’s conclusion that in a tropical and secondary sense ummß means heathenis entirely without foundation.As for the fact that the Holy Prophet was unable to read or write before revelationcame to him, there can be no two opinions. On this point the Qur’ån is conclusive: “Andthou didst not recite before it any book, nor didst thou transcribe one with thy righthand” (29:48). There is a difference of opinion, however, as to whether he could read orwrite after revelation. Without entering into the details of this controversy I may remarkthat, while there is ground for believing that he could read, he still had his letters writtenby others; see 29:48a.\n\n157b. There are many prophecies regarding the advent of the Holy Prophet both inthe Old and the New Testament. The Torah and the Gospel are specially mentioned herebecause Moses and Jesus were respectively the first and the last of the Israeliteprophets. Deut. 18:15–18 speaks very clearly of the raising of a prophet (who shall bethe like of Moses) from among the brethren of the Israelites, i.e. the Ishmaelites or theArabs, while Deut. 33:2 speaks of the shining forth of the manifestation of the Lord,i.e. his coming in full glory “from Mount Paran”. The Gospel is full of the prophecies ofthe advent of the Holy Prophet; Matt. 21:33– 44, Mark 12:1–11, Luke 20:9 –18, wherethe Lord of the vineyard comes after the son (i.e. Jesus) is maltreated, and Matt. 13:31–32, John 1:21, John 14:16, John 14:26 all contain such prophecies.\n\n157c. Noldeke’s supposition that there is a reference to the An©år, i.e. the helpers ofMadßnah, here, and Rodwell’s conclusion that hence the verse must have been added atMadßnah, are not entitled to serious consideration. Was the Prophet without any helpersat Makkah?\n\n158a. As against the various prophets spoken of in this chapter, every one of whomwas sent to his people (qaumi-hß), the Prophet Muƒammad is here spoken of as havingbeen sent to all people, to the whole of mankind. Thus the appearance of the ProphetMuƒammad was a turning point in the history of humanity. The day of the nationalprophet was over and a new era had dawned in which the whole of humanity was ultimately to be united under one spiritual head. Six hundred years before, Jesus Christ, thelast of the national prophets, said to a non-Israelite woman that he was “not sent butunto the lost sheep of the house of Israel” (Matt. 15:24); and being pressed, only added:“It is not meet to take the children’s bread, and cast it to dogs” (Matt. 15:26). In the newera, however, the idea of nationality had to give place to the broader idea of one humanity, and the basis of it was laid by the Holy Qur’ån.\n\n159a. Thus the Qur’ån recognizes that there were good people among the Jews.\n\n162a. For the statements made in vv. 160 –162, see 2:60a, 60b; 2:57a, 57b; 2:58a,58b, 58c; 2:59a, 59b.\n\n163a. The city referred to here is generally recognized as being Ela, which wassituated on the Red Sea. The incident alluded to is mentioned as an instance of theJewish violation of the Sabbath. The fish appeared on the surface of the water on theSabbath because they had a sense of security on that day. This was a temptation forthe people to break the law.\n\n166a. See 2:65b.\n\n169a. Lexicologists recognize a difference between khalf and khalaf, the formerbeing applied to evil and the latter to good, whether a son or a generation (LL).\n\n169b. First they commit a crime for the frail goods of this life, saying that they willbe forgiven; then persist in their evil course and when a similar occasion arises, theyagain return to the old crimes. There is no repentance.\n\n171a. The stories built upon these simple words by some commentators must berejected. The words simply relate the experience of the elders of Israel when they stoodat the foot of the mountain, which rose above them. There was a severe earthquake,which is referred to in v. 155, causing them to think that the mountain would fall downupon them. According to LA, the primary significance of natq is za‘za‘, which meansthe moving, agitating, shaking, or putting a thing into a state of commotion. Thus theuse of nataqnå instead of rafa‘nå (2:63) clearly explains that the mountain was shakenviolently by an earthquake while the elders of Israel stood at its foot. Natq has alsoanother meaning, viz. taking up from the roots, but this is not the significance here.\n\n172a. The verse does not mention the bringing forth of descendants from Adam, butfrom the children of Adam, and this seems clearly to refer to every human being as hecomes into existence. The evidence is, therefore, that which human nature itselfaffords. It is, in fact, the same evidence which is elsewhere spoken of as being affordedby human nature as in “the nature made by Allåh in which He has created men” (30:30).\n\n173a. The Arabic word is mubΔil, which means one who says a thing in which is notruth or reality (R-LL).\n\n175a. Balaam, Umayyah ibn Abß ˝alt, Ab∂ ‘Åmir, and all the hypocrites, have beenrespectively indicated as the persons referred to here, but the best explanation is suppliedby Qatådah, who says: It speaks generally of everyone to whom guidance is brought buthe turns aside from it. This view is corroborated by what is stated at the conclusion of theparable in v. 176, such is the parable of the people who reject Our messages.\n\n176a. Earth here stands for all that is earthly, for things material. The peoplespoken of here are those who do not care for the higher values of life.\n\n179a. Many men and jinn are created for hell, but they are none other than the heedless ones who do not care for what is said. They have been given hearts, but they do notuse them to understand the truth; they have been given eyes, but they do not employthem to see the truth; they have been given ears, but they turn a deaf ear to the truth.This has been stated to show that Allåh has not created them differently from others, butthey themselves do not use the faculties which Allåh has granted them.\n\n180a. By al-asmå’ al-ƒusnå are meant names expressing the most excellentattributes of the Divine Being. By calling on Him thereby is meant that man shouldalways keep the Divine attributes before his mind, endeavouring to possess thoseattributes, for it is only thus that he can attain to perfection.\n\n180b. Yulƒid∂n is from alƒada, meaning he deviated from the right course withrespect to a thing (LL). According to R, it means a deviation from the right course withrespect to the names of Allåh, or violation of the sanctity of His names, and it is of twokinds: firstly, giving Him an improper or inaccurate attribute; and secondly, to interpretHis attributes in a manner which does not befit Him. Polytheism of every kind is, therefore, a violation of the sanctity of the Divine names.\n\n181a. “This is my community,” the Prophet is reported to have said (IJ, v. ix, p. 86).\n\n183a. The significance of the word kaid (translated here as scheme) is much misunderstood, like that of makr. Kaid indicates the exercising of art, ingenuity, cunning orskill in the management or ordering of affairs, with excellent consideration or deliberation, and ability to manage with subtlety according to his own free will (LL). Thus kåda(inf. n. kaid) means he contrived, devised or plotted a thing, whether good or bad(LA). And again kåda (aorist yakßdu) means he worked or laboured at or upon anything;he laboured, took pains, exerted himself, strove or struggled to do, executed or accomplished anything; he laboured, strove or struggled with anything to prevail or overcomeor to effect an object (LL). In a verse of al-‘Ajjåj, the word kaid, occurring in referenceto God, is rendered by LL as meaning His skilful ordering.\n\n187a. That is, the Hour with which they are threatened as being the hour of theirdoom. The word så‘at or the hour is used in the Holy Qur’ån to indicate both the doomof the guilty in this life and the time when a perfect manifestation of rewards andpunishments will take place in the Hereafter.\n\n188a. The simplicity and nobility of this statement as indicating the mission of aprophet is unsurpassed. He gives glad news of triumph to those who believe, warns theevil-doers of the evil consequences of their deeds in this life as well as in the next, buthe does not claim the possession of Divine powers. It is stated that on the day of thedeath of his son Ibråhßm, a total eclipse of the sun was witnessed. Some people began towhisper that the darkening of the sun was due to the death of the Prophet’s son; but hewas too sincere to allow men to remain under such a delusion, although it was calculatedto enhance his dignity in the eyes of his followers. He ascended the pulpit and thusaddressed the people: “Surely the sun and the moon are two signs of Allåh; they do notget eclipsed in consequence of the death of anybody nor on account of anyone’s life, sowhen you see this then call on Allåh, and magnify Him and pray to Him and give alms”(B. 16:2).\n\n189a. Sakn originally signifies being still, motionless, or quiet, but sakana ilai-himeans he trusted to or relied upon it so as to be easy or quiet in mind or inclined to it, orhe became familiar with it (LL).\n\n189b. That this verse refers to Adam and Eve is rejected by all reliable commentators. It describes the condition of man in general and refers to the evidence of his nature,for when in distress he always turns to Allåh, but when in ease he goes after other gods orhis own low desires. The verse clearly blames the idol-worshippers for associating otherswith Allåh, as is shown by the use of the plural in v. 190 and the verses that follow.\n\n193a. This verse speaks of the utter heedlessness of the reprobate. Invitation toTruth must, however, be extended to all, though some may not benefit by it. The meaning is further clarified in vv. 198, 199.\n\n194a. ‘Ibåd is the plural of ‘abd, which means a servant or a slave, and applies toman as being a bondman to his Creator. Every created thing being in a state of subjugation to God, as man is, the idols, along with other false gods, are here spoken of as‘ibåd, the significance being that they are all in a state of subjugation to God.\n\n197a. There is a prophecy here that not only will the power of the opponents befrustrated in the coming struggles when they will find no help from their gods, but thosevery gods, i.e. the idols, will not be able to save themselves and will be annihilated.\n\n200a. The primary significance of nazagha-h∂ is he censured him and charged himwith a vice and spoke evil of him (T). It also signifies the sowing of dissensions, and it isused in this sense in 12:100. According to R, the word signifies entering upon an affairwith the object of corrupting it. I prefer the first signification, taking nazgh as equivalentto false imputation, the devil in this case, as frequently in the Holy Qur’ån, standing forthe devilish enemies who spread all kinds of false reports concerning the Prophet,against which he is told to seek refuge in Allåh.\n\n201a. Ôå’if means a visitation (LL), originally going round. The visitation of thedevil means the happening of any grievous incident or the coming of an affliction fromthe hands of the devil, or the wicked acting in opposition to the righteous. Or the devil’svisitation may signify anger which blinds a man.\n\n201b. Being endowed with insight, they see their way out of the affliction. Or, themeaning is that anger does not blind them.\n\n202a. That is, the brethren of the devils, or the devil’s human associates.\n\n205a. Å©ål is the plural of a©l or a©ßl which means the evening time. Though thedirection to remember God is given in general terms, and requires a man to glorify Godat all times, yet the plural is used regarding the evening as referring to the fact that whilethere is only one regular prayer in the morning, in the evening there is a number of regular prayers, Òuhr, ‘A©r, Maghrib and ‘Ishå’.\n\n206a. The recital of this verse is followed by an actual prostration, so that the physical state of the body may be in perfect agreement with the spiritual condition of themind. There are in all fifteen occasions in the Qur’ån where the believers are required toprostrate themselves, and the Prophet’s practice was to prostrate himself when recitingsuch verses whether it was a recital during prayer service or on ordinaryoccasions. Other such verses are: 13:15; 16:50; 17:109; 19:58; 22:18; 22:77; 25:60;27:26; 32:15; 38:24; 41:38; 53:62; 84:21 and 96:19."
    }
  ]
}
