{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "عَبَسَ وَتَوَلَّىٰ",
      "verseStringB": "He frowned and turned away,"
    },
    {
      "verseNumber": 2,
      "verseString": "أَنْ جَاءَهُ الْأَعْمَىٰ",
      "verseStringB": "Because the blind man came to him.ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "وَمَا يُدْرِيكَ لَعَلَّهُ يَزَّكَّىٰ",
      "verseStringB": "And what would make thee know that he might purify himself,"
    },
    {
      "verseNumber": 4,
      "verseString": "أَوْ يَذَّكَّرُ فَتَنْفَعَهُ الذِّكْرَىٰ",
      "verseStringB": "Or be mindful, so the Reminder should profit him?"
    },
    {
      "verseNumber": 5,
      "verseString": "أَمَّا مَنِ اسْتَغْنَىٰ",
      "verseStringB": "As for him who considers himself free from need"
    },
    {
      "verseNumber": 6,
      "verseString": "فَأَنْتَ لَهُ تَصَدَّىٰ",
      "verseStringB": "To him thou dost attend."
    },
    {
      "verseNumber": 7,
      "verseString": "وَمَا عَلَيْكَ أَلَّا يَزَّكَّىٰ",
      "verseStringB": "And no blame is on thee, if he purify himself not.ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "وَأَمَّا مَنْ جَاءَكَ يَسْعَىٰ",
      "verseStringB": "And as to him who comes to thee striving hard,"
    },
    {
      "verseNumber": 9,
      "verseString": "وَهُوَ يَخْشَىٰ",
      "verseStringB": "And he fears —"
    },
    {
      "verseNumber": 10,
      "verseString": "فَأَنْتَ عَنْهُ تَلَهَّىٰ",
      "verseStringB": "To him thou payest no regard."
    },
    {
      "verseNumber": 11,
      "verseString": "كَلَّا إِنَّهَا تَذْكِرَةٌ",
      "verseStringB": "Nay, surely it is a Reminder."
    },
    {
      "verseNumber": 12,
      "verseString": "فَمَنْ شَاءَ ذَكَرَهُ",
      "verseStringB": "So let him, who will, mind it."
    },
    {
      "verseNumber": 13,
      "verseString": "فِي صُحُفٍ مُكَرَّمَةٍ",
      "verseStringB": "In honoured books,"
    },
    {
      "verseNumber": 14,
      "verseString": "مَرْفُوعَةٍ مُطَهَّرَةٍ",
      "verseStringB": "Exalted, purified,"
    },
    {
      "verseNumber": 15,
      "verseString": "بِأَيْدِي سَفَرَةٍ",
      "verseStringB": "In the hands of scribes,"
    },
    {
      "verseNumber": 16,
      "verseString": "كِرَامٍ بَرَرَةٍ",
      "verseStringB": "Noble, virtuous.ᵃ"
    },
    {
      "verseNumber": 17,
      "verseString": "قُتِلَ الْإِنْسَانُ مَا أَكْفَرَهُ",
      "verseStringB": "Woe to man! How ungrateful is he!"
    },
    {
      "verseNumber": 18,
      "verseString": "مِنْ أَيِّ شَيْءٍ خَلَقَهُ",
      "verseStringB": "Of what thing did He create him?"
    },
    {
      "verseNumber": 19,
      "verseString": "مِنْ نُطْفَةٍ خَلَقَهُ فَقَدَّرَهُ",
      "verseStringB": "Of a small life-germ. He creates him, then proportions him,ᵃ"
    },
    {
      "verseNumber": 20,
      "verseString": "ثُمَّ السَّبِيلَ يَسَّرَهُ",
      "verseStringB": "Then makes the way easy for him,"
    },
    {
      "verseNumber": 21,
      "verseString": "ثُمَّ أَمَاتَهُ فَأَقْبَرَهُ",
      "verseStringB": "Then He causes him to die, then assigns to him a grave,"
    },
    {
      "verseNumber": 22,
      "verseString": "ثُمَّ إِذَا شَاءَ أَنْشَرَهُ",
      "verseStringB": "Then, when He will, He raises him to life again."
    },
    {
      "verseNumber": 23,
      "verseString": "كَلَّا لَمَّا يَقْضِ مَا أَمَرَهُ",
      "verseStringB": "Nay, but he does not what He commands him."
    },
    {
      "verseNumber": 24,
      "verseString": "فَلْيَنْظُرِ الْإِنْسَانُ إِلَىٰ طَعَامِهِ",
      "verseStringB": "Then let man look at his food —"
    },
    {
      "verseNumber": 25,
      "verseString": "أَنَّا صَبَبْنَا الْمَاءَ صَبًّا",
      "verseStringB": "How We pour down abundant water,"
    },
    {
      "verseNumber": 26,
      "verseString": "ثُمَّ شَقَقْنَا الْأَرْضَ شَقًّا",
      "verseStringB": "Then cleave the earth, cleaving (it) asunder,"
    },
    {
      "verseNumber": 27,
      "verseString": "فَأَنْبَتْنَا فِيهَا حَبًّا",
      "verseStringB": "Then cause the grain to grow therein,"
    },
    {
      "verseNumber": 28,
      "verseString": "وَعِنَبًا وَقَضْبًا",
      "verseStringB": "And grapes and clover,"
    },
    {
      "verseNumber": 29,
      "verseString": "وَزَيْتُونًا وَنَخْلًا",
      "verseStringB": "And the olive and the palm,"
    },
    {
      "verseNumber": 30,
      "verseString": "وَحَدَائِقَ غُلْبًا",
      "verseStringB": "And thick gardens,"
    },
    {
      "verseNumber": 31,
      "verseString": "وَفَاكِهَةً وَأَبًّا",
      "verseStringB": "And fruits and herbage —"
    },
    {
      "verseNumber": 32,
      "verseString": "مَتَاعًا لَكُمْ وَلِأَنْعَامِكُمْ",
      "verseStringB": "A provision for you and your cattle."
    },
    {
      "verseNumber": 33,
      "verseString": "فَإِذَا جَاءَتِ الصَّاخَّةُ",
      "verseStringB": "But when the deafening cry comes,ᵃ"
    },
    {
      "verseNumber": 34,
      "verseString": "يَوْمَ يَفِرُّ الْمَرْءُ مِنْ أَخِيهِ",
      "verseStringB": "The day when a man flees from his brother,"
    },
    {
      "verseNumber": 35,
      "verseString": "وَأُمِّهِ وَأَبِيهِ",
      "verseStringB": "And his mother and his father,"
    },
    {
      "verseNumber": 36,
      "verseString": "وَصَاحِبَتِهِ وَبَنِيهِ",
      "verseStringB": "And his spouse and his sons."
    },
    {
      "verseNumber": 37,
      "verseString": "لِكُلِّ امْرِئٍ مِنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ",
      "verseStringB": "Every man of them, that day, will have concern enough to make him indifferent to others."
    },
    {
      "verseNumber": 38,
      "verseString": "وُجُوهٌ يَوْمَئِذٍ مُسْفِرَةٌ",
      "verseStringB": "Faces on that day will be bright,"
    },
    {
      "verseNumber": 39,
      "verseString": "ضَاحِكَةٌ مُسْتَبْشِرَةٌ",
      "verseStringB": "Laughing, joyous."
    },
    {
      "verseNumber": 40,
      "verseString": "وَوُجُوهٌ يَوْمَئِذٍ عَلَيْهَا غَبَرَةٌ",
      "verseStringB": "And faces on that day will have dust on them,"
    },
    {
      "verseNumber": 41,
      "verseString": "تَرْهَقُهَا قَتَرَةٌ",
      "verseStringB": "Darkness covering them.ᵃ"
    },
    {
      "verseNumber": 42,
      "verseString": "أُولَٰئِكَ هُمُ الْكَفَرَةُ الْفَجَرَةُ",
      "verseStringB": "Those are the disbelievers, the wicked."
    }
  ],
  "nameEnglish": "He Frowned",
  "nameTrans": "'Abasa",
  "nameArabic": "عبس",
  "chapterNumber": 80,
  "nVerses": 42,
  "footnotes": [
    {
      "note": "2a. The blind man was Ibn Umm Makt∂m (‘Abd Allåh, son of Shurai√), who came tothe Holy Prophet while he was explaining the doctrines of Islåm to an assembly of theleaders of the Quraish and, interrupting, asked to be taught what Allåh had revealed tohim. The Holy Prophet took this untimely interruption ill — he frowned and did not payany attention to his question; on which he received this revelation (Tr. 44:80). This incident shows that the source of the Holy Prophet’s revelation was other than his own mind.In the first place there was no ill-treatment for which the Holy Prophet should have repented, as Rodwell supposes him to have done. The Prophet’s inattention to an intruder, whilehe had not yet finished his conversation, was quite natural. Again, he did not chide theintruder for his interruption, but only disliked it and gave him no answer, as the words ofthe Qur’ån plainly show. Secondly, even if he may be supposed to have repented for nothaving given an answer to the blind man, it would have been sufficient to have recalledhim and treated him more gently. At any rate, if it were left to the option of an individual,he himself would be the last person to give permanence to a reproval for his own act.Hence the source from which the Holy Prophet received his revelation was outside hisown heart or his own inclinations.It may be noted that the chief trait of the Holy Prophet’s character was his great regardfor the poor. There are numerous incidents on record showing how he would do an oldwoman’s work for her, and how he, even when the head of a State at Madßnah, would carrythe load for one too weak to bear it. His wife Khådßjah thus describes this trait of his character: “Never, never will Allåh bring thee to disgrace, for thou art true to ties of relationship,and honourest thy guest and earnest for the indigent and helpest all in real distress” (B 1:1).He not only loved the poor from his youth to his old age, from the time that he was an ordinary citizen to the time that he became the ruler of the whole of Arabia, but he himselfchose to be classed among the poor in his life as well as in his death. Even when the wealthof Arabia lay at his feet, and his wives claimed share in that wealth, he showed his readinessto sacrifice every comfort, but not the honour of remaining a poor man.\n\n7a. If the Quraish leaders would not come out of the impurities of sin, the Prophetwas not to blame for it, so that on their account he should neglect the poor who came tohim earnestly desirous to be delivered from the bondage of sin.\n\n16a. The six verses from 11 to 16 are really a comfort to the Holy Prophet for thehint contained in the first ten is that the leaders would not mind his warning or accept hismessage, and that therefore he must apply himself to the poor, who would be raised toeminence by the Qur’ån. These verses tell him that the Qur’ån is a tadhkirah, a reminder,a source of eminence (7:2b). Vv. 15 and 16 clearly state that the scribes of the Qur’ånwill be virtuous men, who will be honoured in the world. Not only was this true of menlike Ab∂ Bakr, ‘Umar, ‘Uthmån and ‘Alß, who were among the first scribes of the HolyQur’ån, but even in its later history great rulers of empires earned their livelihood by writing copies of the Holy Qur’ån. Hence the prophecy was given as a comfort to the HolyProphet that he should not be grieved because the rich and the leaders did not accept him,for the poor who accepted him would be raised to eminence through the Holy Qur’ån.\n\n19a. Qaddara (inf. taqdßr) ordinarily signifies he made a thing according to a measure, or proportioned it, the significance being that God has allotted to man a certainsphere in which he can make progress. But it sometimes carries the same significance asaqdara, viz., he empowered him, enabled him, rendered him able (LL), and the meaning in this case would be that Allåh has not only created man, but he has also given himpower and ability, so that he can make progress, if he likes.\n\n33a. ˝åkhkhah literally signifies a cry that deafens by its vehemence (LL). Hence itis made to apply to the day of Resurrection; but it also means any calamity or misfortune, or a severe calamity (LL).\n\n41a. The brightness of the faces spoken of here indicates their joy; their being covered by darkness indicates sorrow or gloom."
    }
  ]
}
