{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "إِذَا الشَّمْسُ كُوِّرَتْ",
      "verseStringB": "When the sun is folded up,ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "وَإِذَا النُّجُومُ انْكَدَرَتْ",
      "verseStringB": "And when the stars are dustcoloured,ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "وَإِذَا الْجِبَالُ سُيِّرَتْ",
      "verseStringB": "And when the mountains are made to pass away,ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "وَإِذَا الْعِشَارُ عُطِّلَتْ",
      "verseStringB": "And when the camels are abandoned,ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "وَإِذَا الْوُحُوشُ حُشِرَتْ",
      "verseStringB": "And when the wild animals are gathered together,ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "وَإِذَا الْبِحَارُ سُجِّرَتْ",
      "verseStringB": "And when the cities are made to swell,ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "وَإِذَا النُّفُوسُ زُوِّجَتْ",
      "verseStringB": "And when men are united,ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "وَإِذَا الْمَوْءُودَةُ سُئِلَتْ",
      "verseStringB": "And when the one buried alive is asked"
    },
    {
      "verseNumber": 9,
      "verseString": "بِأَيِّ ذَنْبٍ قُتِلَتْ",
      "verseStringB": "For what sin she was killed,ᵃ"
    },
    {
      "verseNumber": 10,
      "verseString": "وَإِذَا الصُّحُفُ نُشِرَتْ",
      "verseStringB": "And when the books are spread,ᵃ"
    },
    {
      "verseNumber": 11,
      "verseString": "وَإِذَا السَّمَاءُ كُشِطَتْ",
      "verseStringB": "And when the heaven has its covering removed,ᵃ"
    },
    {
      "verseNumber": 12,
      "verseString": "وَإِذَا الْجَحِيمُ سُعِّرَتْ",
      "verseStringB": "And when hell is kindled,ᵃ"
    },
    {
      "verseNumber": 13,
      "verseString": "وَإِذَا الْجَنَّةُ أُزْلِفَتْ",
      "verseStringB": "And when the Garden is brought nigh a —"
    },
    {
      "verseNumber": 14,
      "verseString": "عَلِمَتْ نَفْسٌ مَا أَحْضَرَتْ",
      "verseStringB": "Every soul will know what it has prepared.ᵃ"
    },
    {
      "verseNumber": 15,
      "verseString": "فَلَا أُقْسِمُ بِالْخُنَّسِ",
      "verseStringB": "Nay, I call to witness the stars,"
    },
    {
      "verseNumber": 16,
      "verseString": "الْجَوَارِ الْكُنَّسِ",
      "verseStringB": "Running their course, (and) setting,ᵃ"
    },
    {
      "verseNumber": 17,
      "verseString": "وَاللَّيْلِ إِذَا عَسْعَسَ",
      "verseStringB": "And the night when it departs,"
    },
    {
      "verseNumber": 18,
      "verseString": "وَالصُّبْحِ إِذَا تَنَفَّسَ",
      "verseStringB": "And the morning when it brightens,ᵃ"
    },
    {
      "verseNumber": 19,
      "verseString": "إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ",
      "verseStringB": "Surely it is the word of a bountiful Messenger,"
    },
    {
      "verseNumber": 20,
      "verseString": "ذِي قُوَّةٍ عِنْدَ ذِي الْعَرْشِ مَكِينٍ",
      "verseStringB": "The possessor of strength, established in the presence of the Lord of the Throne,"
    },
    {
      "verseNumber": 21,
      "verseString": "مُطَاعٍ ثَمَّ أَمِينٍ",
      "verseStringB": "One (to be) obeyed, and faithful.ᵃ"
    },
    {
      "verseNumber": 22,
      "verseString": "وَمَا صَاحِبُكُمْ بِمَجْنُونٍ",
      "verseStringB": "And your companion is not mad."
    },
    {
      "verseNumber": 23,
      "verseString": "وَلَقَدْ رَآهُ بِالْأُفُقِ الْمُبِينِ",
      "verseStringB": "And truly he saw himself on the clear horizon.ᵃ"
    },
    {
      "verseNumber": 24,
      "verseString": "وَمَا هُوَ عَلَى الْغَيْبِ بِضَنِينٍ",
      "verseStringB": "Nor is he niggardly of the unseen.ᵃ"
    },
    {
      "verseNumber": 25,
      "verseString": "وَمَا هُوَ بِقَوْلِ شَيْطَانٍ رَجِيمٍ",
      "verseStringB": "Nor is it the word of an accursed devila —"
    },
    {
      "verseNumber": 26,
      "verseString": "فَأَيْنَ تَذْهَبُونَ",
      "verseStringB": "Whither then are you going?ᵃ"
    },
    {
      "verseNumber": 27,
      "verseString": "إِنْ هُوَ إِلَّا ذِكْرٌ لِلْعَالَمِينَ",
      "verseStringB": "It is naught but a Reminder for the nations,ᵃ"
    },
    {
      "verseNumber": 28,
      "verseString": "لِمَنْ شَاءَ مِنْكُمْ أَنْ يَسْتَقِيمَ",
      "verseStringB": "For him among you who will go straight.ᵃ"
    },
    {
      "verseNumber": 29,
      "verseString": "وَمَا تَشَاءُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ رَبُّ الْعَالَمِينَ",
      "verseStringB": "And you will not, except Allāh please, the Lord of the worlds."
    }
  ],
  "nameEnglish": "The Rolling",
  "nameTrans": "at-Takwir",
  "nameArabic": "التكوير",
  "chapterNumber": 81,
  "nVerses": 29,
  "footnotes": [
    {
      "note": "1a. For the significance of the folding up of the sun, see the introductory note. The firstthirteen verses of this chapter speak of twelve signs, some of which undoubtedly relate tothis life and the rest may therefore also be taken as referring metaphorically to this life. As Ihave so often shown, the Resurrection of the dead in another life may often contain a deeper reference to the spiritual resurrection which was to be brought about by the Prophet inthis very life, and hence the combination of the real with the metaphorical, as here.\n\n2a. The darkening of the stars indicates complete darkness, for when the sun is setthe light of the stars helps man. We are told that not only would the light of the day disappear, but even the smaller lights, to which the traveller looks in the darkness of thenight, would become dark, and so the opponents of Truth would be left in utter darkness.\n\n3a. The passing away of the mountains signifies the passing away of the greatestobstacles to the spread of Truth; see 20:105a.\n\n4a. ‘Ishår is plural of ‘usharå’ (from the root ‘ashr meaning ten), meaning a shecamel that has been ten months pregnant, and she is called ‘usharå’ until she hasbrought forth and also after she has brought forth (LL). “Farazdaq applies this term tocamels that are milked” (LL). Such camels are undoubtedly the most precious, and theirbeing abandoned may stand for the abandonment of camels generally. Bearing on thissubject is a √adßth of the Prophet: “The camels will be abandoned so that they will notbe used for going swiftly (from one place to another)” (Msh. 26:5). The reference in this√adßth is clearly to a time when swifter modes of going from one place to another willcome into existence, so that the camels will no more be needed.\n\n5a. The gathering together (ƒashr) of wild animals seems also to be a prophecy relating to the distant future, when the wild animals were to be gathered together from all corners of the world into big towns. The word wu√∂sh is the plural of wa√sh which means awild animal, such as is not tame or beasts of the desert (LL); and may be metaphoricallyapplied to barbarous or uncivilized people — a shy girl is called wa√sh — so that the reference may be to the gathering together of barbarous or uncivilized people in the centres ofcivilization. Note also that the word √ashr signifies not only going forth from one place toanother, but also in particular causing people to go down to cities or towns (LL).\n\n6a. I make a departure here from the ordinary translation. Bi√år is plural of ba√r,which means sea or river, and if that significance be adopted, the reference would be tothe destruction of the opponents, for the swollen sea (52:6) is plainly spoken of as ameans of the destruction of those who would extirpate Truth. But the word bi√år is theplural of ba√rah as well as of ba√r (T, LL), and baƒrah is synonymous with baldah or atown “and the plural biƒår they apply to cities as well as towns or villages” (T, LL).According to N, the Arabs call the cities and the towns al-bi√år. The words ba√rah (singular of bi√år) and bu√airah (diminutive of ba√rah) are also applied to Madßnah (N).This would leave no doubt that cities is as literal a significance of the word bi√år asseas. The swelling of cities is a clear indication that the advancing civilization of manwill result in men gathering more and more in cities. The words of the next verse corroborate this significance, as it speaks in clear words of the uniting of men.\n\n7a. The uniting of men is one of the greatest achievements of modern civilization.The time is not far distant indeed when the whole world will be united and may becomeas a single nation.\n\n9a. The reference here is to the burying alive of daughters, a practice common amongthe pre-Islamic Arabs who, either for fear of hunger or disgrace, buried alive their femalechildren. The questioning refers to the time when, with the predominance of Islåm inArabia, this barbarous practice was to be abolished. But the one buried alive may standgenerally for the female sex, and the reference here may, therefore, be to the generaltyranny of the male over the female, who has been kept in ignorance. See 17:31a, whereit is shown that the keeping ignorant of one’s children is equivalent to killing them.\n\n10a. ˝u√uf is the plural of ©a√ßfah, which means a written piece of paper or of skin.This may also be a prophetic reference to the distant future, with the circulation of booksand papers to an almost incredible extent. The Muslim world did immense service to thecause of the circulation of literature in the days of its prosperity, and it is recognized onall hands that the revival of learning in Europe, which has brought about the great circulation of books and papers, was itself a direct result of the impetus which Islåm gave tothe study of letters.\n\n11a. The removal of the covering of the heaven signifies the unveiling of the mysteries relating to the heavens, which is one of the great achievements of modern science.Compare 99:2 where the earth is spoken of as yielding her treasures.\n\n12a. It should be noted that apart from the hell of the next life, the Holy Qur’ån veryoften speaks of a hell in this life. Compare 79:36, and see 79:34a. Just as the righteousare promised heaven in this very life, the wicked are told that hell would be kindled forthem even here, if they had only the eyes to see it. And indeed there has been a veritablehell raging in this life since the Second World War. The forces of materialism havealready engulfed the world in a burning hell, and another World War would only makeits flames appear the more hideous.\n\n13a. While the previous verses give us a picture of the material civilization of theworld, v. 12 drawing attention to its culmination in the form of bringing about a hell inthis life owing to the utter neglect of all spiritual values, this verse gives the good newsof the Garden being brought nigh. In the Hereafter, the Garden would be a sure realityand the righteous will find themselves in it, enjoying its bliss, but here it is only spokenof as being brought nigh. The evident conclusion is that God has not doomed this worldto utter destruction, but that, when it has tasted somewhat of the evil consequences of itsown doings, Divine mercy will take it by the hand and bring the Garden of bliss near toit by bringing about a spiritual awakening. Thus the solace of mind which man canattain to through realization of the Divine in him is here described as the bringing nighof the Garden.\n\n14a. Man will then become conscious that there is a higher life, which is his realgoal, and he will know what to do to attain that goal.\n\n16a. Khunnas (v. 15) is the plural of khånis (from khanasa, he went back), meaninggoing backward, and signifies the stars in general, because they retire or hide themselves at setting, or because they become concealed in the day-time, or the planets(Saturn, Jupiter, Mars, Venus and Mercury), because of their retrogression (LL). Kunnas(“setting”) is the plural of kåni (from kanasa, he, an antelope, entered his kinås, i.e., hishiding-place), meaning an antelope, entering his hiding-place, and signifies the starsthat hide themselves in their places of setting, or the planets, for a similar reason (LL).The calling to witness of the stars that run their course and set also draws attention tothe disasters that awaited the opponents of the Truth; see 53:1a.\n\n18a. The departing of the night and the rise of the bright morning is clearly the disappearance of the darkness of ignorance, giving place to the bright light of the sun of Islåm.\n\n21a. The commentators generally suppose the angel Gabriel to be referred to in vv.19 –21, but the reference is to the Holy Prophet himself, who is undoubtedly Ras∂lkarßm, the bountiful Messenger, by which name he is generally known in the wholeMuslim world. Again, he is clearly spoken of as your companion in v. 22, while Gabrielcould not be called your companion. The negation of his being mad, spoken of in thatverse and so often referred to in these chapters, also shows him to be the Prophet himself. Moreover, v. 21 speaks of him as being faithful, clearly referring to his past reputation in the whole of Arabia as al-Amßn or the Faithful. His being a muΔå‘, or one to beobeyed, is also spoken of elsewhere in the Holy Qur’ån: “And We sent no messenger butthat he should be obeyed by Allåh’s command” (4:64). His being possessor of strengthprophetically refers to his future career and to his ultimate triumph over his enemies.\n\n23a. Ufuq is the horizon or the remote side, and the Prophet’s seeing himself on ufuqmeans that his light would shine in the remotest corners of the world. See also 53:7, 7a.\n\n24a. The Prophet (not Gabriel) is here declared to be not niggardly of the unseen,showing that there are some great prophecies relating to the future in what has gonebefore. And in fact, as I have shown, the chapter opens with prophecies of the triumphant career of Islåm and certain portents relating to the distant future, while the latter part of the chapter speaks plainly of the ultimate triumph of Truth.\n\n25a. It is not the word of the devil, i.e., these are not the conjectures of a soothsayer— the prophecies of the Qur’ån will be duly fulfilled. Sale’s comment is worthy of note:“The verse is an answer to a calumny of the infidels, who said the Qur’ån was only apiece of divination or magic; for the Arabs suppose the soothsayer or magician receiveshis intelligence from those evil spirits who are continually listening to learn what theycan from the inhabitants of heaven”. It should be borne in mind that where the Qur’ånspeaks of the listening by stealth of the devils, it is in reference to this old Arab belief. Itnowhere refers to this belief in words which would show that it upholds this old Arabbelief; on the other hand, there are ample indications that it rejects this belief.\n\n26a. Wonder is expressed that notwithstanding the clearest evidence of Truth,humanity has been so slow to accept it. They were invited to the Truth which gave thempeace, but they were not coming to it. Even such is the case today.\n\n27a. In the words — a Reminder for the nations — it is shown that it is not meantfor the Arabs alone but for all nations. This being one of the earliest revelations, clearlyshows that the foundations of the universality of the message of Islåm were laid on thevery first day.\n\n28a. How beautifully clear are the words of the Qur’ån! It is a source of eminencefor all the nations of the world, but only if people will follow its directions; hence it addsthe words, For him among you who will go straight. (For dhikr, “Reminder”, meaningeminence see 2:152a, 21:10a, 38:1b, 43:5a.) See further 76:30a for what is said in theverse that follows: “You will not, except Allåh please”."
    }
  ]
}
