{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "وَيْلٌ لِلْمُطَفِّفِينَ",
      "verseStringB": "Woe to the cheaters!ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "الَّذِينَ إِذَا اكْتَالُوا عَلَى النَّاسِ يَسْتَوْفُونَ",
      "verseStringB": "Who, when they take the measure (of their dues) from men, take it fully,"
    },
    {
      "verseNumber": 3,
      "verseString": "وَإِذَا كَالُوهُمْ أَوْ وَزَنُوهُمْ يُخْسِرُونَ",
      "verseStringB": "And when they measure out to others or weigh out for them, they give less than is due."
    },
    {
      "verseNumber": 4,
      "verseString": "أَلَا يَظُنُّ أُولَٰئِكَ أَنَّهُمْ مَبْعُوثُونَ",
      "verseStringB": "Do they not think that they will be raised again,"
    },
    {
      "verseNumber": 5,
      "verseString": "لِيَوْمٍ عَظِيمٍ",
      "verseStringB": "To a mighty day? —"
    },
    {
      "verseNumber": 6,
      "verseString": "يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ",
      "verseStringB": "The day when men will stand before the Lord of the worlds."
    },
    {
      "verseNumber": 7,
      "verseString": "كَلَّا إِنَّ كِتَابَ الْفُجَّارِ لَفِي سِجِّينٍ",
      "verseStringB": "Nay, surely the record of the wicked is in the prison.ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "وَمَا أَدْرَاكَ مَا سِجِّينٌ",
      "verseStringB": "And what will make thee know what the prison is?"
    },
    {
      "verseNumber": 9,
      "verseString": "كِتَابٌ مَرْقُومٌ",
      "verseStringB": "It is a written book."
    },
    {
      "verseNumber": 10,
      "verseString": "وَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ",
      "verseStringB": "Woe on that day to the rejectors!"
    },
    {
      "verseNumber": 11,
      "verseString": "الَّذِينَ يُكَذِّبُونَ بِيَوْمِ الدِّينِ",
      "verseStringB": "Who give the lie to the day of Judgment."
    },
    {
      "verseNumber": 12,
      "verseString": "وَمَا يُكَذِّبُ بِهِ إِلَّا كُلُّ مُعْتَدٍ أَثِيمٍ",
      "verseStringB": "And none gives the lie to it but every exceeder of limits, every sinful one;"
    },
    {
      "verseNumber": 13,
      "verseString": "إِذَا تُتْلَىٰ عَلَيْهِ آيَاتُنَا قَالَ أَسَاطِيرُ الْأَوَّلِينَ",
      "verseStringB": "When Our messages are recited to him, he says: Stories of those of yore!"
    },
    {
      "verseNumber": 14,
      "verseString": "كَلَّا ۖ بَلْ ۜ رَانَ عَلَىٰ قُلُوبِهِمْ مَا كَانُوا يَكْسِبُونَ",
      "verseStringB": "Nay, rather, what they earned is rust upon their hearts."
    },
    {
      "verseNumber": 15,
      "verseString": "كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لَمَحْجُوبُونَ",
      "verseStringB": "Nay, surely they are that day debarred from their Lord.ᵃ"
    },
    {
      "verseNumber": 16,
      "verseString": "ثُمَّ إِنَّهُمْ لَصَالُو الْجَحِيمِ",
      "verseStringB": "Then they will surely enter the burning Fire."
    },
    {
      "verseNumber": 17,
      "verseString": "ثُمَّ يُقَالُ هَٰذَا الَّذِي كُنْتُمْ بِهِ تُكَذِّبُونَ",
      "verseStringB": "Then it will be said: This is what you gave the lie to."
    },
    {
      "verseNumber": 18,
      "verseString": "كَلَّا إِنَّ كِتَابَ الْأَبْرَارِ لَفِي عِلِّيِّينَ",
      "verseStringB": "Nay, surely the record of the righteous is in the highest places.ᵃ"
    },
    {
      "verseNumber": 19,
      "verseString": "وَمَا أَدْرَاكَ مَا عِلِّيُّونَ",
      "verseStringB": "And what will make thee know what the highest places are?"
    },
    {
      "verseNumber": 20,
      "verseString": "كِتَابٌ مَرْقُومٌ",
      "verseStringB": "It is a written book."
    },
    {
      "verseNumber": 21,
      "verseString": "يَشْهَدُهُ الْمُقَرَّبُونَ",
      "verseStringB": "Those drawn near (to Allāh) witness it."
    },
    {
      "verseNumber": 22,
      "verseString": "إِنَّ الْأَبْرَارَ لَفِي نَعِيمٍ",
      "verseStringB": "Surely the righteous are in bliss,"
    },
    {
      "verseNumber": 23,
      "verseString": "عَلَى الْأَرَائِكِ يَنْظُرُونَ",
      "verseStringB": "On raised couches, gazing —"
    },
    {
      "verseNumber": 24,
      "verseString": "تَعْرِفُ فِي وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ",
      "verseStringB": "Thou recognizest in their faces the brightness of bliss."
    },
    {
      "verseNumber": 25,
      "verseString": "يُسْقَوْنَ مِنْ رَحِيقٍ مَخْتُومٍ",
      "verseStringB": "They are given to drink of a pure drink, sealed."
    },
    {
      "verseNumber": 26,
      "verseString": "خِتَامُهُ مِسْكٌ ۚ وَفِي ذَٰلِكَ فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ",
      "verseStringB": "The sealing of it is (with) musk. And for that let the aspirers aspire."
    },
    {
      "verseNumber": 27,
      "verseString": "وَمِزَاجُهُ مِنْ تَسْنِيمٍ",
      "verseStringB": "And it is tempered with water coming from abovea —"
    },
    {
      "verseNumber": 28,
      "verseString": "عَيْنًا يَشْرَبُ بِهَا الْمُقَرَّبُونَ",
      "verseStringB": "A fountain from which drink those drawn near (to Allāh)."
    },
    {
      "verseNumber": 29,
      "verseString": "إِنَّ الَّذِينَ أَجْرَمُوا كَانُوا مِنَ الَّذِينَ آمَنُوا يَضْحَكُونَ",
      "verseStringB": "Surely they who are guilty used to laugh at those who believe."
    },
    {
      "verseNumber": 30,
      "verseString": "وَإِذَا مَرُّوا بِهِمْ يَتَغَامَزُونَ",
      "verseStringB": "And when they passed by them, they winked at one another,"
    },
    {
      "verseNumber": 31,
      "verseString": "وَإِذَا انْقَلَبُوا إِلَىٰ أَهْلِهِمُ انْقَلَبُوا فَكِهِينَ",
      "verseStringB": "And when they returned to their people, they returned exulting."
    },
    {
      "verseNumber": 32,
      "verseString": "وَإِذَا رَأَوْهُمْ قَالُوا إِنَّ هَٰؤُلَاءِ لَضَالُّونَ",
      "verseStringB": "And when they saw them, they said: Surely these are in error —"
    },
    {
      "verseNumber": 33,
      "verseString": "وَمَا أُرْسِلُوا عَلَيْهِمْ حَافِظِينَ",
      "verseStringB": "And they were not sent as keepers over them."
    },
    {
      "verseNumber": 34,
      "verseString": "فَالْيَوْمَ الَّذِينَ آمَنُوا مِنَ الْكُفَّارِ يَضْحَكُونَ",
      "verseStringB": "So this day those who believe laugh at the disbelieversa—"
    },
    {
      "verseNumber": 35,
      "verseString": "عَلَى الْأَرَائِكِ يَنْظُرُونَ",
      "verseStringB": "On raised couches, gazing."
    },
    {
      "verseNumber": 36,
      "verseString": "هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوا يَفْعَلُونَ",
      "verseStringB": "Surely the disbelievers are rewarded as they did."
    }
  ],
  "nameEnglish": "The Defrauders",
  "nameTrans": "al-Mutaffifin",
  "nameArabic": "المطـفـفين",
  "chapterNumber": 83,
  "nVerses": 36,
  "footnotes": [
    {
      "note": "1a. MuΔaffif is one who gives short measure and short weight, thus cheating hiscompanion (LL). Ôaffafa (inf. n. taΔf ßf, which is the title of this chapter) means he madedefective or deficient in a general sense, and you say Δaffafa al-mikyål or al-mßzån toindicate that he gave short measure or short weight (LL). But the word is used in awider sense. A man did not attend the prayer in time, and being questioned by ‘Umar,offered some excuse, to which ‘Umar replied, Δaffafta, which is explained as meaningnaqa©ta, i.e., thou hast made a default (N). Hence the muΔaffif ßn are not only those whocheat others by giving them less than what is their due, but also those who made adefault in any of their duties. The taking of the measure and the measuring out, in thenext two verses, must also be read in a general sense.\n\n7a. Sijjßn is supposed by some to be the name of a place of a most degraded nature,but LA gives sijjßn as the equivalent of sijn, meaning a prison; this is also the interpretation preferred by Zj, A‘Ub and Mubarrad (Rz). But this prison should not be taken as signifying a gaol, for in the verses that follow the Qur’ån itself explains what this prison is. Inv. 9, it is spoken of as a written book. This written book or record, which preserves thedeeds of the evildoers, is called a prison because it keeps their faculties for the doing ofgood shut up as within a prison, and the very consequences of their evil deeds hamper theirprogress. See vv. 14 and 15, where the actions of the evildoers are spoken of as being ruston their hearts, and they are further referred to as being debarred from their Lord.\n\n15a. The punishment of the wicked is here described as their being debarred fromtheir Lord. They have no consciousness of the Higher Presence and, being thus debarredfrom their Lord in this life, enter the burning Fire in the next, as plainly stated in theverse that follows.\n\n18a. ‘Illiyy∂n is said by some to be the plural of ‘illß and by others to be that of‘illiyyah, while still others hold that it has no singular (LL). Like sijj ßn, some wouldmake it a proper name, but others rightly consider it to mean (from ‘alå, meaning itwas high) the highest of places and the most exalted of grades and the one (bringing aman) nearest to Allåh in the latter abode (N). But note that, like sijj ßn, it is not thename of a place but that of a record (v. 20); Q and Az give similar explanations. Thehighest places are thus the records of the best deeds, which enable a man to soar highand cut off the chains which bind him to low desires.\n\n27a. Tasnßm is generally taken to be a proper name, but bearing in mind what hasbeen said regarding sijj ßn and ‘illiyy∂n, Zj’s interpretation, a water coming upon themfrom above (LL), is preferable. The water coming from above signifies spiritually theknowledge of Allåh (Rz), because it is from this source that those who are drawn nigh toAllåh (v. 28) are made to drink.\n\n34a. The laughing of the believers is not to be taken literally. The word ˙a√ikah,which literally means laughing, also occurs elsewhere regarding the faces of the righteous (80:39), and signifies only the brightness of hope in their faces. The laughing inthis case simply expresses a condition of joy which should make one laugh. The reversalof the condition of the believers and the disbelievers is all that is meant."
    }
  ]
}
