{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "وَالسَّمَاءِ ذَاتِ الْبُرُوجِ",
      "verseStringB": "By the heaven full of stars!"
    },
    {
      "verseNumber": 2,
      "verseString": "وَالْيَوْمِ الْمَوْعُودِ",
      "verseStringB": "And the Promised day!"
    },
    {
      "verseNumber": 3,
      "verseString": "وَشَاهِدٍ وَمَشْهُودٍ",
      "verseStringB": "And the bearer of witness and that to which witness is borne!ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "قُتِلَ أَصْحَابُ الْأُخْدُودِ",
      "verseStringB": "Destruction overtake the companions of the trench!ᵃ —"
    },
    {
      "verseNumber": 5,
      "verseString": "النَّارِ ذَاتِ الْوَقُودِ",
      "verseStringB": "The fire fed with fuel —"
    },
    {
      "verseNumber": 6,
      "verseString": "إِذْ هُمْ عَلَيْهَا قُعُودٌ",
      "verseStringB": "When they sit by it,"
    },
    {
      "verseNumber": 7,
      "verseString": "وَهُمْ عَلَىٰ مَا يَفْعَلُونَ بِالْمُؤْمِنِينَ شُهُودٌ",
      "verseStringB": "And they are witnesses of what they do with the believers."
    },
    {
      "verseNumber": 8,
      "verseString": "وَمَا نَقَمُوا مِنْهُمْ إِلَّا أَنْ يُؤْمِنُوا بِاللَّهِ الْعَزِيزِ الْحَمِيدِ",
      "verseStringB": "And they punished them for naught but that they believed in Allāh, the Mighty, the Praised,"
    },
    {
      "verseNumber": 9,
      "verseString": "الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ",
      "verseStringB": "Whose is the kingdom of the heavens and the earth. And Allāh is Witness of all things."
    },
    {
      "verseNumber": 10,
      "verseString": "إِنَّ الَّذِينَ فَتَنُوا الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ثُمَّ لَمْ يَتُوبُوا فَلَهُمْ عَذَابُ جَهَنَّمَ وَلَهُمْ عَذَابُ الْحَرِيقِ",
      "verseStringB": "Those who persecute believing men and believing women, then repent not, theirs is the chastisement of hell, and theirs the chastisement of burning."
    },
    {
      "verseNumber": 11,
      "verseString": "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۚ ذَٰلِكَ الْفَوْزُ الْكَبِيرُ",
      "verseStringB": "Those who believe and do good, theirs are Gardens wherein flow rivers. That is the great achievement."
    },
    {
      "verseNumber": 12,
      "verseString": "إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ",
      "verseStringB": "Surely the grip of thy Lord is severe."
    },
    {
      "verseNumber": 13,
      "verseString": "إِنَّهُ هُوَ يُبْدِئُ وَيُعِيدُ",
      "verseStringB": "Surely He it is Who creates first and reproduces;"
    },
    {
      "verseNumber": 14,
      "verseString": "وَهُوَ الْغَفُورُ الْوَدُودُ",
      "verseStringB": "And He is the Forgiving, the Loving,"
    },
    {
      "verseNumber": 15,
      "verseString": "ذُو الْعَرْشِ الْمَجِيدُ",
      "verseStringB": "Lord of the Throne of Power, the Glorious,"
    },
    {
      "verseNumber": 16,
      "verseString": "فَعَّالٌ لِمَا يُرِيدُ",
      "verseStringB": "Doer of what He intends."
    },
    {
      "verseNumber": 17,
      "verseString": "هَلْ أَتَاكَ حَدِيثُ الْجُنُودِ",
      "verseStringB": "Has not there come to thee the story of the hosts,"
    },
    {
      "verseNumber": 18,
      "verseString": "فِرْعَوْنَ وَثَمُودَ",
      "verseStringB": "Of Pharaoh and Tham∂d?"
    },
    {
      "verseNumber": 19,
      "verseString": "بَلِ الَّذِينَ كَفَرُوا فِي تَكْذِيبٍ",
      "verseStringB": "Nay, those who disbelieve give the lie —"
    },
    {
      "verseNumber": 20,
      "verseString": "وَاللَّهُ مِنْ وَرَائِهِمْ مُحِيطٌ",
      "verseStringB": "And Allāh encompasses them on all sides."
    },
    {
      "verseNumber": 21,
      "verseString": "بَلْ هُوَ قُرْآنٌ مَجِيدٌ",
      "verseStringB": "Nay, it is a glorious Qur’ān,"
    },
    {
      "verseNumber": 22,
      "verseString": "فِي لَوْحٍ مَحْفُوظٍ",
      "verseStringB": "In a guarded tablet.ᵃ"
    }
  ],
  "nameEnglish": "The Constellations",
  "nameTrans": "al-Buruj",
  "nameArabic": "البروج",
  "chapterNumber": 85,
  "nVerses": 22,
  "footnotes": [
    {
      "note": "3a. Bur∂j is the plural of burj which means a tower or fortress or a sign of theZodiac or a star or constellation or asterism (LL). It is derived from baraja meaning itbecame manifest or high, and hence the various significations. As in 82:2 (see 82:4a),the stars stand for the lesser lights, in comparison with the sun to which the Prophethimself is likened (33:46), for companions of the Prophet or for the bearers of the message of Truth to people. In the heaven full of stars there is thus a reference to the preachers of Truth, who will scatter far and wide. Hence the mention of the promised day inthe next verse, the day of the triumph of Truth. Shåhid (bearer of witness) and shahßdboth signify the Prophet (see 4:41, etc.) and by that to which witness is borne is meantthe message of Truth. Or, the mashh∂d are those against whom the Prophet bears witness, i.e., the opponents of Truth.\n\n4a. The commentators give three different versions of the story supposed to bereferred to in this verse, the best-known being that the reference is to the persecution of some Christians by Dh∂ Nawås, a king of Yaman, who was of the Jewish religion (Rz).But Baghwß thinks that the reference is to Nebuchadnezzar’s casting Shadrach, Meshachand Abed-nego into the fiery furnace (Dan. 3:19 –21). I think there may, as well, be aprophetical reference here to the great Arab army against which the Muslims were compelled to defend themselves by means of a trench, in what is called the battle of theAllies or the battle of the Ditch; see 33:9a. The words of v. 7, and particularly of v. 10,clearly show that the reference here is to the enemies of the Holy Prophet, who persecuted the believing men and the believing women. Or, it is a prophetical reference to thestill more distant future, the trench being a feature of modern warfare. The fire keptburning with the fuel need not be taken literally, for fire stands for war.\n\n22a. The lau√, or tablet, occurring here, is the same as the alwå√ (singular, lau√), ortablets, occuring regarding the book given to Moses (7:145, 150, 154). The Qur’ån is herespoken of as being in a guarded tablet. The significance of these words is simplythis, that the Holy Qur’ån is guarded against corruption and against the attacks of itsopponents; compare 15:9: “Surely We have revealed the Reminder and surely We are itsGuardian”. There is no mention here or anywhere else in the Qur’ån of the lau√ ma√f ∂˚on which the decrees of God are written; but even if the reference here be to it, the significance is still the same, viz., that the Qur’ån shall be fully guarded — This is aglorious Qur’ån, protected against change and alteration (Rz). "
    }
  ]
}
