{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "وَالسَّمَاءِ وَالطَّارِقِ",
      "verseStringB": "By the heaven and the Comer by night!"
    },
    {
      "verseNumber": 2,
      "verseString": "وَمَا أَدْرَاكَ مَا الطَّارِقُ",
      "verseStringB": "And what will make thee know what the Comer by night is?"
    },
    {
      "verseNumber": 3,
      "verseString": "النَّجْمُ الثَّاقِبُ",
      "verseStringB": "The star of piercing brightnessa—"
    },
    {
      "verseNumber": 4,
      "verseString": "إِنْ كُلُّ نَفْسٍ لَمَّا عَلَيْهَا حَافِظٌ",
      "verseStringB": "There is not a soul but over it is a keeper.ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "فَلْيَنْظُرِ الْإِنْسَانُ مِمَّ خُلِقَ",
      "verseStringB": "So let man consider of what he is created."
    },
    {
      "verseNumber": 6,
      "verseString": "خُلِقَ مِنْ مَاءٍ دَافِقٍ",
      "verseStringB": "He is created of water pouring forth,"
    },
    {
      "verseNumber": 7,
      "verseString": "يَخْرُجُ مِنْ بَيْنِ الصُّلْبِ وَالتَّرَائِبِ",
      "verseStringB": "Coming from between the back and the ribs.ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "إِنَّهُ عَلَىٰ رَجْعِهِ لَقَادِرٌ",
      "verseStringB": "Surely He is Able to return him (to life)."
    },
    {
      "verseNumber": 9,
      "verseString": "يَوْمَ تُبْلَى السَّرَائِرُ",
      "verseStringB": "On the day when hidden things are manifested,ᵃ"
    },
    {
      "verseNumber": 10,
      "verseString": "فَمَا لَهُ مِنْ قُوَّةٍ وَلَا نَاصِرٍ",
      "verseStringB": "Then he will have no strength nor helper."
    },
    {
      "verseNumber": 11,
      "verseString": "وَالسَّمَاءِ ذَاتِ الرَّجْعِ",
      "verseStringB": "By the cloud giving rain,ᵃ"
    },
    {
      "verseNumber": 12,
      "verseString": "وَالْأَرْضِ ذَاتِ الصَّدْعِ",
      "verseStringB": "And the earth opening (with herbage)!"
    },
    {
      "verseNumber": 13,
      "verseString": "إِنَّهُ لَقَوْلٌ فَصْلٌ",
      "verseStringB": "Surely it is a decisive word,ᵃ"
    },
    {
      "verseNumber": 14,
      "verseString": "وَمَا هُوَ بِالْهَزْلِ",
      "verseStringB": "And it is not a joke."
    },
    {
      "verseNumber": 15,
      "verseString": "إِنَّهُمْ يَكِيدُونَ كَيْدًا",
      "verseStringB": "Surely they plan a plan,"
    },
    {
      "verseNumber": 16,
      "verseString": "وَأَكِيدُ كَيْدًا",
      "verseStringB": "And I plan a plan."
    },
    {
      "verseNumber": 17,
      "verseString": "فَمَهِّلِ الْكَافِرِينَ أَمْهِلْهُمْ رُوَيْدًا",
      "verseStringB": "So grant the disbelievers a respite — let them alone for a while.ᵃ"
    }
  ],
  "nameEnglish": "The Pulsar",
  "nameTrans": "at-Tariq",
  "nameArabic": "الـطارق",
  "chapterNumber": 86,
  "nVerses": 17,
  "footnotes": [
    {
      "note": "3a. Ôåriq (from Δarq, striking a thing) originally signifies a comer by night, becauseone who comes by night finds the doors shut, and knocking at the doors becomes necessary (N). The Comer by night is here the Holy Prophet; the revelation of the Qur’ån isalso spoken of as taking place on a blessed night (44:3; 97:1). The reason is that theHoly Prophet appeared when total darkness spread on the earth, and no one ever stoodmore in need of knocking at the doors which were shut against him and fastened withstrong bolts. It is noteworthy that Jesus compares his advent to that of a thief: “If thegoodman of the house had known in what watch the thief would come, he would havewatched, ... Therefore be ye also ready: for in such an hour as ye think not the Son ofman cometh” (Matt. 24:43, 44). It may be added that Ôåriq is also the name given to themorning star (LL), because it comes at the end of the night. But in that sense too theword is applicable to a great man or a chief, as in the saying of Hind on the day ofU√ud: “We are the daughters of the morning-star” (Ar., al-Δåriq) where the meaning isthat we are the daughters of a chief, “likening him to the star in elevation” (LL).In the third verse the Comer by night is called the star of piercing brightness, indicating that the Comer by night is a star of such resplendent brightness that all darknesswill be dispelled before him.\n\n4a. Though the words are general, and signify that the deeds done by man areguarded so that he cannot escape their consequences, there is also a comfort for the HolyProphet here that his opponents will not be able to harm him and that in time they willmeet their doom. This is made clear at the end of the chapter.\n\n7a. Water pouring forth means the sperma genitale. The expression between theback and the ribs is a euphemism. A similar expression occurs in a saying of the HolyProphet: “Whoever gives me a guarantee as to that which is between his two jaws andthat which is between his two feet, I guarantee for him paradise” (Msh. 24:10), the significance being the control of the tongue and the control of lust.\n\n9a. Note this description of the day of Resurrection. The hidden things are the consequences of one’s good or evil deeds, which will be made palpably manifest in theshape of Gardens and fruits or chains and Fire.\n\n11a. Raj‘ (the inf. noun of raja‘a, he returned) means rain, because God returns ittime after time, or because the water is raised from the sea and then returned to the earth,by the samå’ here being meant the cloud (LL).\n\n13a. The decisive word is the Holy Qur’ån. Just as when rain comes down, the earthproduces vegetation, so the coming of the Divine revelation is bound to raise a deadnation to life, and no efforts against it would hamper its progress. There is also a reference to the doom of the disbelievers in v. 10, in the words he will have no strength norhelper.\n\n17a. Whatever doubt there may be as to the significance of this chapter, it is dispelled by the last three verses, which speak of the plans of the opponents to exterminateTruth. The plan of God could not be frustrated, and the earth will receive life, but theProphet is told to wait for a while. The same is true today."
    }
  ]
}
