{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى",
      "verseStringB": "Glorify the name of thy Lord, the Most High!ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "الَّذِي خَلَقَ فَسَوَّىٰ",
      "verseStringB": "Who creates, then makes complete,"
    },
    {
      "verseNumber": 3,
      "verseString": "وَالَّذِي قَدَّرَ فَهَدَىٰ",
      "verseStringB": "And Who measures, then guides,ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "وَالَّذِي أَخْرَجَ الْمَرْعَىٰ",
      "verseStringB": "And Who brings forth herbage,"
    },
    {
      "verseNumber": 5,
      "verseString": "فَجَعَلَهُ غُثَاءً أَحْوَىٰ",
      "verseStringB": "Then makes it dried up, dustcoloured.ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "سَنُقْرِئُكَ فَلَا تَنْسَىٰ",
      "verseStringB": "We shall make thee recite so thou shalt not forget —"
    },
    {
      "verseNumber": 7,
      "verseString": "إِلَّا مَا شَاءَ اللَّهُ ۚ إِنَّهُ يَعْلَمُ الْجَهْرَ وَمَا يَخْفَىٰ",
      "verseStringB": "Except what Allāh please.ᵃ Surely He knows the manifest, and what is hidden."
    },
    {
      "verseNumber": 8,
      "verseString": "وَنُيَسِّرُكَ لِلْيُسْرَىٰ",
      "verseStringB": "And We shall make thy way smooth to a state of ease.ᵃ"
    },
    {
      "verseNumber": 9,
      "verseString": "فَذَكِّرْ إِنْ نَفَعَتِ الذِّكْرَىٰ",
      "verseStringB": "So remind, reminding indeed profits.ᵃ"
    },
    {
      "verseNumber": 10,
      "verseString": "سَيَذَّكَّرُ مَنْ يَخْشَىٰ",
      "verseStringB": "He who fears will mind,"
    },
    {
      "verseNumber": 11,
      "verseString": "وَيَتَجَنَّبُهَا الْأَشْقَى",
      "verseStringB": "And the most unfortunate one will avoid it,"
    },
    {
      "verseNumber": 12,
      "verseString": "الَّذِي يَصْلَى النَّارَ الْكُبْرَىٰ",
      "verseStringB": "Who will burn in the great Fire."
    },
    {
      "verseNumber": 13,
      "verseString": "ثُمَّ لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ",
      "verseStringB": "Then therein he will neither live nor die.ᵃ"
    },
    {
      "verseNumber": 14,
      "verseString": "قَدْ أَفْلَحَ مَنْ تَزَكَّىٰ",
      "verseStringB": "He indeed is successful who purifies himself,"
    },
    {
      "verseNumber": 15,
      "verseString": "وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّىٰ",
      "verseStringB": "And remembers the name of his Lord, then prays."
    },
    {
      "verseNumber": 16,
      "verseString": "بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا",
      "verseStringB": "But, you prefer the life of this world,"
    },
    {
      "verseNumber": 17,
      "verseString": "وَالْآخِرَةُ خَيْرٌ وَأَبْقَىٰ",
      "verseStringB": "While the Hereafter is better and more lasting."
    },
    {
      "verseNumber": 18,
      "verseString": "إِنَّ هَٰذَا لَفِي الصُّحُفِ الْأُولَىٰ",
      "verseStringB": "Surely this is in the earlier scriptures,"
    },
    {
      "verseNumber": 19,
      "verseString": "صُحُفِ إِبْرَاهِيمَ وَمُوسَىٰ",
      "verseStringB": "The scriptures of Abraham and Moses.ᵃ"
    }
  ],
  "nameEnglish": "The Most High",
  "nameTrans": "al-A'la",
  "nameArabic": "الأعـلى",
  "chapterNumber": 87,
  "nVerses": 19,
  "footnotes": [
    {
      "note": "1a. There is here in fact a message of great importance, not only for the Prophet,that he would be raised to the highest place to which man can rise, but for every manthat, through the glorification of God, he can rise to the highest place to which he iscapable of rising. Hence the order to glorify The Most High is immediately followed bythe words that He not only creates and makes complete but has also ordained a measurefor everyone and He guides everyone to this goal. The glorification of God is thus herestated to be the means of raising man to the highest place to which he is capable of rising. It should be noted that the most important dhikr in prayer is sub√åna rabbiya-l-A‘lå,which is repeated again and again when man is in a state of prostration and assumes thehumblest position of which he is capable, thus showing that it is by humbling himself tohis utmost before God that he can rise to the highest place.\n\n3a.  Vv. 2 and 3 speak of four Divine acts, khalq or creation, taswiyah or completion,taqdßr or measuring, and hidåyah or guiding. Everything in this universe is subject to thesefour laws, and so is man. He is created from a very humble and low beginning, his first condition being that of a life-germ which cannot be seen. Then it develops gradually tocomplete human form. This is the subject-matter of v. 2. The third verse then lays down thateverything in creation is held under control: it is made according to a measure and itsprogress lies along a certain line; and that it is God Who guides it or makes it walk alongthat line. The whole is in special reference to the spiritual advancement of man throughDivine glorification.\n\n5a. This is to show that herbage, too, receives life but there is no higher purpose inits creation beyond the fact that it serves to sustain man; so it dries up. But there is ahigher purpose in the creation of man; and it is to fulfil that purpose that God sends Hisrevelation, which is spoken of in the next verse.\n\n7a. Man is apt to forget, and the Prophet was a human being and he too was apt toforget. But he never forgot a word of the Divine revelation which came to him. Hesometimes received long chapters, such as the sixth, which runs into twenty sections, ona single occasion, but the whole was so deeply impressed on his mind that once it wasread out to him by the Holy Spirit, he repeated it without forgetting a word of it. Stillmore difficult was his task when chapters were received piecemeal. The reference inwhat Allåh please is not to Divine revelation which the Prophet never forgot, but toother things which he forgot as a human being.\n\n8a. The words predict the Prophet’s triumph and the removal of the distress inwhich Islåm was.\n\n9a. For in, meaning qad, or indeed, see LL, which quotes numerous instances fromthe Qur’ån as well as from Arabic prose and poetry.\n\n13a. There is no life in hell, for life is only for the righteous; neither is there death,because death signifies a state of complete rest.\n\n19a. The preference of the good of the Hereafter to the transitory advantage of thislife is the one great truth preached by all prophets. There is also a reference here to theprophecies concerning the Holy Prophet which are to be found in the revelation grantedrespectively to Abraham and to Moses; see 2:124a and 2:41a. Or, the essential principles of religion are meant, which are common to all the great religions."
    }
  ]
}
