{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "يَسْأَلُونَكَ عَنِ الْأَنْفَالِ ۖ قُلِ الْأَنْفَالُ لِلَّهِ وَالرَّسُولِ ۖ فَاتَّقُوا اللَّهَ وَأَصْلِحُوا ذَاتَ بَيْنِكُمْ ۖ وَأَطِيعُوا اللَّهَ وَرَسُولَهُ إِنْ كُنْتُمْ مُؤْمِنِينَ",
      "verseStringB": "They ask thee about voluntary gifts. Say: Voluntary gifts are for Allāh and the Messenger.ᵃ So keep your duty to Allāh and set aright your differences, and obey Allāh and His Messenger, if you are believers."
    },
    {
      "verseNumber": 2,
      "verseString": "إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ وَإِذَا تُلِيَتْ عَلَيْهِمْ آيَاتُهُ زَادَتْهُمْ إِيمَانًا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ",
      "verseStringB": "They only are believers whose hearts are full of fear when Allāh is mentioned, and when His messages are recited to them they increase them in faith, and in their Lord do they trust,"
    },
    {
      "verseNumber": 3,
      "verseString": "الَّذِينَ يُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ",
      "verseStringB": "Those who keep up prayer and spend out of what We have given them."
    },
    {
      "verseNumber": 4,
      "verseString": "أُولَٰئِكَ هُمُ الْمُؤْمِنُونَ حَقًّا ۚ لَهُمْ دَرَجَاتٌ عِنْدَ رَبِّهِمْ وَمَغْفِرَةٌ وَرِزْقٌ كَرِيمٌ",
      "verseStringB": "These are the believers in truth. For them are with their Lord exalted grades and protection and an honourable sustenance."
    },
    {
      "verseNumber": 5,
      "verseString": "كَمَا أَخْرَجَكَ رَبُّكَ مِنْ بَيْتِكَ بِالْحَقِّ وَإِنَّ فَرِيقًا مِنَ الْمُؤْمِنِينَ لَكَارِهُونَ",
      "verseStringB": "Even as thy Lord caused thee to go forth from thy house with truth, though a party of the believers were surely averse,ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "يُجَادِلُونَكَ فِي الْحَقِّ بَعْدَمَا تَبَيَّنَ كَأَنَّمَا يُسَاقُونَ إِلَى الْمَوْتِ وَهُمْ يَنْظُرُونَ",
      "verseStringB": "Disputing with thee about the truth after it had become clear — as if they were being driven to death while they saw (it)."
    },
    {
      "verseNumber": 7,
      "verseString": "وَإِذْ يَعِدُكُمُ اللَّهُ إِحْدَى الطَّائِفَتَيْنِ أَنَّهَا لَكُمْ وَتَوَدُّونَ أَنَّ غَيْرَ ذَاتِ الشَّوْكَةِ تَكُونُ لَكُمْ وَيُرِيدُ اللَّهُ أَنْ يُحِقَّ الْحَقَّ بِكَلِمَاتِهِ وَيَقْطَعَ دَابِرَ الْكَافِرِينَ",
      "verseStringB": "And when Allāh promised you one of the two parties that it should be yours, and you loved that the one not armed should be yours,ᵃ and Allāh desired to establish the Truth by His words,ᵇ and to cut off the root of the disbelievers —"
    },
    {
      "verseNumber": 8,
      "verseString": "لِيُحِقَّ الْحَقَّ وَيُبْطِلَ الْبَاطِلَ وَلَوْ كَرِهَ الْمُجْرِمُونَ",
      "verseStringB": "That He might cause the Truth to triumph and bring the falsehood to naught, though the guilty disliked."
    },
    {
      "verseNumber": 9,
      "verseString": "إِذْ تَسْتَغِيثُونَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ أَنِّي مُمِدُّكُمْ بِأَلْفٍ مِنَ الْمَلَائِكَةِ مُرْدِفِينَ",
      "verseStringB": "When you sought the aid of your Lord, so He answered you: I will assist you with a thousand of the angels following one another."
    },
    {
      "verseNumber": 10,
      "verseString": "وَمَا جَعَلَهُ اللَّهُ إِلَّا بُشْرَىٰ وَلِتَطْمَئِنَّ بِهِ قُلُوبُكُمْ ۚ وَمَا النَّصْرُ إِلَّا مِنْ عِنْدِ اللَّهِ ۚ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ",
      "verseStringB": "And Allāh gave it only as good news, and that your hearts might be at ease thereby. And victory is only from Allāh; surely Allāh is Mighty, Wise.ᵃ"
    },
    {
      "verseNumber": 11,
      "verseString": "إِذْ يُغَشِّيكُمُ النُّعَاسَ أَمَنَةً مِنْهُ وَيُنَزِّلُ عَلَيْكُمْ مِنَ السَّمَاءِ مَاءً لِيُطَهِّرَكُمْ بِهِ وَيُذْهِبَ عَنْكُمْ رِجْزَ الشَّيْطَانِ وَلِيَرْبِطَ عَلَىٰ قُلُوبِكُمْ وَيُثَبِّتَ بِهِ الْأَقْدَامَ",
      "verseStringB": "When He made slumber fall on you as a security from Him, and sent down upon you water from the clouds that He might thereby purify you,ᵃ and take away from you the uncleanness of the devil, and that He might fortify your hearts and make firm (your) feet thereby.ᵇ"
    },
    {
      "verseNumber": 12,
      "verseString": "إِذْ يُوحِي رَبُّكَ إِلَى الْمَلَائِكَةِ أَنِّي مَعَكُمْ فَثَبِّتُوا الَّذِينَ آمَنُوا ۚ سَأُلْقِي فِي قُلُوبِ الَّذِينَ كَفَرُوا الرُّعْبَ فَاضْرِبُوا فَوْقَ الْأَعْنَاقِ وَاضْرِبُوا مِنْهُمْ كُلَّ بَنَانٍ",
      "verseStringB": "When thy Lord revealed to the angels: I am with you, so make firm those who believe. I will cast terror into the hearts of those who disbelieve. So smite above the necks and smite every finger-tip of them.ᵃ"
    },
    {
      "verseNumber": 13,
      "verseString": "ذَٰلِكَ بِأَنَّهُمْ شَاقُّوا اللَّهَ وَرَسُولَهُ ۚ وَمَنْ يُشَاقِقِ اللَّهَ وَرَسُولَهُ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ",
      "verseStringB": "This is because they opposed Allāh and His Messenger. And whoever opposes Allāh and His Messenger — then surely Allāh is Severe in requiting."
    },
    {
      "verseNumber": 14,
      "verseString": "ذَٰلِكُمْ فَذُوقُوهُ وَأَنَّ لِلْكَافِرِينَ عَذَابَ النَّارِ",
      "verseStringB": "This — taste it, and (know) that for the disbelievers is the chastisement of the Fire.ᵃ"
    },
    {
      "verseNumber": 15,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا لَقِيتُمُ الَّذِينَ كَفَرُوا زَحْفًا فَلَا تُوَلُّوهُمُ الْأَدْبَارَ",
      "verseStringB": "O you who believe, when you meet those who disbelieve marching for war, turn not your backs to them.ᵃ"
    },
    {
      "verseNumber": 16,
      "verseString": "وَمَنْ يُوَلِّهِمْ يَوْمَئِذٍ دُبُرَهُ إِلَّا مُتَحَرِّفًا لِقِتَالٍ أَوْ مُتَحَيِّزًا إِلَىٰ فِئَةٍ فَقَدْ بَاءَ بِغَضَبٍ مِنَ اللَّهِ وَمَأْوَاهُ جَهَنَّمُ ۖ وَبِئْسَ الْمَصِيرُ",
      "verseStringB": "And whoso turns his back to them on that day — unless manoeuvring for battle or turning to join a company — he, indeed, incurs Allāh’s wrath and his refuge is hell. And an evil destInᵃ tion it is."
    },
    {
      "verseNumber": 17,
      "verseString": "فَلَمْ تَقْتُلُوهُمْ وَلَٰكِنَّ اللَّهَ قَتَلَهُمْ ۚ وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَٰكِنَّ اللَّهَ رَمَىٰ ۚ وَلِيُبْلِيَ الْمُؤْمِنِينَ مِنْهُ بَلَاءً حَسَنًا ۚ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ",
      "verseStringB": "So you slew them not but Allāh slew them, and thou smotest not when thou didst smite (the enemy), but Allāh smote (him),ᵃ and that He might confer upon the believers a benefitb from Himself. Surely Allāh is Hearing, Knowing."
    },
    {
      "verseNumber": 18,
      "verseString": "ذَٰلِكُمْ وَأَنَّ اللَّهَ مُوهِنُ كَيْدِ الْكَافِرِينَ",
      "verseStringB": "Thisa — and (know) that Allāh will weaken the struggle of the dis - believers."
    },
    {
      "verseNumber": 19,
      "verseString": "إِنْ تَسْتَفْتِحُوا فَقَدْ جَاءَكُمُ الْفَتْحُ ۖ وَإِنْ تَنْتَهُوا فَهُوَ خَيْرٌ لَكُمْ ۖ وَإِنْ تَعُودُوا نَعُدْ وَلَنْ تُغْنِيَ عَنْكُمْ فِئَتُكُمْ شَيْئًا وَلَوْ كَثُرَتْ وَأَنَّ اللَّهَ مَعَ الْمُؤْمِنِينَ",
      "verseStringB": "If you sought a judgment, the judgment has indeed come to you;ᵃ and if you desist, it is better for you. And if you return (to fight), We (too) shall return and your forces will avail you nothing, though they may be many; and (know) that Allāh is with the believers."
    },
    {
      "verseNumber": 20,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَوَلَّوْا عَنْهُ وَأَنْتُمْ تَسْمَعُونَ",
      "verseStringB": "O you who believe, obey Allāh and His Messenger and turn not away from Him while you hear."
    },
    {
      "verseNumber": 21,
      "verseString": "وَلَا تَكُونُوا كَالَّذِينَ قَالُوا سَمِعْنَا وَهُمْ لَا يَسْمَعُونَ",
      "verseStringB": "And be not like those who say, We hear; and they hear not."
    },
    {
      "verseNumber": 22,
      "verseString": "إِنَّ شَرَّ الدَّوَابِّ عِنْدَ اللَّهِ الصُّمُّ الْبُكْمُ الَّذِينَ لَا يَعْقِلُونَ",
      "verseStringB": "Surely the vilest of beasts,ᵃ in Allāh’s sight, are the deaf, the dumb, who understand not."
    },
    {
      "verseNumber": 23,
      "verseString": "وَلَوْ عَلِمَ اللَّهُ فِيهِمْ خَيْرًا لَأَسْمَعَهُمْ ۖ وَلَوْ أَسْمَعَهُمْ لَتَوَلَّوْا وَهُمْ مُعْرِضُونَ",
      "verseStringB": "And if Allāh had known any good in them, He would have made them hear. And if He makes them hear, they would turn away while they are averse."
    },
    {
      "verseNumber": 24,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ لِمَا يُحْيِيكُمْ ۖ وَاعْلَمُوا أَنَّ اللَّهَ يَحُولُ بَيْنَ الْمَرْءِ وَقَلْبِهِ وَأَنَّهُ إِلَيْهِ تُحْشَرُونَ",
      "verseStringB": "O you who believe, respond to Allāh and His Messenger, when he calls you to that which gives you life.ᵃ And know that Allāh comes in between a man and his heart,ᵇ and that to Him you will be gathered."
    },
    {
      "verseNumber": 25,
      "verseString": "وَاتَّقُوا فِتْنَةً لَا تُصِيبَنَّ الَّذِينَ ظَلَمُوا مِنْكُمْ خَاصَّةً ۖ وَاعْلَمُوا أَنَّ اللَّهَ شَدِيدُ الْعِقَابِ",
      "verseStringB": "And guard yourselves against an affliction which may not smite those of you exclusively who are unjust;ᵃ and know that Allāh is Severe in requiting."
    },
    {
      "verseNumber": 26,
      "verseString": "وَاذْكُرُوا إِذْ أَنْتُمْ قَلِيلٌ مُسْتَضْعَفُونَ فِي الْأَرْضِ تَخَافُونَ أَنْ يَتَخَطَّفَكُمُ النَّاسُ فَآوَاكُمْ وَأَيَّدَكُمْ بِنَصْرِهِ وَرَزَقَكُمْ مِنَ الطَّيِّبَاتِ لَعَلَّكُمْ تَشْكُرُونَ",
      "verseStringB": "And remember when you were few, deemed weak in the land, fearing lest people should carry you off by force,ᵃ He sheltered you and strengthened you with His help, and gave you of the good things that you might give thanks."
    },
    {
      "verseNumber": 27,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَخُونُوا اللَّهَ وَالرَّسُولَ وَتَخُونُوا أَمَانَاتِكُمْ وَأَنْتُمْ تَعْلَمُونَ",
      "verseStringB": "O you who believe, be not unfaithful to Allāh and the Messenger, nor be unfaithful to your trusts, while you know."
    },
    {
      "verseNumber": 28,
      "verseString": "وَاعْلَمُوا أَنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ وَأَنَّ اللَّهَ عِنْدَهُ أَجْرٌ عَظِيمٌ",
      "verseStringB": "And know that your wealth and your children are a temptation, and that Allāh is He with Whom there is a mighty reward."
    },
    {
      "verseNumber": 29,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِنْ تَتَّقُوا اللَّهَ يَجْعَلْ لَكُمْ فُرْقَانًا وَيُكَفِّرْ عَنْكُمْ سَيِّئَاتِكُمْ وَيَغْفِرْ لَكُمْ ۗ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ",
      "verseStringB": "O you who believe, if you keep your duty to Allāh, He will grant you a distinction and do away with your evils and protect you. And Allāh is the Lord of mighty grace."
    },
    {
      "verseNumber": 30,
      "verseString": "وَإِذْ يَمْكُرُ بِكَ الَّذِينَ كَفَرُوا لِيُثْبِتُوكَ أَوْ يَقْتُلُوكَ أَوْ يُخْرِجُوكَ ۚ وَيَمْكُرُونَ وَيَمْكُرُ اللَّهُ ۖ وَاللَّهُ خَيْرُ الْمَاكِرِينَ",
      "verseStringB": "And when those who disbelieved devised plans against thee that they might confine thee or slay thee or drive thee away — and they devised plans and Allāh, too, had arranged a plan; and Allāh is the best of planners.ᵃ"
    },
    {
      "verseNumber": 31,
      "verseString": "وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا قَالُوا قَدْ سَمِعْنَا لَوْ نَشَاءُ لَقُلْنَا مِثْلَ هَٰذَا ۙ إِنْ هَٰذَا إِلَّا أَسَاطِيرُ الْأَوَّلِينَ",
      "verseStringB": "And when Our messages are recited to them, they say: We have heard. If we wished, we could say the like of it;ᵃ this is nothing but the stories of the ancients."
    },
    {
      "verseNumber": 32,
      "verseString": "وَإِذْ قَالُوا اللَّهُمَّ إِنْ كَانَ هَٰذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِنَ السَّمَاءِ أَوِ ائْتِنَا بِعَذَابٍ أَلِيمٍ",
      "verseStringB": "And when they said: O Allāh, if this is indeed the truth from Thee, then rain down on us stones from heaven or inflict on us a painful chastisement."
    },
    {
      "verseNumber": 33,
      "verseString": "وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ ۚ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ",
      "verseStringB": "And Allāh would not chastise them while thou wast among them; nor would Allāh chastise them while they seek forgiveness.ᵃ"
    },
    {
      "verseNumber": 34,
      "verseString": "وَمَا لَهُمْ أَلَّا يُعَذِّبَهُمُ اللَّهُ وَهُمْ يَصُدُّونَ عَنِ الْمَسْجِدِ الْحَرَامِ وَمَا كَانُوا أَوْلِيَاءَهُ ۚ إِنْ أَوْلِيَاؤُهُ إِلَّا الْمُتَّقُونَ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
      "verseStringB": "And what excuse have they that Allāh should not chastise them while they hinder (men) from the Sacred Mosque and they are not its (true) guardians? Its guardians are only those who keep their duty, but most of them know not.ᵃ"
    },
    {
      "verseNumber": 35,
      "verseString": "وَمَا كَانَ صَلَاتُهُمْ عِنْدَ الْبَيْتِ إِلَّا مُكَاءً وَتَصْدِيَةً ۚ فَذُوقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُونَ",
      "verseStringB": "And their prayer at the House is nothing but whistling and clapping of hands.ᵃ Taste, then, the chastisement, because you disbelieved."
    },
    {
      "verseNumber": 36,
      "verseString": "إِنَّ الَّذِينَ كَفَرُوا يُنْفِقُونَ أَمْوَالَهُمْ لِيَصُدُّوا عَنْ سَبِيلِ اللَّهِ ۚ فَسَيُنْفِقُونَهَا ثُمَّ تَكُونُ عَلَيْهِمْ حَسْرَةً ثُمَّ يُغْلَبُونَ ۗ وَالَّذِينَ كَفَرُوا إِلَىٰ جَهَنَّمَ يُحْشَرُونَ",
      "verseStringB": "Surely those who disbelieve spend their wealth to hinder (people) from the way of Allāh. So they will go on spending it, then it will be to them a regret, then they will be overcome. And those who disbelieve will be gathered together to hell,"
    },
    {
      "verseNumber": 37,
      "verseString": "لِيَمِيزَ اللَّهُ الْخَبِيثَ مِنَ الطَّيِّبِ وَيَجْعَلَ الْخَبِيثَ بَعْضَهُ عَلَىٰ بَعْضٍ فَيَرْكُمَهُ جَمِيعًا فَيَجْعَلَهُ فِي جَهَنَّمَ ۚ أُولَٰئِكَ هُمُ الْخَاسِرُونَ",
      "verseStringB": "That Allāh may separate the wicked from the good, and put the wicked one upon another, then heap them together, then cast them into hell. These indeed are the losers."
    },
    {
      "verseNumber": 38,
      "verseString": "قُلْ لِلَّذِينَ كَفَرُوا إِنْ يَنْتَهُوا يُغْفَرْ لَهُمْ مَا قَدْ سَلَفَ وَإِنْ يَعُودُوا فَقَدْ مَضَتْ سُنَّتُ الْأَوَّلِينَ",
      "verseStringB": "Say to those who disbelieve, if they desist, that which is past will be forgiven them; and if they return,ᵃ then the example of those of old has already gone.ᵇ"
    },
    {
      "verseNumber": 39,
      "verseString": "وَقَاتِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَةٌ وَيَكُونَ الدِّينُ كُلُّهُ لِلَّهِ ۚ فَإِنِ انْتَهَوْا فَإِنَّ اللَّهَ بِمَا يَعْمَلُونَ بَصِيرٌ",
      "verseStringB": "And fight with them until there is no more persecution, and all religions are for Allāh. But if they desist, then surely Allāh is Seer of what they do.ᵃ"
    },
    {
      "verseNumber": 40,
      "verseString": "وَإِنْ تَوَلَّوْا فَاعْلَمُوا أَنَّ اللَّهَ مَوْلَاكُمْ ۚ نِعْمَ الْمَوْلَىٰ وَنِعْمَ النَّصِيرُ",
      "verseStringB": "And if they turn back, then know that Allāh is your Patron. Most excellent the Patron and most excellent the Helper!ᵃ"
    },
    {
      "verseNumber": 41,
      "verseString": "وَاعْلَمُوا أَنَّمَا غَنِمْتُمْ مِنْ شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ إِنْ كُنْتُمْ آمَنْتُمْ بِاللَّهِ وَمَا أَنْزَلْنَا عَلَىٰ عَبْدِنَا يَوْمَ الْفُرْقَانِ يَوْمَ الْتَقَى الْجَمْعَانِ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "And know that whatever you acquire in war, a fifth of it is for Allāh and for the Messenger and for the near of kin and the orphans and the needy and the wayfarer, if you believe in Allāh and in that which We revealed to Our servant, on the day of DiscrimInᵃ tion, the day on which the two parties met. And Allāh is Possessor of power over all things.ᵃ"
    },
    {
      "verseNumber": 42,
      "verseString": "إِذْ أَنْتُمْ بِالْعُدْوَةِ الدُّنْيَا وَهُمْ بِالْعُدْوَةِ الْقُصْوَىٰ وَالرَّكْبُ أَسْفَلَ مِنْكُمْ ۚ وَلَوْ تَوَاعَدْتُمْ لَاخْتَلَفْتُمْ فِي الْمِيعَادِ ۙ وَلَٰكِنْ لِيَقْضِيَ اللَّهُ أَمْرًا كَانَ مَفْعُولًا لِيَهْلِكَ مَنْ هَلَكَ عَنْ بَيِّنَةٍ وَيَحْيَىٰ مَنْ حَيَّ عَنْ بَيِّنَةٍ ۗ وَإِنَّ اللَّهَ لَسَمِيعٌ عَلِيمٌ",
      "verseStringB": "When you were on the nearer side (of the valley) and they were on the farther side, while the caravan was in a lower place than you.ᵃ And if you had tried to make a mutual appointment, you would certainly have broken away from the appointment,ᵇ butc — in order that Allāh might bring about a matter which had to be done;ᵈ that he who perished by clear argument might perish, and he who lived by clear argument might live.ᵉ And surely Allāh is Hearing, Knowing:"
    },
    {
      "verseNumber": 43,
      "verseString": "إِذْ يُرِيكَهُمُ اللَّهُ فِي مَنَامِكَ قَلِيلًا ۖ وَلَوْ أَرَاكَهُمْ كَثِيرًا لَفَشِلْتُمْ وَلَتَنَازَعْتُمْ فِي الْأَمْرِ وَلَٰكِنَّ اللَّهَ سَلَّمَ ۗ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ",
      "verseStringB": "When Allāh showed them to thee in thy dream as few — and if He had shown them to thee as many, you would certainly have become weakhearted and you would have disputed about the matter, but Allāh saved (you). Surely He is Knower of what is in the breasts."
    },
    {
      "verseNumber": 44,
      "verseString": "وَإِذْ يُرِيكُمُوهُمْ إِذِ الْتَقَيْتُمْ فِي أَعْيُنِكُمْ قَلِيلًا وَيُقَلِّلُكُمْ فِي أَعْيُنِهِمْ لِيَقْضِيَ اللَّهُ أَمْرًا كَانَ مَفْعُولًا ۗ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ",
      "verseStringB": "And when He showed them to you, when you met, as few in your eyes, and He made you to appear few in their eyes, in order that Allāh might bring about a matter which had to be done. And to Allāh are all affairs returned.ᵃ"
    },
    {
      "verseNumber": 45,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا لَقِيتُمْ فِئَةً فَاثْبُتُوا وَاذْكُرُوا اللَّهَ كَثِيرًا لَعَلَّكُمْ تُفْلِحُونَ",
      "verseStringB": "O you who believe, when you meet an army, be firm, and remember Allāh much, that you may be successful."
    },
    {
      "verseNumber": 46,
      "verseString": "وَأَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَنَازَعُوا فَتَفْشَلُوا وَتَذْهَبَ رِيحُكُمْ ۖ وَاصْبِرُوا ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
      "verseStringB": "And obey Allāh and His Messenger and dispute not one with another, lest you get weak-hearted and your power depart; and be steadfast. Surely Allāh is with the steadfast."
    },
    {
      "verseNumber": 47,
      "verseString": "وَلَا تَكُونُوا كَالَّذِينَ خَرَجُوا مِنْ دِيَارِهِمْ بَطَرًا وَرِئَاءَ النَّاسِ وَيَصُدُّونَ عَنْ سَبِيلِ اللَّهِ ۚ وَاللَّهُ بِمَا يَعْمَلُونَ مُحِيطٌ",
      "verseStringB": "And be not like those who came forth from their homes exultingly and to be seen of men, and they hinder (people) from the way of Allāh.ᵃ And Allāh encompasses what they do."
    },
    {
      "verseNumber": 48,
      "verseString": "وَإِذْ زَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ وَقَالَ لَا غَالِبَ لَكُمُ الْيَوْمَ مِنَ النَّاسِ وَإِنِّي جَارٌ لَكُمْ ۖ فَلَمَّا تَرَاءَتِ الْفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيْهِ وَقَالَ إِنِّي بَرِيءٌ مِنْكُمْ إِنِّي أَرَىٰ مَا لَا تَرَوْنَ إِنِّي أَخَافُ اللَّهَ ۚ وَاللَّهُ شَدِيدُ الْعِقَابِ",
      "verseStringB": "And when the devila made their works fair-seeming to them, and said: None among men can overcome you this day, and I am your protector. But when the two armies came in sight of one another, he turned upon his heels, and said: Surely I am clear of you, I see what you see not; surely I fear Allāh. And Allāh is Severe in requiting."
    },
    {
      "verseNumber": 49,
      "verseString": "إِذْ يَقُولُ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ غَرَّ هَٰؤُلَاءِ دِينُهُمْ ۗ وَمَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَإِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ",
      "verseStringB": "And when the hypocrites and those in whose hearts is a disease said: Their religion has deluded them. And whoever trusts in Allāh, then surely Allāh is Mighty, Wise."
    },
    {
      "verseNumber": 50,
      "verseString": "وَلَوْ تَرَىٰ إِذْ يَتَوَفَّى الَّذِينَ كَفَرُوا ۙ الْمَلَائِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ وَذُوقُوا عَذَابَ الْحَرِيقِ",
      "verseStringB": "And if thou couldst see when the angels cause to die those who disbelieve, smiting their faces and their backs, and (saying): Taste the punishment of burning."
    },
    {
      "verseNumber": 51,
      "verseString": "ذَٰلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِلْعَبِيدِ",
      "verseStringB": "This is for that which your own hands have sent on before, and because Allāh is not in the least unjust to the servants —"
    },
    {
      "verseNumber": 52,
      "verseString": "كَدَأْبِ آلِ فِرْعَوْنَ ۙ وَالَّذِينَ مِنْ قَبْلِهِمْ ۚ كَفَرُوا بِآيَاتِ اللَّهِ فَأَخَذَهُمُ اللَّهُ بِذُنُوبِهِمْ ۗ إِنَّ اللَّهَ قَوِيٌّ شَدِيدُ الْعِقَابِ",
      "verseStringB": "In the manner of the people of Pharaoh and those before them, they disbelieved in Allāh’s messages, so Allāh punished them for their sins. Surely Allāh is Strong, Severe in requiting.ᵃ"
    },
    {
      "verseNumber": 53,
      "verseString": "ذَٰلِكَ بِأَنَّ اللَّهَ لَمْ يَكُ مُغَيِّرًا نِعْمَةً أَنْعَمَهَا عَلَىٰ قَوْمٍ حَتَّىٰ يُغَيِّرُوا مَا بِأَنْفُسِهِمْ ۙ وَأَنَّ اللَّهَ سَمِيعٌ عَلِيمٌ",
      "verseStringB": "This is because Allāh never changes a favour which He has conferred upon a people until they change their own condition — and because Allāh is Hearing, Knowing —"
    },
    {
      "verseNumber": 54,
      "verseString": "كَدَأْبِ آلِ فِرْعَوْنَ ۙ وَالَّذِينَ مِنْ قَبْلِهِمْ ۚ كَذَّبُوا بِآيَاتِ رَبِّهِمْ فَأَهْلَكْنَاهُمْ بِذُنُوبِهِمْ وَأَغْرَقْنَا آلَ فِرْعَوْنَ ۚ وَكُلٌّ كَانُوا ظَالِمِينَ",
      "verseStringB": "In the manner of the people of Pharaoh, and those before them. They rejected the messages of their Lord, so We destroyed them for their sins. And We drowned Pharaoh’s people and they were all wrongdoers."
    },
    {
      "verseNumber": 55,
      "verseString": "إِنَّ شَرَّ الدَّوَابِّ عِنْدَ اللَّهِ الَّذِينَ كَفَرُوا فَهُمْ لَا يُؤْمِنُونَ",
      "verseStringB": "Surely the vilest of beasts in Allāh’s sight are those who disbelieve, then they would not believe."
    },
    {
      "verseNumber": 56,
      "verseString": "الَّذِينَ عَاهَدْتَ مِنْهُمْ ثُمَّ يَنْقُضُونَ عَهْدَهُمْ فِي كُلِّ مَرَّةٍ وَهُمْ لَا يَتَّقُونَ",
      "verseStringB": "Those with whom thou makest an agreement, then they break their agreement every time, and they keep not their duty.ᵃ"
    },
    {
      "verseNumber": 57,
      "verseString": "فَإِمَّا تَثْقَفَنَّهُمْ فِي الْحَرْبِ فَشَرِّدْ بِهِمْ مَنْ خَلْفَهُمْ لَعَلَّهُمْ يَذَّكَّرُونَ",
      "verseStringB": "So if thou overtake them in war, scatter by them those who are behind them, that they may be mindful.ᵃ"
    },
    {
      "verseNumber": 58,
      "verseString": "وَإِمَّا تَخَافَنَّ مِنْ قَوْمٍ خِيَانَةً فَانْبِذْ إِلَيْهِمْ عَلَىٰ سَوَاءٍ ۚ إِنَّ اللَّهَ لَا يُحِبُّ الْخَائِنِينَ",
      "verseStringB": "And if thou fear treachery on the part of a people, throw back to them (their treaty) on terms of equality. Surely Allāh loves not the treacher - ous.ᵃ"
    },
    {
      "verseNumber": 59,
      "verseString": "وَلَا يَحْسَبَنَّ الَّذِينَ كَفَرُوا سَبَقُوا ۚ إِنَّهُمْ لَا يُعْجِزُونَ",
      "verseStringB": "And let not those who disbelieve think that they can outstrip (Us). Surely they cannot escape."
    },
    {
      "verseNumber": 60,
      "verseString": "وَأَعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ وَمِنْ رِبَاطِ الْخَيْلِ تُرْهِبُونَ بِهِ عَدُوَّ اللَّهِ وَعَدُوَّكُمْ وَآخَرِينَ مِنْ دُونِهِمْ لَا تَعْلَمُونَهُمُ اللَّهُ يَعْلَمُهُمْ ۚ وَمَا تُنْفِقُوا مِنْ شَيْءٍ فِي سَبِيلِ اللَّهِ يُوَفَّ إِلَيْكُمْ وَأَنْتُمْ لَا تُظْلَمُونَ",
      "verseStringB": "And make ready for them whatever force you can and horses tied at the frontier, to frighten thereby the enemy of Allāh and your enemy and others besides them, whom you know not — Allāh knows them.ᵃ And whatever you spend in Allāh’s way, it will be paid back to you fully and you will not be wronged."
    },
    {
      "verseNumber": 61,
      "verseString": "وَإِنْ جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَهَا وَتَوَكَّلْ عَلَى اللَّهِ ۚ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ",
      "verseStringB": "And if they incline to peace, incline thou also to it, and trust in Allāh. Surely He is the Hearer, the Knower."
    },
    {
      "verseNumber": 62,
      "verseString": "وَإِنْ يُرِيدُوا أَنْ يَخْدَعُوكَ فَإِنَّ حَسْبَكَ اللَّهُ ۚ هُوَ الَّذِي أَيَّدَكَ بِنَصْرِهِ وَبِالْمُؤْمِنِينَ",
      "verseStringB": "And if they intend to deceive thee,ᵃ then surely Allāh is sufficient for thee. He it is Who strengthened thee with His help and with the believers,"
    },
    {
      "verseNumber": 63,
      "verseString": "وَأَلَّفَ بَيْنَ قُلُوبِهِمْ ۚ لَوْ أَنْفَقْتَ مَا فِي الْأَرْضِ جَمِيعًا مَا أَلَّفْتَ بَيْنَ قُلُوبِهِمْ وَلَٰكِنَّ اللَّهَ أَلَّفَ بَيْنَهُمْ ۚ إِنَّهُ عَزِيزٌ حَكِيمٌ",
      "verseStringB": "And He has united their hearts. If thou hadst spent all that is in the earth, thou couldst not have united their hearts, but Allāh united them. Surely He is Mighty, Wise."
    },
    {
      "verseNumber": 64,
      "verseString": "يَا أَيُّهَا النَّبِيُّ حَسْبُكَ اللَّهُ وَمَنِ اتَّبَعَكَ مِنَ الْمُؤْمِنِينَ",
      "verseStringB": "O Prophet, Allāh is sufficient for thee and those who follow thee of the believers."
    },
    {
      "verseNumber": 65,
      "verseString": "يَا أَيُّهَا النَّبِيُّ حَرِّضِ الْمُؤْمِنِينَ عَلَى الْقِتَالِ ۚ إِنْ يَكُنْ مِنْكُمْ عِشْرُونَ صَابِرُونَ يَغْلِبُوا مِائَتَيْنِ ۚ وَإِنْ يَكُنْ مِنْكُمْ مِائَةٌ يَغْلِبُوا أَلْفًا مِنَ الَّذِينَ كَفَرُوا بِأَنَّهُمْ قَوْمٌ لَا يَفْقَهُونَ",
      "verseStringB": "O Prophet, urge the believers to fight.ᵃ If there be of you twenty steadfast, they shall overcome two hundred; and if there be of you a hundred, they shall overcome a thousand of those who disbelieve, because they are a people who do not understand.ᵇ"
    },
    {
      "verseNumber": 66,
      "verseString": "الْآنَ خَفَّفَ اللَّهُ عَنْكُمْ وَعَلِمَ أَنَّ فِيكُمْ ضَعْفًا ۚ فَإِنْ يَكُنْ مِنْكُمْ مِائَةٌ صَابِرَةٌ يَغْلِبُوا مِائَتَيْنِ ۚ وَإِنْ يَكُنْ مِنْكُمْ أَلْفٌ يَغْلِبُوا أَلْفَيْنِ بِإِذْنِ اللَّهِ ۗ وَاللَّهُ مَعَ الصَّابِرِينَ",
      "verseStringB": "Now Allāh has lightened your burden and He knows that there is weakness in you. So if there be of you a hundred steadfast, they shall overcome two hundred; and if there be of you a thousand, they shall overcome two thousand by Allāh’s permission. And Allāh is with the steadfast.ᵃ"
    },
    {
      "verseNumber": 67,
      "verseString": "مَا كَانَ لِنَبِيٍّ أَنْ يَكُونَ لَهُ أَسْرَىٰ حَتَّىٰ يُثْخِنَ فِي الْأَرْضِ ۚ تُرِيدُونَ عَرَضَ الدُّنْيَا وَاللَّهُ يُرِيدُ الْآخِرَةَ ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ",
      "verseStringB": "It is not fit for a prophet to take captives unless he has fought and triumphed in the land. You desire the frail goods of this world, while Allāh desires (for you) the Hereafter. And Allāh is Mighty, Wise.ᵃ"
    },
    {
      "verseNumber": 68,
      "verseString": "لَوْلَا كِتَابٌ مِنَ اللَّهِ سَبَقَ لَمَسَّكُمْ فِيمَا أَخَذْتُمْ عَذَابٌ عَظِيمٌ",
      "verseStringB": "Were it not for an ordInᵃ nce from Allāh that had gone before,ᵃ surely there would have befallen you a great chastisement for what you were going to do.ᵇ"
    },
    {
      "verseNumber": 69,
      "verseString": "فَكُلُوا مِمَّا غَنِمْتُمْ حَلَالًا طَيِّبًا ۚ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
      "verseStringB": "Eat then of the lawful and good (things) which you have acquired in war, and keep your duty to Allāh. Surely Allāh is Forgiving, Merciful."
    },
    {
      "verseNumber": 70,
      "verseString": "يَا أَيُّهَا النَّبِيُّ قُلْ لِمَنْ فِي أَيْدِيكُمْ مِنَ الْأَسْرَىٰ إِنْ يَعْلَمِ اللَّهُ فِي قُلُوبِكُمْ خَيْرًا يُؤْتِكُمْ خَيْرًا مِمَّا أُخِذَ مِنْكُمْ وَيَغْفِرْ لَكُمْ ۗ وَاللَّهُ غَفُورٌ رَحِيمٌ",
      "verseStringB": "O Prophet, say to those of the captives who are in your hands: If Allāh knows anything good in your hearts, He will give you better than that which has been taken from you, and will forgive you. And Allāh is Forgiving, Merciful."
    },
    {
      "verseNumber": 71,
      "verseString": "وَإِنْ يُرِيدُوا خِيَانَتَكَ فَقَدْ خَانُوا اللَّهَ مِنْ قَبْلُ فَأَمْكَنَ مِنْهُمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
      "verseStringB": "And if they intend to be treacherous to thee, so indeed they have been treacherous to Allāh before, but He gave (you) mastery over them. And Allāh is Knowing, Wise."
    },
    {
      "verseNumber": 72,
      "verseString": "إِنَّ الَّذِينَ آمَنُوا وَهَاجَرُوا وَجَاهَدُوا بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ فِي سَبِيلِ اللَّهِ وَالَّذِينَ آوَوْا وَنَصَرُوا أُولَٰئِكَ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ وَالَّذِينَ آمَنُوا وَلَمْ يُهَاجِرُوا مَا لَكُمْ مِنْ وَلَايَتِهِمْ مِنْ شَيْءٍ حَتَّىٰ يُهَاجِرُوا ۚ وَإِنِ اسْتَنْصَرُوكُمْ فِي الدِّينِ فَعَلَيْكُمُ النَّصْرُ إِلَّا عَلَىٰ قَوْمٍ بَيْنَكُمْ وَبَيْنَهُمْ مِيثَاقٌ ۗ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "verseStringB": "Surely those who believed and fled (their homes) and struggled hard in Allāh’s way with their wealth and their lives, and those who gave shelter and helped — these are friends one of another. And those who believed and did not flee, you are not responsible for their protection until they flee. And if they seek help from you in the matter of religion, it is your duty to help (them) except against a people between whom and you there is a treaty. And Allāh is Seer of what you do.ᵃ"
    },
    {
      "verseNumber": 73,
      "verseString": "وَالَّذِينَ كَفَرُوا بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ إِلَّا تَفْعَلُوهُ تَكُنْ فِتْنَةٌ فِي الْأَرْضِ وَفَسَادٌ كَبِيرٌ",
      "verseStringB": "And those who disbelieve are friends one of another. If you do it not, there will be persecution in the land and great mischief.ᵃ"
    },
    {
      "verseNumber": 74,
      "verseString": "وَالَّذِينَ آمَنُوا وَهَاجَرُوا وَجَاهَدُوا فِي سَبِيلِ اللَّهِ وَالَّذِينَ آوَوْا وَنَصَرُوا أُولَٰئِكَ هُمُ الْمُؤْمِنُونَ حَقًّا ۚ لَهُمْ مَغْفِرَةٌ وَرِزْقٌ كَرِيمٌ",
      "verseStringB": "And those who believed and fled and struggled hard in Allāh’s way, and those who gave shelter and helped — these are the believers truly. For them is forgiveness and an honourable provision."
    },
    {
      "verseNumber": 75,
      "verseString": "وَالَّذِينَ آمَنُوا مِنْ بَعْدُ وَهَاجَرُوا وَجَاهَدُوا مَعَكُمْ فَأُولَٰئِكَ مِنْكُمْ ۚ وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَىٰ بِبَعْضٍ فِي كِتَابِ اللَّهِ ۗ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ",
      "verseStringB": "And those who believed afterwards and fled and struggled hard along with you, they are of you. And the relatives are nearer one to another in the ordInᵃ nce of Allāh. Surely Allāh is Knower of all things.ᵃ"
    }
  ],
  "nameEnglish": "The Spoils",
  "nameTrans": "al-Anfal",
  "nameArabic": "الأنفال",
  "chapterNumber": 8,
  "nVerses": 75,
  "footnotes": [
    {
      "note": "1a. Nafl, pl. nawåfil, means an act performed voluntarily, such as supererogatoryprayers, and nafal, pl. anfål, means an addition or accession to what is due, a free orvoluntary gift; also spoils of war. There is much difference of opinion among the commentators as to what is meant by anfål here. The most generally received opinion is thatit means property acquired during the war, being in this sense synonymous withghanßmah. The orders regarding the distribution of property acquired in war, theghanßmah, are, however, contained further on in v. 41. According to R, anfål meansgain which accrues without one’s labouring for it, and on this basis some authoritiestake the word as meaning gains in war, when actually there has been no war, but theproper word for it is fai’, for which see 59:7. As all gains of war fall under the definitionof ghanßmah or fai’, I take the word anfål as carrying here its literal significance of voluntary gifts for the advancement of the cause of Islåm, such voluntary gifts being mostneeded at a time when the very life of Islåm was threatened. Indeed there is no betterjustification for a war than that it is carried on by the voluntary gifts of those whoselife is in danger. It is the only war that is really carried on by the people in selfdefence. Wars carried on by huge loans which ultimately crush a people are really warsof capitalists against the people themselves.\n\n5a. The circumstances of the battle of Badr have been misunderstood, even by someMuslims. Christian opinion on the point is summed up in Palmer’s note: “The occasionalluded to was one when Mu√ammad had made preparations for attacking an unarmedcaravan on its way from Syria to Mecca, when Ab∂ Sufyån, who was in charge of it,sent word to Mecca and obtained an escort of nearly a thousand men; many ofMu√ammad’s followers wished to attack the caravan only, but the Prophet and hisimmediate followers were for throwing themselves on the escort”.While the several incidents mentioned here are separately true, there is a misconception as to their relation to each other. It is true that a caravan was returning from Syria,and an army had marched forth from Makkah; it is also true that some of the Muslimswished that they should encounter the caravan and not face the Makkan force. Had theHoly Prophet desired to plunder the caravan, he would have done so long before Ab∂Sufyån could obtain succour from Makkah. Madßnah was situated at a distance of thirteen days’ journey from Makkah, so that if the Holy Prophet had actually an idea ofplundering the caravan when it approached Madßnah, succour could not have reachedAb∂ Sufyån in less than a month, even if he had been apprised of the Holy Prophet’sintentions and had sent for aid from Makkah. And why should the Prophet have waitedall this while and not plundered the caravan before help reached Ab∂ Sufyån?Badr, where the encounter took place, lies at a distance of three days’ journey fromMadßnah. Here, marching towards each other, the two armies met. This shows that theMakkan army had long been on its way to Madßnah, while the Muslims were as yetquite unprepared. The enemy had marched forth for ten days and the Muslims only forthree days when the two forces encountered each other, which shows clearly that theMuslims had turned out to take the defensive against an invading force. The Prophet hadnever any design of plundering the caravan, for if he had any such design he could havecarried it out long before the Makkan force had approached Madßnah, and his handswould thus have been strengthened to meet a powerful enemy. It is quite clear that theHoly Prophet only marched forth when the enemy had already travelled over threefourths of the way to Madßnah, and the caravan had left Madßnah far behind.Further, it is clearly stated here that a party of the believers were averse to fighting.They could not have been averse if they had to encounter only an unarmedcaravan. What is said in the next verse makes it clearer still, they went forth as if theywere being driven to death, because they knew that they were going to meet an enemynot only treble in numbers, but also much more powerful and efficient.\n\n7a. The two parties referred to were the unarmed caravan of the Quraish going toMakkah and the armed force of the Quraish that was on its way to Madßnah. Naturally,some of the Muslims desired that their encounter should take place with the unarmedQuraish caravan, which was now a long way from Madßnah, and not with the powerfularmy which was advancing against Madßnah.\n\n7b. By His words is meant here the fulfilment of His words, because the Prophet haddeclared at Makkah, long before the fight actually took place, that an encounter wouldtake place between the Muslims and the Quraish, in which the former would be victorious. These prophecies had hitherto been laughed at by the Makkans, because they couldnever imagine that their power could be broken by such an insignificant community. Ofthe many prophecies which will be noted in their proper place, I may refer here to onewhich the Holy Prophet himself repeated aloud in the field. I‘Ab says that the HolyProphet prayed on the day of Badr, saying: “O Allåh, I beseech Thee to fulfil Thypromise and Thy compact! O Allåh, if Thou pleasest (to destroy this community), Thouwilt not be worshipped (on earth)!” Then the Holy Prophet came forth and he cried:“Soon shall the hosts be routed and they will show their backs” (B. 56:89). Now theseconcluding words occur in 54:45, which is one of the earliest Makkan revelations, andthe incident shows that the importance of the battle of Badr lay in the many prophecieswhich by their fulfilment bore witness to the truth of the Holy Prophet.\n\n10a.  Compare 3:124, where the coming down of angels in the battle of U√ud ismentioned. Also see 3:124a, which explains the object of the coming of the angels. It isnowhere stated in the Holy Qur’ån that the angels actually fought, but here, as in 3:126,we are told that the angels were sent down to bear good news of victory and to ease thehearts of the Muslims. Here, however, we are further told (v. 11) that, as a result of thecoming of the angels, calm fell upon the Muslims, their hearts being strengthened andtheir footsteps being steadied, and (v. 12) that while the believers were thus made firm,terror was cast into the hearts of the disbelievers. Hence it is that the number of angelscorresponds with the strength of the enemy force in each case, their number being onethousand at Badr, where the enemy had a like force. For the other two occasions, see3:124a.\n\n11a. Compare 25:25, which is a prophecy about the events of this remarkable battle:“And on the day when the heaven bursts asunder with clouds, and the angels are sentdown, as they are sent”. The rainfall brought many advantages to the Muslims, forwhich see next footnote.\n\n11b. Before the rain fell the Muslim position was very weak. The enemy had thecommand of the water and the Muslims were in a low and sandy place. Therefore therewere some who had misgivings, which, as is said here, were due to the devil’s uncleanness. The enemy having taken possession of the drinking-water, the Muslims fearedbeing troubled by thirst, which is called the devil of the desert. The rain strengthened theposition of the Muslims and consequently comforted their hearts. This was a purification, for after the rainfall they all became certain of Divine help and so of their triumphover the enemy.\n\n12a. The last sentence is apparently addressed to the fighting believers. Smitingabove the necks is either the same as smiting the necks, or it signifies the striking of theheads, because what is above the neck is the head. And the striking of the finger-tipsindicates the striking of the hands which held weapons to kill the Muslims. The twophrases respectively signify the killing of the enemy and disabling him so as to renderhim unfit for taking further part in fighting.\n\n14a. That is, taste this torment in this life as an indication of the chastisement ofFire in the next life.\n\n15a. Za√afa originally means he walked or marched little by little, and applies to thecrawling along of a child when unable to walk. Then za√f came to mean an army or military force marching little by little towards the enemy, or heavily by reason of their multitude and force (LL). Thus it became synonymous with war, as in a √adßth quoted by T,farra min al-za√f, which means he fled from war (LL).\n\n17a. Ramå carries a number of significances, throwing, flinging, casting, assailing,smiting, shooting, going forth, etc. (LL). It is used in connection with fighting, andtherefore I adopt smiting as its equivalent, which, like its original, makes the meaningclear without seeking an understood object. The first part of the verse refers to theMuslims generally — So you slew them not, but Allåh slew them, the address being inthe plural; and the second part, being in the singular, is understood as referring to theHoly Prophet. Otherwise there is no difference between the two passages. The Muslimsslew the enemy, but it is affirmed that really they did not slay, but it was Allåh Whoslew them; the meaning apparently being that Allåh’s hand was working in the battle,which is also clear from the fact that three hundred, mostly raw, young men, equippedwith neither horses nor arms, prevailed against a thousand of the most renowned warriors. The same meaning must be attached to the other passage relating to the smiting ofthe enemy. Whether the Prophet actually threw a handful of pebbles at the enemy, whichdiscomfited the latter, is a different question. It is sufficient to learn that a powerfulenemy was discomfited by about a third of its number, while from the point of view ofefficiency and equipment even ten men from among the Muslims were not equal to oneof the enemy. It was Allåh’s hand that slew them, and it was His hand that smote themand ultimately put them to rout. That the Prophet actually threw a handful of dust at theenemy is in no way inconsistent with this explanation.\n\n17b. Iblå’, though ordinarily meaning trying, and proving, like balå’ and ibtilå’ (twoother verbs from the same root), means here, by the unanimous opinion of all commentators, the conferring of a favour (Rz). The lexicons also give it the same significance. ThusLL explains the words ablå-hu balå’-an √asan-an as meaning, God did to him a gooddeed or conferred a benefit on him. The good gift or the benefit spoken of here is a victorywhich strengthened the foundations of Islåm, and dealt a death-blow to the evil designs ofthose who were determined to exterminate it, as is plainly stated in the next verse.\n\n18a. This here stands for, this was the Divine purpose in bringing about thisencounter.\n\n19a. It is related that when the Quraish left Makkah to attack the Muslims, they heldon to the curtains of the Ka‘bah and prayed thus: “O Allåh, assist the best of the twoforces and the most rightly directed of the two parties and the most honoured of the twogroups and the most excellent of the two religions”. Others say that Ab∂ Jahl prayed inthe field of battle, saying: “O Allåh, whoever of us is the greater cutter of the ties of relationship and more wicked, destroy him tomorrow morning” (Rz). Palmer’s remark inthis connection, that the Quraish prayed in the above words “when they were threatenedwith an attack from Mu√ammad”, is a travesty of the facts. Indeed, it is utterly absurd tospeak of Mu√ammad threatening the Quraish, when the Muslims did not constitute evena thousandth part of the whole population of Arabia, and their military strength wasalmost negligible as compared with the Quraish.\n\n22a. Dåbbah means literally anything that walks (or creeps or crawls) upon theearth (LL); hence any animal, or a beast, or any living thing. Note that the deaf and thedumb signify those who are spiritually deaf and dumb — those who do not understand.\n\n24a. Faith or submission to Allåh is life, and disbelief is death. By the expressionthat which gives you life some understand the Qur’ån, others take it to mean jihåd, orexertion in the cause of truth. Evidently it is faith.\n\n24b. By heart is meant the desires of the heart. The Divine intervention is thecutting off of those desires. The faithful are enjoined to be quick in responding to thecall of the Prophet, and not to indulge in worldly desires, for these may soon be cutoff. Or, the meaning is that they must respond to the call of the Prophet lest, havingdeprived themselves of one occasion of doing good, the heart should be hardened, and,as a punishment for the first rejection, Allåh may so turn it that it may not turn to goodat all.\n\n25a. The reference is not to one particular incident, but generally to all afflictionsthat are of such a widespread nature as to overtake even others, in addition to those forwhom they are primarily intended.\n\n26a. There was a time when the Muslims were so weak that they could be carriedoff by force. Such was their condition at Makkah. In Madßnah they were undoubtedlysecurer, and the enemy had to collect a force to crush them. Or, the help referred to hereis the Divine help which the Muslims received in the battle of Badr.\n\n30a. The reference is to the final plans of the Quraish when, the companions havingemigrated to Madßnah, the Prophet was left alone at Makkah. Various plans were suggested at a great meeting of the Quraish chiefs in their town hall; the plan ultimatelyadopted was that the Prophet should be slain, a number of youths belonging to differenttribes thrusting their swords into his body at one and the same time, so that one man ortribe should not have the charge laid against him or it. It was with this object that theProphet’s house was surrounded, but he got away unnoticed (IH). The Divine plan wasthat the disbelievers should see the downfall of their power at the hands of the Prophet.\n\n31a. That this was an empty boast is confirmed by the fact that, although the HolyQur’ån repeatedly challenged them to produce anything like it, they could not produceeven the like of its shortest chapter.\n\n33a. The punishment was to overtake them when the Holy Prophet was no moreamong them, i.e. after his flight from Makkah. But even then the punishment might beaverted, if they asked for forgiveness.\n\n34a. The disbelievers are here declared not to be the true guardians of the SacredMosque, because while that Mosque was an emblem of the Unity of the Divine Being,its name having been clearly associated with monotheism since the time of Abraham,the disbelievers who now posed as its guardians were idolaters. So they are told thatthey are unfit to hold its guardianship, which would henceforth be made over to a peoplewho keep their duty, i.e. the Muslims. The words contain a prophecy not only as to thedeprivation of the disbelieving Quraish of the guardianship of the Ka‘bah, but also as tothe passing of the guardianship into the hands of the Muslims.\n\n35a. In fact the House was not used by them for offering prayers to God but for sacrilegious talk and gossiping.\n\n38a. Desisting and returning both relate to fighting against the Muslims, not to unbelief, because the unbelievers could not be said to return to disbelief. They had goneaway from Badr quite discomfited, and they were told that, if they desisted from fighting, they would be forgiven.\n\n38b. The meaning is that they could read their own doom in the doom of those withwhom Allåh had dealt previously in similar circumstances. Compare 18:55, which statesthat the disbelievers only wait “for the way of the ancients to overtake them.”\n\n39a. That is, if they desist from fighting and put an end to their mischief, God’sdecree of punishment will not be executed. God sees what men do, and if they mendtheir ways, He will not punish them. The state of religious liberty which Islåm aimed atis put tersely in the two opening statements — there is no more persecution and all religions are for Allåh.\n\n40a. If they return to fight, then Allåh will protect the Muslim community, helpingthem against their enemy, as He is their Patron and Helper.\n\n41a. LL explains ghanama as meaning he acquired a thing without difficulty. Hencethe original meaning of the word ghanßmah is simply acquisition or achievement, andthe word is then applied to what is acquired in war after fighting with the enemy andvanquishing him, and is a technical term for such property.Regarding the one-fifth spoken of here, the most generally accepted opinion is that itis to be divided again into five parts, the Prophet, the near of kin, the orphans, the poor,and the wayfarer being equal sharers. The near of kin included all individuals belongingto the tribes of Banß Håshim and Banß ‘Abd al-MuΔΔalib, to whom zakåt money was notallowed. The poor among them were thus paid from this source of income. As to theProphet’s twenty-fifth, it appears that it was also used for the benefit of the Muslims. Thewords of one of his sayings are: wa-l-khumsu mard∂d-un f ß-kum, i.e. the fifth (too) isgiven back to you. That the Prophet led a life of the utmost simplicity is admitted on allhands. The remaining four-fifths of the ghanßmah were divided among those who tookpart in the battle, as they were not otherwise paid for their services, but there is no orderto this effect in the Qur’ån itself. It may be further noted that this arrangement was simplyan exigency. The war was forced on the Muslims all of a sudden when the State had notyet been formed in the proper sense of the word; there was no army at all, nor a treasuryfrom which to pay it; and just as they were required to carry it on on the basis of voluntary gifts, so they were allowed a share in the war acquisitions. If the State pays its soldiers as it pays its civil servants, the war acquisitions would all go to the State treasury,just as income from zakåt or tribute went to the State treasury. It is nowhere laid downthat the Muslim State shall not maintain a regular army.The day of Discrimination referred to here is the battle of Badr. It is so calledbecause prophecies of an encounter between the Muslims and their enemies and of thevanquishment of the enemy are met with in very early revelations. See also 3:13a.\n\n42a. The position of the three parties, i.e. the party of the Muslims and two partiesof the Quraish, is here made clear. The Muslims were on the nearer side, i.e. the sidenearer to Madßnah, the main army of the Quraish was on the further side, i.e. the sidewhich was farther from Madßnah, while the caravan was in a lower place, i.e. towardsthe sea-coast, and farther away from Madßnah, on its way to Makkah.\n\n42b. The Muslims were so weak that they could not think of making an appointmentwith the enemy — they would have broken away from the appointment.\n\n42c. There is an ellipsis here, the meaning being, but an encounter was broughtabout without an appointment.\n\n42d. The matter had to be done, i.e., Allåh had decided to do it. Maf‘∂l means literally a thing already done, the use of the past tense when the occurrence is certain beingfrequent in Arabic. The matter referred to is the vanquishment of the opponents ofIslåm.dev&s42e. The disbelievers had seen clear arguments of the Prophet’s truth, yet theyrejected him and had thus perished in a spiritual sense; they were now vanquished in thebattle and thus perished temporally. Or, the meaning is that those who would perishmight perish by clear argument and those who would live might live by clear argument,the battle itself being the clear argument referred to here.\n\n44a. In the previous verse it is stated that the enemy were shown to the Prophet in adream to be few, and here we are told that they were also shown to be few to theMuslims when the two armies met. The second point has been fully explained in 3:13a.As regards the Prophet’s seeing them few in a vision, it must no doubt be interpreted assignifying their actual weakness, notwithstanding their great number.\n\n47a. The reference is clearly to the army of the Quraish, which had marched forth ingreat exultation to destroy Madßnah.\n\n48a. The person referred to here is said to have been Suråqah ibn Målik, who was ofthe tribe of Banß Bakr, a branch of Banß Kanånah. When setting out to attack Madßnah,the Quraish had a fear that the Banß Kanånah, who were their inveterate enemies, mightattack Makkah in their absence. Suråqah gave them promise of help. It may be, however,that what is stated here is only the devil’s suggestion to the Quraish leaders.\n\n52a. The mention of the people of Pharaoh here serves to show the Prophet’s likeness to Moses and foretells the absolute discomfiture of the enemy ultimately.\n\n56a. It shows how the opponents of Islåm disregarded their responsibility and violated their agreements. The use of the words every time with regard to these violationsshows clearly that the Muslims never hesitated in making a new agreement when onewas violated, but the disbelievers did not even then respect their agreements; hence, as alast resort, the Muslims were allowed to repudiate unrespected agreements (v. 58).\n\n57a. That is, an exemplary punishment should be inflicted on them, so that a stopmight be put to further fighting and bloodshed.\n\n58a.  If the other party does not remain faithful to the agreement of peace, theMuslims may also repudiate it. The use of the word fear does not indicate that a mereapprehension, unattended with any action on the part of the other party, is sufficient forrepudiation. Read it along with v. 62, and the meaning is clear.\n\n60a. Force (Ar. quwwah) means all those things which are a source of strength,including all kinds of implements of war and other defensive and offensive operations.The Muslims had won a victory at Badr, though they were not even well-equipped andhad made no preparation for the war. But they are told that they must in future keepthemselves well prepared and avail themselves of all sources of strength, so that theenemy should by their very preparedness assume a peaceful attitude. It was evident thatthe weakness of the Muslims was a temptation for their opponents to attack them.\n\n62a. The deceit is in relation to what has been said in the previous verse, the meaning being that if they intend to deceive thee under cloak of peace, even in such a casepeace is to be accepted.\n\n65a. It should be noted that the war to which the Muslims were to be urged was thedefensive war which the Muslims had to fight to save themselves and to protect the religion of Islåm. The sword had been taken up against them; see 2:190, 2:217, 22:39, etc.\n\n65b. The Muslims were very few as compared with their enemies, and there was noteven one Muslim to ten disbelievers. Thus there is a clear prophecy here that, notwithstanding their fewer numbers, the Muslims shall be victorious. After the battle of Badrcame the battle of U√ud, in which the Muslims were less than 1 to 4 against the enemy;this was followed by the battle of the A√zåb, in which they were 1 to 10, yet the enemywas routed.\n\n66a. This verse is supposed by some to abrogate the previous verse, where it is statedthat twenty patient Muslims shall overcome two hundred disbelievers. This is not a correct view. Firstly, because only an injunction could be said to be abrogated, and not astatement. Secondly, because the two statements relate to two different states of theMuslims. At the time of the battle of Badr there was no Muslim army in existence. Everyman available, young or old, sick or healthy, had to fight to save the life of the community.They had very few arms, and they had never been trained. This is referred to in thewords; He knows that there is weakness in you. So the Muslim forces as then constitutedcould at most be a match for double their numbers. But a time did come when they werea match for ten times their numbers. So both the statements in the Qur’ån provedtrue. But even if the words may be taken as an injunction to the Muslims to overcometwice and afterwards ten times their numbers, there is no question of abrogation. Thereare two commandments, one in accordance with the circumstances of the Muslim societyas it was then, another in accordance with a future state when they would be well-armed.\n\n67a. There exists some misunderstanding as to the meaning of yuthkhina used here.Thakhuna means he or it became thick, and athkhana means ghalaba, he overcame(LA). The same word is again used in the Holy Qur’ån exactly in the same sense: “then,when you have overcome them, make them prisoners” (47:4).On the authority of certain reports, the commentators are of opinion that this verseand the next refer to releasing the prisoners of war taken at Badr after taking ransom fromthem, which act, it is said, is here disapproved. But various considerations show thatthese verses refer to some other incidents. Firstly, the condition laid down here for takingprisoners is that the Prophet should fight against the enemy, and that had actually beendone at Badr. Secondly, the taking of prisoners and their release on this very occasion isjustified in clear words only two verses further on, “O Prophet, say to those of the captives who are in your hands: If Allåh knows anything good in your hearts, He will giveyou better than that which has been taken from you” (v. 70). This shows that these verseswere revealed when the prisoners were still in the hands of the Muslims and that whichhas been taken is clearly the ransom, which must have taken many days to reachMadßnah. If the verse had conveyed a Divine commandment to slay the prisoners and notto release them, that step could still have been taken. But the very fact that no such stepwas taken shows clearly that the verse conveyed no such Divine commandment.The legality of the Holy Prophet’s procedure on this occasion is clearly borne out byan earlier revelation: “So when you meet in battle those who disbelieve, smite the necks;then, when you have overcome them, make them prisoners, and afterwards set them freeas a favour or for ransom” (47:4). The Prophet never slew a single prisoner of war, evenafter the battle of Badr, though thousands of prisoners were taken in some of these battles. On the other hand, the prisoners were almost always set free as a favour, and ransom was taken only from the Badr prisoners.The question is, what is then hinted at in this verse and in the one that follows? Tome it seems quite clear that the reference is to the desire (mark the word desire used inthe verse) — not to an action already completed — of a party of the Muslims referred toin v. 7, and you loved that the one not armed should be yours. Some Muslims desired toattack and capture the unarmed caravan, but depredations like these, though committedby disbelievers upon the Muslims, were not fit for a prophet. He must fight a hard fightin his defence first and then, if he overcomes the enemy, he may take prisoners. Thusthis injunction also declares slavery to be illegal, and allows only the retaining of thosewho are taken prisoners in war. The frail goods of this world appropriately refer to thecaravan and its merchandise, while the addition of the concluding words in v. 69, eatthen of the lawful and good things which you have acquired in war, shows that the ransom received on account of the prisoners is among the lawful and good things.\n\n68a. That ordinance from Allåh is referred to in several places in this chapter; it wasto bring about an encounter with the main army of the Quraish at Badr: “And whenAllåh promised you one of the two parties that it should be yours ... and Allåh desired toestablish the Truth” (v. 7); and again: “In order that Allåh might bring about a matterwhich had to be done” (v. 42).\n\n68b. You say akhadha f ß kadhå meaning he took to a thing, or set about or commenced doing it (LL).\n\n72a. The friendship alluded to in this verse has been a matter of much discussionamong the commentators. The meaning seems to be clear. Those who believed, and,having been persecuted, fled from their homes, formed a community at Madßnah alongwith those who gave them shelter and helped them, i.e., the An©år. But there were thosewho chose to remain in their homes. The Muslim community at Madßnah could notundertake to guard the interests of such persons, and this is what is meant by saying, youare not responsible for their protection. But if they seek help in the matter of religion, itis incumbent on the Muslim community to give them help, unless there exists a treaty ofalliance with the people against whom such help is sought.\n\n73a. If you do not help your brethren in the matter of religion, the disbelievers willbecome more daring in their persecutions and in causing mischief and disorder in theland.\n\n75a. When even strangers who have accepted Islåm and fled from their homesbecome “of you”, those who have in addition ties of relationship, possess every title tohave their interests guarded by the Muslim community."
    }
  ]
}
