{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "وَالضُّحَىٰ",
      "verseStringB": "By the brightness of the day!"
    },
    {
      "verseNumber": 2,
      "verseString": "وَاللَّيْلِ إِذَا سَجَىٰ",
      "verseStringB": "And the night when it is still! —"
    },
    {
      "verseNumber": 3,
      "verseString": "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ",
      "verseStringB": "Thy Lord has not forsaken thee, nor is He displeased.ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "وَلَلْآخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَىٰ",
      "verseStringB": "And surely the latter state is better for thee than the former."
    },
    {
      "verseNumber": 5,
      "verseString": "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ",
      "verseStringB": "And soon will thy Lord give thee so that thou wilt be well pleased.ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "أَلَمْ يَجِدْكَ يَتِيمًا فَآوَىٰ",
      "verseStringB": "Did He not find thee an orphanᵃ and give (thee) shelter?"
    },
    {
      "verseNumber": 7,
      "verseString": "وَوَجَدَكَ ضَالًّا فَهَدَىٰ",
      "verseStringB": "And find thee groping, so He showed the way?ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "وَوَجَدَكَ عَائِلًا فَأَغْنَىٰ",
      "verseStringB": "And find thee in want, so He enriched thee?ᵃ"
    },
    {
      "verseNumber": 9,
      "verseString": "فَأَمَّا الْيَتِيمَ فَلَا تَقْهَرْ",
      "verseStringB": "Therefore the orphan, oppress not.ᵃ"
    },
    {
      "verseNumber": 10,
      "verseString": "وَأَمَّا السَّائِلَ فَلَا تَنْهَرْ",
      "verseStringB": "And him who asks, chide not.ᵃ"
    },
    {
      "verseNumber": 11,
      "verseString": "وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ",
      "verseStringB": "And the favour of thy Lord, proclaim.ᵃ"
    }
  ],
  "nameEnglish": "Morning Brighness",
  "nameTrans": "adh-Duha",
  "nameArabic": "الضـحى",
  "chapterNumber": 93,
  "nVerses": 11,
  "footnotes": [
    {
      "note": "3a. The commentators narrate varying reports to the effect that the verse was revealed on the occasion of a long pause in the coming of revelation to the Holy Prophet. According to Buk̲h̲ārī, it was only a pause of two or three days (B. 65:93, 2). That revelation was sent down to the Holy Prophet at intervals is a fact, and a pause of two or three days could not have given rise to such allegations. The words may be taken as words of solace in general sense, the significance being that God would never forsake him. But in the light of what follows, the words are prophetical, the indication being that in its later history Islām would have to face set-backs which might give rise to such doubts. The Prophet and his followers are therefore given an assurance that God will never forsake the cause of Islām. Force is lent to this interpretation by the fact that here it is not the night that is followed by the brightness of the day, which was the case at the appearance of the Prophet, but the brightness of the day is followed by the stillness ofthe night, which seems to be a reference to the inactivity of the Muslim people after the sun had shone, i.e., after the Prophet had made his appearance. The next verse makes it clearer.\n\n5a. Ibn ‘Aṭiyyah and others commenting on v. 4 say that by āk̲h̲irah is here meant the latter state of the Prophet’s cause and by the ūlā, the beginning of it (RM). The lexicologists also explain the word āk̲h̲ir as the last, hindmost, or what is after the first or former. And āk̲h̲ira marratain is explained as meaning the latter of the two times (LL).The words may therefore mean that as time passes, the Prophet’s cause would go on gaining strength, and the latter state would always be better for him than the former. Such indeed is Truth that, although it may gain ground inch by inch after severe struggle with falsehood, it does continue to advance. Or, the reference here is to the second rising of Islām, nas̲h̲‘at t̲h̲āniyah, after what is called the stillness of the night in the 2nd verse,a long pause of inactivity of the Muslims. References to a set-back to the cause of Islām for a long period are very frequent in the Holy Qur’ān; see 32:5a. As a matter of fact, it is true that not withstanding various set-backs at different periods of its history, the cause of Islām has gone on gaining ground. When the existing Muslim civilization was destroyed by the Mongols, a greater Muslim nation rose up by their joining the ranks of Islām; and when Islām was extirpated in Spain in the West, it gained ground in the Far East in Indonesia, winning over fifty million people. There is clear and repeated mention of its final triumph in the whole world, 9:33; 48:28; and 61:9; see 9:33a. Perhaps it is to this that v. 5 refers — thy Lord will give thee so that thou wilt be well pleased.\n\n6a. ‘Abd Allāh, the Holy Prophet’s father, died about three months before the Prophet was born; his mother, Āminah, died when he was six years old. His grandfather,‘Abd al-Muṭṭalib, who took care of him after his mother, died two years later, and from that time he remained in charge of Abū Ôālib, his uncle, who was alive when the Holy Prophet received the Divine message for the regeneration of mankind.\n\n7a. That erring is not the significance of ḍāll (“groping”) here is shown conclusively by 53:2, which says: “Your companion errs not”. Vv. 6, 7, 8 stand in close relation respectively to vv. 9, 10 and 11; v. 6 tells the Prophet that he was himself an orphan, andthe conclusion that he should therefore not oppress the orphan is drawn in v. 9; similarly, v. 8 speaks of the Divine favour to him in making him free from want, and the conclusion is drawn in v. 11 that he should therefore proclaim the Divine favour to him.Thus it is clear that v. 6 stands in close relation to v. 9; and v. 8 to v. 11, and the conclusion is evident that v. 7 stands in close relation to v. 10. Now, v. 10 plainly speaks of one who asks to be guided to the Truth, or a petitioner generally who needs the help of another, being unable himself to do a thing or undertake a task; see 10a. The Holy Prophet was no doubt a sā’il (one who asks) in this sense. He did not worship idols, but neither could he, without the help of Allāh, find out the way for the regeneration of his people, for which his soul yearned so eagerly. Hence he was unable to see the way by himself, and the word ḍāll signifies one who is perplexed and unable to see the way for himself, from ḍalla, he was perplexed and unable to see his right course (LL). The true significance of the word is thus that Allāh found the Prophet in quest of the way, but unable to find the way himself. Therefore He guided him by Divine light. In this manner was the Prophet told not to chide any petitioner, but to render help to him as Allāh had helped him. Or ḍāll signifies one who becomes lost (T, LL) in the pursuit of some object, as Jacob’s sons speak of their father as being in ḍalāl (R), i.e., lost in the love of Joseph (12:95), and thus the meaning may be that the Holy Prophet had so devoted himself to the quest of the right way for the world that he had lost himself in that quest; see introductory note, chapter 94.\n\n8a. Finding the Holy Prophet in want, and enriching him, do not refer to his temporal or pecuniary circumstances only, if they refer to them at all, but rather to his spiritual needs and the spiritual wealth with which he was enriched.\n\n9a. Not taking care of the orphans is really their oppression. In one of the many of his sayings the Prophet says: He who takes care of the orphan and I are like these two(showing his two fingers close to each other) (B. 70:24).\n\n10a. The word sā’il occurring in this verse is interpreted generally as meaning a beggar. But petitioner, or one who asks, is a much better rendering, for it retains the breadth of the original. Ḥasan interpreted the word as meaning he who asks about knowledge, and this interpretation is corroborated by what is related in the opening verses of ch. 80. It is, moreover, in consonance with the chief object of a prophet’s mission, which aims at spreading true knowledge.\n\n11a. The ni‘mat, or the favour, is no other than revelation, the greatest of all Divine favours, as it is recognized to be throughout the Holy Qur’ān. This was the favour which the Holy Prophet continued to announce throughout his life. Mujāhid says: The favour referred to here is the Qur’ān (Rz). "
    }
  ]
}
