{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ",
      "verseStringB": "Have We not expanded for thee thy breast,ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "وَوَضَعْنَا عَنْكَ وِزْرَكَ",
      "verseStringB": "And removed from thee thy burden,"
    },
    {
      "verseNumber": 3,
      "verseString": "الَّذِي أَنْقَضَ ظَهْرَكَ",
      "verseStringB": "Which weighed down thy back,ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "وَرَفَعْنَا لَكَ ذِكْرَكَ",
      "verseStringB": "And exalted for thee thy mention?ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا",
      "verseStringB": "Surely with difficulty is ease,"
    },
    {
      "verseNumber": 6,
      "verseString": "إِنَّ مَعَ الْعُسْرِ يُسْرًا",
      "verseStringB": "With difficulty is surely ease.ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "فَإِذَا فَرَغْتَ فَانْصَبْ",
      "verseStringB": "So when thou art free (from anxiety), work hard,ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "وَإِلَىٰ رَبِّكَ فَارْغَبْ",
      "verseStringB": "And make thy Lord thy exclusive object."
    }
  ],
  "nameEnglish": "The Soothing",
  "nameTrans": "ash-Sharh",
  "nameArabic": "الـشرح",
  "chapterNumber": 94,
  "nVerses": 8,
  "footnotes": [
    {
      "note": "1a. The expanding of the breast is also mentioned in Moses’ prayer in 20:25: “My Lord, expand my breast for me”. The same words occur also in 6:125: “So whomsoever Allāh intends to guide, He expands his breast for Islām”. As opposed to this, it is added:“And whomsoever He intends to leave in error, He makes his breast strait and narrow”. There is a report according to which Gabriel opened the breast of the Holy Prophet while he was yet a boy in charge of his nurse, and washed his heart; the authenticity of this hasbeen questioned on critical grounds (Rz). But even that criticism is due to a misconception, for the same incident is related to have taken place again, when the Holy Prophet was entrusted with his Divine mission. The incident was therefore evidently a kashf, or aclear vision. AH says: “The expanding of the breast signifies its illumination with wisdom and its vastness for the reception of what was to be revealed to him”. Rāghib gives a similar explanation, viz., its expansion with Divine light and tranquillity. The expansion of the breast stands, in one word, for the greatness of the heart of the Prophet.\n\n3a. The burden which weighed down his back signifies anxiety for raising humanity from the ignorance and superstition in which it was involved. Compare 26:3: “Perhaps thou wilt kill thy self with grief because they believe not”. The removal of the burden signifies giving relief from anxiety.\n\n4a. This is a clear prophecy of the glorious eminence to which the Holy Prophet was to be raised, uttered at a time when he was alone and unknown.\n\n6a. In consonance with what it said in v. 4, the ease refers to the ultimate triumph, and the difficulty to the trials which the Prophet was then undergoing. But the passage as well reveals a general law of nature that difficulty is followed by ease. The statement is repeated, showing that Islām would twice be in great difficulties and face hard trials, and that on both occasions it would come out with ultimate triumph. There are clear indications in the Holy Qur’ān and in the sayings of the Holy Prophet of the trials and difficulties of Islām in the latter days, as great as those at the time of its birth, and of its ultimate triumph on both occasions.\n\n7a. The Prophet’s being free signifies his freedom from anxiety, in reference to what is said in the previous verse. Being now free from all anxiety, he was to work hard for the regeneration of a fallen humanity, and make his Lord his exclusive object, i.e., apply himself wholly to establish the greatness of God."
    }
  ]
}
