{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "وَالتِّينِ وَالزَّيْتُونِ",
      "verseStringB": "Have We not expanded for thee thy breast,ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "وَطُورِ سِينِينَ",
      "verseStringB": "And removed from thee thy burden,"
    },
    {
      "verseNumber": 3,
      "verseString": "وَهَٰذَا الْبَلَدِ الْأَمِينِ",
      "verseStringB": "Which weighed down thy back,ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "لَقَدْ خَلَقْنَا الْإِنْسَانَ فِي أَحْسَنِ تَقْوِيمٍ",
      "verseStringB": "And exalted for thee thy mention?ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "ثُمَّ رَدَدْنَاهُ أَسْفَلَ سَافِلِينَ",
      "verseStringB": "Surely with difficulty is ease,"
    },
    {
      "verseNumber": 6,
      "verseString": "إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَلَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ",
      "verseStringB": "With difficulty is surely ease.ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "فَمَا يُكَذِّبُكَ بَعْدُ بِالدِّينِ",
      "verseStringB": "So when thou art free (from anxiety), work hard,ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "أَلَيْسَ اللَّهُ بِأَحْكَمِ الْحَاكِمِينَ",
      "verseStringB": "And make thy Lord thy exclusive object"
    }
  ],
  "nameEnglish": "The Fig",
  "nameTrans": "at-Tin",
  "nameArabic": "الـتين",
  "chapterNumber": 95,
  "nVerses": 8,
  "footnotes": [
    { 
	  "note": "3a. The fig and the olive stand respectively for the law given on Mount Sinai and that revealed in the sacred city of Makkah; and the two verses that follow make this clear. It must be remembered that a comparison between Moses and the Holy Prophet Muḥammad is introduced in very early revelations, as here and in 52:1– 6 and 73:15.The fig stands for the Jewish dispensation, and this is the significance underlying the cursing of the fig-tree by Jesus. It is said that coming from Bethany early in the morning and finding himself to be hungry, Jesus drew near to a fig-tree so that he might gather some figs; and seeing nothing but leaves upon it, he cursed the tree, and immediately it withered to the root (Matt. 21:19). This action of Jesus evidently signified the rejection of the Jews, who resembled the fig-tree, which had only leaves but no fruit, and even the leaves, representing as they did their outward actions of piety, should now wither away. The rejection of the Jews is still more plainly referred to in the parable of the garden(Matt. 21:33), which ends with the significant words: “The kingdom of God shall be taken from you, and given to a nation bringing forth the fruits thereof” (Matt. 21:43). It may be added that the Prophet Jeremiah also compares the Jewish nation to two baskets of figs, the good figs standing for the righteous from among the Jews and the vile figs forthe wicked ones (Jer. ch. 24).As regards the olive, some Bible references no doubt hint at that also as being a symbol of the Jewish nation, but the Holy Qur’ān compares it here with the law of the Holy Prophet Muḥammad. This is explained and clarified by a later revelation: “A likeness of His light is as a pillar on which is a lamp, the lamp is in a glass, (and) the glass is as it were a brightly shining star, lit from a blessed olive tree, neither eastern nor western” (24:35).The comparison shows that, whereas the law given on Mount Sinai passed away like the fig-tree in Jesus’ parable, the new light, lit from the blessed olive-tree, was never to be extinguished, because it belonged neither to the East nor to the West, but was meant for all men in all ages, and was in fact destined to unite the East and the West.\n\n6a. By man’s being created in the best make is meant his enormous capability for advancement. When he does not take advantage of the opportunity offered to him, he is reduced to the lowest of the low. With unthought of advancement in science, men are even today flying at each other’s throats like the beasts of the jungle, because they are not guided by Divine revelation.\n\n8a. Both this verse and the one preceding it refer to the Divine judgment awaiting the rejectors of Truth. The Judgment is as well a judgment of the guilty in this life as in the next."
	} 
  ]
}
