{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ",
      "verseStringB": "Read in the name of thy Lord Who createsᵃ—"
    },
    {
      "verseNumber": 2,
      "verseString": "خَلَقَ الْإِنْسَانَ مِنْ عَلَقٍ",
      "verseStringB": "Creates man from a clot,ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "اقْرَأْ وَرَبُّكَ الْأَكْرَمُ",
      "verseStringB": "Read and thy Lord is most Generous,ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "الَّذِي عَلَّمَ بِالْقَلَمِ",
      "verseStringB": "Who taught by the pen,ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ",
      "verseStringB": "Taught man what he knew not."
    },
    {
      "verseNumber": 6,
      "verseString": "كَلَّا إِنَّ الْإِنْسَانَ لَيَطْغَىٰ",
      "verseStringB": "Nay, man is surely inordinate,"
    },
    {
      "verseNumber": 7,
      "verseString": "أَنْ رَآهُ اسْتَغْنَىٰ",
      "verseStringB": "Because he looks upon himself as self-sufficient.ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "إِنَّ إِلَىٰ رَبِّكَ الرُّجْعَىٰ",
      "verseStringB": "Surely to thy Lord is the return."
    },
    {
      "verseNumber": 9,
      "verseString": "أَرَأَيْتَ الَّذِي يَنْهَىٰ",
      "verseStringB": "Hast thou seen him who forbids"
    },
    {
      "verseNumber": 10,
      "verseString": "عَبْدًا إِذَا صَلَّىٰ",
      "verseStringB": "A servant when he prays?ᵃ"
    },
    {
      "verseNumber": 11,
      "verseString": "أَرَأَيْتَ إِنْ كَانَ عَلَى الْهُدَىٰ",
      "verseStringB": "Seest thou if he is on the right way,"
    },
    {
      "verseNumber": 12,
      "verseString": "أَوْ أَمَرَ بِالتَّقْوَىٰ",
      "verseStringB": "Or enjoins observance of duty?"
    },
    {
      "verseNumber": 13,
      "verseString": "أَرَأَيْتَ إِنْ كَذَّبَ وَتَوَلَّىٰ",
      "verseStringB": "Seest thou if he denies and turns away?"
    },
    {
      "verseNumber": 14,
      "verseString": "أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَىٰ",
      "verseStringB": "Knows he not that Allāh sees?"
    },
    {
      "verseNumber": 15,
      "verseString": "كَلَّا لَئِنْ لَمْ يَنْتَهِ لَنَسْفَعًا بِالنَّاصِيَةِ",
      "verseStringB": "Nay, if he desist not, We will seize him by the forelockᵃ—"
    },
    {
      "verseNumber": 16,
      "verseString": "نَاصِيَةٍ كَاذِبَةٍ خَاطِئَةٍ",
      "verseStringB": "A lying, sinful forelock!"
    },
    {
      "verseNumber": 17,
      "verseString": "فَلْيَدْعُ نَادِيَهُ",
      "verseStringB": "Then let him summon his council,"
    },
    {
      "verseNumber": 18,
      "verseString": "سَنَدْعُ الزَّبَانِيَةَ",
      "verseStringB": "We will summon the braves of the army.ᵃ"
    },
    {
      "verseNumber": 19,
      "verseString": "كَلَّا لَا تُطِعْهُ وَاسْجُدْ وَاقْتَرِبْ ۩",
      "verseStringB": "Nay! Obey him not, but prostrate thyself, and draw nigh (to Allāh).ᵃ"
    }
  ],
  "nameEnglish": "Clot",
  "nameTrans": "al-'Alaq",
  "nameArabic": "الـعلق",
  "chapterNumber": 96,
  "nVerses": 19,
  "footnotes": [
    {
      "note": "1a. The Arabs were an ummī people, a people who made no use of reading and writing, with very rare exceptions, and the Prophet himself did not know reading or writing, yet the very first revelation which he received from on High was a command to read. The significance of this order is expressed in v. 3, v. 2 being parenthetical as referring to the origin of man. The order to read is repeated in v. 3 with the addition of the words that thy Lord is most Generous, to show that it is through reading and writing that man can attain to a position of glory, while v. 4 says that it is by the use of the pen that knowledge can be acquired. The words in the name of thy Lord signify by the help of thy Lord. The use of the word Rabb (Nourisher unto perfection) is to show that revelation was being granted to the Prophet, to bring him, and through him the whole of humanity, to perfection. The circumstances attending this first revelation are met with in trustworthy reports, and from these it appears that the Holy Prophet’s first reply to the angel who brought this message was that he was unable to read (B. 1:1).\n\n2a. ‘Alaq signifies a clot of blood as well as attachment and love (T, LL). The former significance is the one generally adopted, because of the mention of ‘alaqah in the process of the creation of man in other places in the Holy Qur’ān, and it indicates the insignificance of man’s origin. Having regard to the other significance of ‘alaq, the words may, however, also be translated as meaning created man out of love. The Prophet is reported to have said: I (God) loved that I should be known, so I created man.\n\n3a. Akram and Karīm (from karuma, it was highly esteemed or excellent or valuable) mean Generous as well as Honourable (LL). This word has been used here in reference to the great goal of honour and glory which the Prophet was destined to attain.\n\n4a. The mention of the pen in this, the very first, revelation of the Holy Prophet, is significant, and it not only indicates, as Rodwell says, “the powerful help for propagating the knowledge of the Divine Unity” which the Holy Prophet was to find in the pen, but signifies as well that the pen should be specially used in guarding the revelation which was to be granted to the Holy Prophet. It is a fact that the pen has played an important part in the propagation of Islām as well as in the protection of the Qur’ān against corruption of every sort. The frequent mention of writing and the pen in the Holy Qur’ān, and particularly in connection with the revelation of the Holy Prophet, is rather striking when it is borne in mind that not only was the use of writing a rare novelty in the Arabian peninsula, but the Prophet was himself unacquainted with writing and reading.\n\n7a. Some reports apply the words from here to the end of this chapter to Abū Jahl,but the words are general. In fact, we are told here that man becomes inordinate or rebellious because he thinks himself to be self-sufficient, and free from all need of God Who breathed into him of His Spirit. The soul of man has in fact a mystic relation with the invisible Divine Spirit, which the materialist fails to realize.\n\n10a. There is special reference in the indefinite form to the Holy Prophet. So great was the opposition that the Prophet and his companions could not say their prayers in a public place.\n\n15a. Seizing by the forelock signifies a basement. In the battle of Badr — thirteen years after this — these opponents were actually abased.\n\n 18a. Al-nādī signifies al-majlis or the council. The dār al-Nadwah (from the sameroot nadā) was the great council-hall of the nation, where the chief men assembled together in consultation over matters of importance relating to the whole of the nation, the undertaking of wars, etc. The significance therefore is that they should take their decision unitedly and do their utmost against the Prophet and his message. The zabāniyah “with the Arabs of the classical age” signifies the shuraṭ (LL, so also Kf, Bd, Rz), “applied in the earlier sense of the braves of an army, or in the later sense of the armed attendants of the prefect of police. This is the primary significance” (LL). The two verses thus clearly speak of the battles in which the mighty men of both sides were to be brought into conflict.\n\n19a. The recital of this verse is followed by an actual prostration; see 7:206a"
    }
  ]
}
