{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "لَمْ يَكُنِ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ مُنْفَكِّينَ حَتَّىٰ تَأْتِيَهُمُ الْبَيِّنَةُ",
      "verseStringB": "Those who disbelieve from among the People of the Book and the idolaters could not have been freed till clear evidence came to themᵃ—"
    },
    {
      "verseNumber": 2,
      "verseString": "رَسُولٌ مِنَ اللَّهِ يَتْلُو صُحُفًا مُطَهَّرَةً",
      "verseStringB": "A Messenger from Allāh, reciting pure pages,ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "فِيهَا كُتُبٌ قَيِّمَةٌ",
      "verseStringB": "Wherein are (all) right books.ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "وَمَا تَفَرَّقَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِنْ بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَةُ",
      "verseStringB": "Nor did those to whom the Book was given become divided till clear evidence came to them.ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ ۚ وَذَٰلِكَ دِينُ الْقَيِّمَةِ",
      "verseStringB": "And they are enjoined naught but to serve Allāh, being sincere to Him in obedience, upright, and to keep up prayer and pay the poor-rate, and that is the right religion."
    },
    {
      "verseNumber": 6,
      "verseString": "إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ فِي نَارِ جَهَنَّمَ خَالِدِينَ فِيهَا ۚ أُولَٰئِكَ هُمْ شَرُّ الْبَرِيَّةِ",
      "verseStringB": "Those who disbelieve from among the People of the Book and the idolaters will be in the Fire of hell, abiding therein. They are the worst of creatures."
    },
    {
      "verseNumber": 7,
      "verseString": "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أُولَٰئِكَ هُمْ خَيْرُ الْبَرِيَّةِ",
      "verseStringB": "Those who believe and do good, they are the best of creatures."
    },
    {
      "verseNumber": 8,
      "verseString": "جَزَاؤُهُمْ عِنْدَ رَبِّهِمْ جَنَّاتُ عَدْنٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۖ رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ۚ ذَٰلِكَ لِمَنْ خَشِيَ رَبَّهُ",
      "verseStringB": "Their reward is with their Lord: Gardens of perpetuity wherein flow rivers, abiding therein forever. Allāh is well pleased with them and they are well pleased with Him.ᵃ That is for him who fears his Lord."
    }
  ],
  "nameEnglish": "Clear Evidence",
  "nameTrans": "al-Bayyinah",
  "nameArabic": "الـبينة",
  "chapterNumber": 98,
  "nVerses": 8,
  "footnotes": [
    { 
	  "note": "1a. Both the People of the Book, people to whom revelation had been granted at some previous time, and the idolaters of Arabia, among whom no prophet had ever appeared, were sunk so deep in immorality and sin that only a Divine Messenger could now free them from this bondage. The Jews and the Christians, one after another, had exerted themselves to their utmost to reform Arabia, but both had failed. In fact they were themselves demoralized like the Arabs. “It was not until they heard the spirit-stirring strains of the Arabian Prophet that they too awoke from their slumber, and sprang suddenly into a new and earnest life” (Muir). That by the Clear Evidence is meant the Prophet is made clear in the next verse, where this Clear Evidence is spoken of as being a Messenger from Allāh.\n\n2a. It should be noted that the Messenger is here described as reciting pure pages, thus showing clearly that the Qur’ān existed in a written form at the time of the revelation of this chapter. Their designation as pure is to show that the Holy Qur’ān brought them out of all impurities.\n\n3a. Kitāb (pl. kutab) means a book or an ordinance. Whichever significance may be adopted, the meaning of the passage is that all those right directions necessary for the guidance of man, whether previously revealed or not, are to be met with in the Holy Qur’ān. The Qur’ān thus claims to contain all the good points of other sacred books,and, in addition, to supply their deficiencies.\n\n4a. The division mentioned here is the division into believers and disbelievers, some accepting the Messenger and others rejecting him.\n\n8a. The companions of the Holy Prophet are here spoken of as having attained to the highest spiritual stage; compare 89:27–30, where the same words occur regarding spiritual perfection; see 89:30a. This shows clearly that they were above all worldly motives, and not only joined Islām with the single object of pleasing God but also that their sincerity was above all reproach to the end, so that God was pleased with them and made them enter His Garden."
	} 
  ]
}
