{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "إِذَا زُلْزِلَتِ الْأَرْضُ زِلْزَالَهَا",
      "verseStringB": "When the earth is shaken with her shaking,"
    },
    {
      "verseNumber": 2,
      "verseString": "وَأَخْرَجَتِ الْأَرْضُ أَثْقَالَهَا",
      "verseStringB": "And the earth brings forth her burdens,"
    },
    {
      "verseNumber": 3,
      "verseString": "وَقَالَ الْإِنْسَانُ مَا لَهَا",
      "verseStringB": "And man says: What has befallen her?"
    },
    {
      "verseNumber": 4,
      "verseString": "يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا",
      "verseStringB": "On that day she will tell her news,"
    },
    {
      "verseNumber": 5,
      "verseString": "بِأَنَّ رَبَّكَ أَوْحَىٰ لَهَا",
      "verseStringB": "As if thy Lord had revealed to her.ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "يَوْمَئِذٍ يَصْدُرُ النَّاسُ أَشْتَاتًا لِيُرَوْا أَعْمَالَهُمْ",
      "verseStringB": "On that day men will come forth in sundry bodies that they may be shown their works."
    },
    {
      "verseNumber": 7,
      "verseString": "فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ",
      "verseStringB": "So he who does an atom’s weight of good will see it."
    },
    {
      "verseNumber": 8,
      "verseString": "وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ",
      "verseStringB": "And he who does an atom’s weight of evil will see it.ᵃ"
    }
  ],
  "nameEnglish": "The Quake",
  "nameTrans": "az-Zalzalah",
  "nameArabic": "الـزلزلة",
  "chapterNumber": 99,
  "nVerses": 8,
  "footnotes": [
    { 
	  "note": "5a. The first verse speaks of a violent shaking of the earth. For the significance of zalzalah or shaking, see 22:1a. That such a shaking would take place at the Resurrection cannot be denied. That it took place in the Prophet’s lifetime is a fact. This was the shaking which brought about that wonderful transformation in Arabia, and then in the whole world, which is spoken of in the last chapter. The second verse speaks of the earth as bringing forth her burdens. This has been taken as signifying both the bringing forth of the dead and the yielding of her hidden treasures (RM). How the earth is bringing forth her hidden treasures of mineral wealth shows the wonderful knowledge of the future disclosed in the Qur’ān. That these are the preliminaries of a great transformation is the one theme of these early revelations. The transformation brought about in the Prophet’s lifetime was in fact the first stage in the greater transformation to be brought about in the whole world later on, the ākhirah of 93:4, for which see 93:5a. The mighty world-conflicts of our day and the unimaginable treasures brought forth in these days are in fact portents of what must follow, the spiritual awakening to be brought about in the world. Vv. 3 – 5 indicate that, at the happenings referred to in the first two verses, man will wonder and cry out, what has be fallen the earth? This shows that extraordinary happenings will be witnessed by man in this very life. The earth will tell her news, that is to say, great secrets hitherto unknown will be revealed. This is further stressed in v. 5,as if thy Lord had revealed to her. In other words, as revelation discloses things which are unknown to man, so will great secrets hitherto unknown be revealed. Maybe there is a deeper reference here that in the wake of these extraordinary happenings will come a general spiritual awakening, as if God had revealed to the earth itself.\n\n8a. Men will be shown their works in the Resurrection by being made to taste of their fruits, but they can also see the good or evil of their works in this life. Good and evil, when practised on a large scale, bring their reward or requital in this life as well.Note that the words here are he who does, and thus include both the Muslim and the non-Muslim. Even a non-Muslim who does an atom’s weight of good will have its reward, and a Muslim who does an atom’s weight of evil will be requited for it."	
	} 
  ]
}
