{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "Inᵃ the name of Allāh,ᵇ the Beneficent, the Merciful.ᶜ"
    },
    {
      "verseNumber": 1,
      "verseString": "أَلْهَاكُمُ التَّكَاثُرُ",
      "verseStringB": "Abundance diverts you,"
    },
    {
      "verseNumber": 2,
      "verseString": "حَتَّىٰ زُرْتُمُ الْمَقَابِرَ",
      "verseStringB": "Until you come to the graves.ᵃ"
    },
    {
      "verseNumber": 3,
      "verseString": "كَلَّا سَوْفَ تَعْلَمُونَ",
      "verseStringB": "Nay, you will soon know,"
    },
    {
      "verseNumber": 4,
      "verseString": "ثُمَّ كَلَّا سَوْفَ تَعْلَمُونَ",
      "verseStringB": "Nay, again, you will soon know."
    },
    {
      "verseNumber": 5,
      "verseString": "كَلَّا لَوْ تَعْلَمُونَ عِلْمَ الْيَقِينِ",
      "verseStringB": "Nay, would that you knew with a certain knowledge!ᵃ"
    },
    {
      "verseNumber": 6,
      "verseString": "لَتَرَوُنَّ الْجَحِيمَ",
      "verseStringB": " You will certainly see hell;"
    },
    {
      "verseNumber": 7,
      "verseString": "ثُمَّ لَتَرَوُنَّهَا عَيْنَ الْيَقِينِ",
      "verseStringB": "Then you will see it with certainty of sight;"
    },
    {
      "verseNumber": 8,
      "verseString": "ثُمَّ لَتُسْأَلُنَّ يَوْمَئِذٍ عَنِ النَّعِيمِ",
      "verseStringB": "Then on that day you shall certainly be questioned about the boons.ᵃ4"
    }
  ],
  "nameEnglish": "Abundance",
  "nameTrans": "at-Takathur",
  "nameArabic": "الـتكاثر",
  "chapterNumber": 102,
  "nVerses": 8,
  "footnotes": [
    { 
	  "note": "2a. Takåthur (from kathura, it became abundant or multiplied) means contendingtogether for superiority in (the amount or number of ) property or children or men (LL).According to Rz, the measure of tafå‘ul stands sometimes for the fi‘l itself, and takåthurthus may mean increase or abundance of wealth, etc. Coming to the graves stands fordeath. The significance therefore is that vying one with another in increase of wealthdiverts a man from the real object of life until he meets death.\n\n5a. When a man dies, he then comes to know that the acquisition of wealth was in noway the real object of his life. But if he had proceeded on the basis of certain knowledge,he could have seen this in this very life.\n\n8a. Verses 5–8 are considered as disclosing three degrees of certainty — ‘ilm alyaqßn, ‘ain al-yaqßn and √aqq al-yaqßn, i.e., certainty by inference, certainty by sight andcertainty by realization. A man can by inference attain to a certainty of the existence ofhell in this very life (vv. 5 and 6); after his death he will see hell with his own eyes (v. 7);but a perfect manifestation of it will be realized by him on the day of Resurrection (v. 8).Being questioned about the boons implies tasting of the punishment for failing to makeright use of what was granted to man. But the words may also be taken as applying to thislife. By pondering on the very nature of evil a man can become certain of hell, this beingthe certainty by inference. Then he can acquire a certain knowledge by sight, by seeingthe fate of others. Lastly, he is made to realize it by disasters being brought upon himself."	
	} 
  ]
}