{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "Inᵃ the name of Allāh,ᵇ the Beneficent, the Merciful.ᶜ"
    },
    {
      "verseNumber": 1,
      "verseString": "تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ",
      "verseStringB": "Ab∂ Lahab’s hands will perish and he will perish.ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "مَا أَغْنَىٰ عَنْهُ مَالُهُ وَمَا كَسَبَ",
      "verseStringB": "His wealth and that which he earns will not avail him."
    },
    {
      "verseNumber": 3,
      "verseString": "سَيَصْلَىٰ نَارًا ذَاتَ لَهَبٍ",
      "verseStringB": "He will burn in fire giving rise to flamesᵃ —"
    },
    {
      "verseNumber": 4,
      "verseString": "وَامْرَأَتُهُ حَمَّالَةَ الْحَطَبِ",
      "verseStringB": "And his wife — the bearer of slander;ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "فِي جِيدِهَا حَبْلٌ مِنْ مَسَدٍ",
      "verseStringB": "Upon her neck a halter of twisted rope!ᵃ"
    }
  ],
  "nameEnglish": "Thorns",
  "nameTrans": "al-Masad ",
  "nameArabic": "الـمسد",
  "chapterNumber": 111,
  "nVerses": 5,
  "footnotes": [
    { 
	  "note": "1a. A man of a fiery temper may be called ab∂-lahab or father of flame, as abu-l-khair(father of goodness) means a good man. ‘Abd al-‘Uzzå, an uncle of the Holy Prophet, beinga son of his grandfather ‘Abd al-MuΔΔalib, was known by this name, because of his ruddycomplexion or because of his fiery temper. It is related that the Holy Prophet, being commanded to warn his near relatives, called them together and delivered the Divine message,at which ‘Abd al-‘Uzzå cried out: “Mayest thou perish! Was it for this that thou didst summon us?” (B. 65:111). It is also related that he followed the Prophet when he went out topreach, saying to the people that the Prophet was a mad relative of his.His hands will perish means that all that he did in opposition to the Prophet will endin naught. And it is added that he himself will perish. He is reported to have died sevendays after hearing of the defeat of the Quraish at Badr.\n\n3a. He burned in fire in this very life owing to the fact that his life was a life ofheart-burning, on account of his failure to check the advance of Truth. This fire gave riseto flames which burned others as well, including his own wife, who is spoken of in thenext verse. There is also a reference to the palpable shape which this fire will take in theHereafter.\n\n4a. The flames that sprang from the fire in which Ab∂ Lahab lived enveloped hisown wife, so that even she took part in the opposition to the Prophet. Her part in opposition is here described as being √ammålat al-√aΔab, which is generally translated asmeaning bearer of fuel. It is thought that the reference here is to the thorny busheswhich she brought from the wood to spread in the Prophet’s way. But according to Mjd,the words mean bearer of slander, as she used to spread false reports against the Prophet(B. 65:cxi, 3). The same explanation is given by lexicologists who say that √aΔab meansfuel as well as calumny or slander, ya√milu al-√aΔaba means he goes about with slanderor calumny (LL). A similar explanation is given by Qatådah, who adds that she used tospread false reports about the Prophet (Rz).\n\n5a. It is said that Ab∂ Lahab’s wife died by being strangled by the very rope inwhich she used to bring thorns. But jßd is explained by LL as meaning the part of theneck on which the necklace is borne, and it is related that she was a wealthy woman whopossessed a necklace of jewelry. Maybe the twisted rope is a reference to her jewelry, asa jewelled necklace is as worthless in the eye of God as a rope. It is to the inner worththat God looks and not to the outward ornaments. Being a bearer of slander and calumny, she was morally as low as a woman with a halter or palm-fibre on her neck."
	} 
  ]
}