{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "Inᵃ the name of Allāh,ᵇ the Beneficent, the Merciful.ᶜ"
    },
    {
      "verseNumber": 1,
      "verseString": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ",
      "verseStringB": "Say: I seek refuge in the Lord of men,"
    },
    {
      "verseNumber": 2,
      "verseString": "مَلِكِ النَّاسِ",
      "verseStringB": "The King of men,"
    },
    {
      "verseNumber": 3,
      "verseString": "إِلَٰهِ النَّاسِ",
      "verseStringB": "The God of men,"
    },
    {
      "verseNumber": 4,
      "verseString": "مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ",
      "verseStringB": " From the evil of the whisperings of the slinking (devil),"
    },
    {
      "verseNumber": 5,
      "verseString": "الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ",
      "verseStringB": "Who whispers into the hearts of men,"
    },
    {
      "verseNumber": 6,
      "verseString": "مِنَ الْجِنَّةِ وَالنَّاسِ",
      "verseStringB": "From among the jinn and the men.ᵃ"
    }
  ],
  "nameEnglish": "Humankind",
  "nameTrans": "an-Nas",
  "nameArabic": "الـناس",
  "chapterNumber": 114,
  "nVerses": 6,
  "footnotes": [
    { 
      "note": "6a. These verses are, as it were, a complement to the previous chapter. Three kindsof mischief are pointed out there which may be done to the cause of Truth. Here afourth, but the gravest mischief of all, is pointed out. This is the mischief of the slinkingdevil, who comes stealthily and casts evil suggestions into the hearts of men. The whispering of the evil one is the greatest mischief because its source is in the hearts of men(v. 5). The word khannås is derived from khanasa, meaning he held back or hung back,and also he hid himself (LL), and al-khannås is the devil, because he retires or shrinks orhides himself (LL).Man is here taught to seek refuge in God Who is, in the first place, the Rabb ofmankind, i.e., its Nourisher by degrees to Perfection; secondly, He is the Malik or Kingof mankind, i.e., holds control over them, so far as the physical laws of nature are concerned; thirdly, He is the Ilåh of mankind, Who alone deserves to be worshipped andbefore Whom the whole of mankind must ultimately bow. In other words, the protectionof God is sought because He is the Nourisher Who brings to perfection, and He holdscontrol over Matter as well as Mind. The Divine purpose is thus again disclosed at theend, as it is disclosed in the very beginning (1:1) of the Holy Qur’ån. It is to bringmankind to perfection. Nothing in this world can frustrate this purpose, as God holdscontrol over matter as well as mind."
    } 
  ]
}