{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "Inᵃ the name of Allāh,ᵇ the Beneficent, the Merciful.ᶜ"
    },
    {
      "verseNumber": 1,
      "verseString": "أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ",
      "verseStringB": "Have We not expanded for thee thy breast,ᵃ"
    },
    {
      "verseNumber": 2,
      "verseString": "وَوَضَعْنَا عَنْكَ وِزْرَكَ",
      "verseStringB": "And removed from thee thy burden,"
    },
    {
      "verseNumber": 3,
      "verseString": "الَّذِي أَنْقَضَ ظَهْرَكَ",
      "verseStringB": "Which weighed down thy back,ᵃ"
    },
    {
      "verseNumber": 4,
      "verseString": "وَرَفَعْنَا لَكَ ذِكْرَكَ",
      "verseStringB": "And exalted for thee thy mention?ᵃ"
    },
    {
      "verseNumber": 5,
      "verseString": "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا",
      "verseStringB": "Surely with difficulty is ease,"
    },
    {
      "verseNumber": 6,
      "verseString": "إِنَّ مَعَ الْعُسْرِ يُسْرًا",
      "verseStringB": "With difficulty is surely ease.ᵃ"
    },
    {
      "verseNumber": 7,
      "verseString": "فَإِذَا فَرَغْتَ فَانْصَبْ",
      "verseStringB": "So when thou art free (from anxiety), work hard,ᵃ"
    },
    {
      "verseNumber": 8,
      "verseString": "وَإِلَىٰ رَبِّكَ فَارْغَبْ",
      "verseStringB": "And make thy Lord thy exclusive object."
    }
  ],
  "nameEnglish": "The Soothing",
  "nameTrans": "ash-Sharh",
  "nameArabic": "الـشرح",
  "chapterNumber": 94,
  "nVerses": 8,
  "footnotes": [
    { 
	  "note": "1a. The slanderers and defamers are condemned here generally, with particular reference to the opponents, who started their persecution of the Holy Prophet by bitterlyslandering and defaming him, so that the pilgrims coming to Makkah from afar shouldnot listen to his teachings. Just as goodness and patience are combined in the previouschapter as the two qualities which are the foundations on which human character shouldbe built, the amassing of wealth and defaming are combined here as the two evils whichlead ultimately to disaster.\n\n2a. ‘Addada-h∂ signifies he considered it a provision against the casualties of fortune (LA). It also means he reckoned or counted it (LL). It is a succinct but exact pictureof the material civilization of our day.\n\n3a. By abiding is meant abiding in prosperity, or lasting forever.4a. Al-√uΔamah is derived from √aΔima, meaning it became broken into pieces (LL).The name is applied to hell, because it crushes everything that is cast into it. It includesboth hell and other disasters which, it is prophesied, would crush the wealthy defamersof the Truth, their punishment being called by this name because they wanted to crushthe Truth.\n\n7a. The Fire of hell is described as rising over the hearts, showing that it is withinthe heart of man that the origin of hell-fire lies. A man’s hell is thus within his own heartin this life.\n\n9a. It is inordinate desires extending beyond all limits that give rise to extendedcolumns of fire. Spiritually they may be witnessed in this life, but they assume a palpable shape in the next."	
	} 
  ]
}